its
show
addressee_identification
particular
word_sense_disambiguation_(WSD)
current
undisambiguated
CFG filter
target_corpus
so
it
tune
conjunction
less
within
dimensionalized_space
type
information_flow
the
phone_n-gram_model
trained
Arabic_word_segmentation_system
temporal_connective
Unification_Categorial_Grammar_(UCG)
depending
either
incremental_description_refinement
field_structured_extraction_tasks,
parsing_data
ranks
contain
extract
Web
connectionist_(neural)_network
needed
text_model
compression_ratio
English_Wikipedia,
clauses
phrase_boundary_heuristics
87.5%
showing
verbs
idiosyncracies
(Karttunen,
relationship
speech_processing
frequency_counts
pair
non-terminal_symbol
generation_system
lexical_conceptual_structure_(LCS)_representations
answering_agents
source_language
cross-lingual_comparisons
treat
semantic_distance
achieve
competitive
free-content
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
analogies
corpus-based_method
amounts
further
restricted_vocabulary
generation
machine_translation_pipeline
O(n6)_time
though
paraphrasing
defeasibility
Semantic_theories
language_functionalities
help
referring_expressions
written
pairs
recognition
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
statistical_approaches,
MSR- closed
primarily
analysis_mechanism
concepts
superset_of_L
CCR_formalism
them
structured_databases
written_and_spoken_language
extended_domain_of_locality_(EDOL)
MUC-6 and MUC-7 English NE tasks
indexing
framework
23,000
tool
appears
appear
constitute
segmented_strings
affix_removal
word's
speech-based_Information_Retrieval_(IR)
coordinate_phrases
independently trained models
nature
gaps
described,
bilingual_corpora
trainable_sentence_planner
textual
working
classifier_assignment
graphic_interpretation_system
efficient
French_tenses
evaluation_method
context-free_grammars
PER
studied
learn
combination_methods
best-path,_bottom-up,_deterministic_parser
Japanese-English_translation,
evaluation_of_Natural_Language_systems
InfoMagnets
begin
ambiguity_representations
ambiguity_packing_and_stochastic_disambiguation_techniques
firmly
visualization_method,
Prolog
word-dependent_substitution_costs
logical_form_language
evidence
similarity
nominal_compounds
monolingual_parallel_corpora
unsupervised_learning_method
capability
semantic_role_labeling
model_checking
human_cognition
convolution_kernel
dictionary_word_sense_definitions
good,
languages
97%
edit_distance
machine_translation_(MT)_evaluation
paraphrasing_method
operational_foreign_language_tutoring
selected
unseen_data
(for
programming_language
statistical_MT_performance
integrate
knowledge_sources
senses
automated_interpretation
summary_generation
carry
stages
155
roots_words
multimodal_parsing_and_understanding
relevance
joint_model
check
right-side dependencies
evaluation_measure
question-focused_sentence_retrieval
subcategorization_classes
noun_phrase_chunks
HTML_documents
semantic_domain_models
SRHs
Korean_phonological_knowledge_base_system
partial_theories
path_values
structure-sharing_of_graphs
human-machine_interactions
straightforward
conventional_statistical_methods
training_method
apartment
linguistic_introspection
manual_feature_selection
personal_names,
CF_grammars
quality
traditional
specified
effectiveness
oral_communication
unsupervised_methods
output
examples
been
KL-ONE-like_knowledge_representation_systems
source_dependency_parse
accuracy_rate
transliteration_process
while
million
predictably
blocks
analyze
machine_translation_system
alternative_markers
consequences
instance,
behavioral_patterns
natural_language_generation
survey
dialogue_translation_system
KDS
proposed
data_representation
automatic
bit-vector_operations
reference_model
formal
single
Recognition_of_proper_nouns
phrases
fourteen
manually_segmented_Arabic_corpus
Machine_transliteration/back-transliteration
text_understanding
syntactically_motivated_relations
multiple_parsing_strategies,
subcategorization_cues
restricted_natural_language
speech_recognition_hypotheses_(SRH)
XTAG
able
filled
occurring
category
provides
user_modeling
suggests
combine
similar_context_features
Head_Grammars
QA_system
namely
performing
naming_conventions
significant
missing_words
correspond
analyst
applications
event_terms
depend
possible,
IR
89.75%
customized
high-quality_data
projection_of_structures
attributes
focus
scoring
IntEx_system
natural_language_understanding
(P05-1076.10
previous
ensemble_learning_approach
entailment_acquisition
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
discriminative_training_criterion
training
80.5%
morphology
LM
language_identification
genre
feedback
morpheme_sequence
content_words
developed,
WSD_models
unpleasant
protocol_analysis
7.5%
Situation_Theory
resource
world
that
naturally
Dutch
spoken_multiparty_dialogue
significantly
pharmaceutical news archive
category_labels
Node-based_inference
applied
transliteration/backtransliteration_experiments
described
useful_terms
out-of-domain_corpus
bit-vector-based_CKY-style_parser
theory
contains
component
when
unified
Chat-80
segmentation bakeoff
formulate
parsing_process
attentional_structure_in_discourse
sentence
characters-based_Chinese_collocation_system
topic_information
cognitive_psychology
utilizes
reduced_IL_formulae
in-domain_corpus
experiments:
there
structured_natural_language_data
syntactic_analysis
word-sense_disambiguation_algorithm
specific_heuristics
Task-based_evaluation
speech_synthesis_systems
arbitrarily
candidate
Japanese_text_processing
body
summary
approximation_error
statistical_model
specifications
formalisms
transcribing
natural_language_processing
training_resources
student
entity-based_representation
trajectory
categories
DRT
text_processors
referential_elements
task
DoPS_system
usually
improves
source_language_text
shallow_linguistic_features
aligned_bilingual_corpus
decision-making
fundamental
n-ary_relations
rule-based_systems
state-of-the-art_coherence_model
automaton
evaluating
baseline_system
Natural_Language_Processing_(NLP)_system
stochastic,_graph-based_method
event_map
still
function_words
hoc
logic
temporary_belief
do
collection_of_relations_and_operations
documents
anaphora_references
word_n-grams
string_similarity
unannotated_text
projecting
express
formatted_weather_data
interrogatives
domain_specific_terms
statistical_models
real-valued_features
dynamic_combiner
virtual_reality_3D_scene_modeling_software
email_conversation
collecting
shared_lexical_information
antonymous_adjectives
word-sense_disambiguation_systems,
limited
(Bikel,
tie
English/Chinese_and_English/Japanese_language_pairs
intentions
crossing_liaisons
unsupervised_learning_approach
impacts
be
biomedical_and_linguistic_ontologies
generates
Markov_model
concept
speech_processing,
augmented_Friedman_-_Warren_algorithm
shallow_techniques
priming
phrase-based_unigram_model
shared_derivation_forest
functions
word-to-word_alignments
decision_tree_learning
question_phrases
hierarchical_relations
Japanese_sentence_analyses
systemic_grammar
modular_architecture
a
target
dialog_systems
abstractions
CAS
connectionist_component
quantifying_noun_groups
features
adjacent
defeasible_reasoning
discourse-relevant_purposes
well
task-oriented_dialogs
support_vector_machine
domain_dependence
series
we
variant
answer_resolution_algorithm
previously
Japanese_verb_phrases
dictionary-based_word_vectors
aid
domain
various
correlation_measure
even
culling
German
transfer_phase
handling
free_word_order
interactive_problem_solving
test_corpora
Comparator_software
attentional_state
(Biber,1993;
flexible_parser
query_terms
distributions
Turkish_dependency_treebank
language
primitive_Optimality_Theory_(OTP),
syntactic_categories
kind
syntactic_and_semantic_dependencies
relative_error_rate_reduction
target_document
equivalences,
each
serves
thus
grammatical_number
few
acquisition_of_word-semantic_information
certification
psycholinguistic_literature
forecasts
79.1%
surface_English
proper
reasoning_with_dispositions
duration_model
find
using
stems
then
containing
error-correction_rules
incorporated
unsupervised_automatic_acquisition
phrase translations
beam-search_decoder
maintains
anaphora
parallel_corpus
discourse_relations
paraphrase
common
Natural_Language_Processing_(NLP)_applications
translation
scf types
detect
sentential_paraphrases
Japanese_unknown_words
elaborated
STRAND
conceptual_system
presumed
candidates
abstract
relied
existence
morphological_analysis_problem
natural_language_text
sets
verb
volume
demonstrated
automatic_alignments
parsing_strategies
minimizes
computational_complexity
token-based_models
Hidden_Markov_Model
does
operate
context-free_parsing
via
ranking
runs
constraint
user_knowledge_modeling_architecture
Thai_key_prediction
benchmark_system
components
replete
architectural_modules
Chinese_words
probabilities
data_objects
robustness
global_meaning
accurate
about
Intel_i860_chip
devised
semantic_role_labeling,
forward_pass,
audio_and_scanned_image_data
vector_space_model
Machine_Translation_(MT)_systems
NP-_and_non-NP-antecedents
problematic
intentional_structure
semantic constraints
derived_words
human_transcriptions
alignment_adaptation_approach
supported
practically_unsupervised_learning_method
attentional_focus
language_model
human_data
linguistic_annotation
syntactic_analysis_system
translation_relation,
"black-box"_methodology
system_output
parse_reduction
co-occurrence_patterns
need
node-based_inference
model_theoretic_interpretation
wildcards
created
second_language_and_cognitive_skill_acquisition
general-purpose_NLP_components
substitutions
efficient,
temporal_anaphora_phenomena
automatic_evaluation
judicious
powerful
Source_and_Target_languages
passed
expensive
temporal_logic_CTL
language_learning_model
dependency_relation_paths
interpolation_methods,
resolving
remains
rankings
paper
vast
P-CFG
some
computational_semantic_analyses
log-linear_combination
subset
estimate
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
CFG_parser
focus_of_attention
error_rate
logical_model
resolve
linguistic_parser/generator
required
semantic_constraints
training_corpus
LSA-based_and_the_cooccurrence-based_word_vectors
classification-based_representation_techniques
retrieval_effectiveness
post-processing
co-occurrence_similarities
deductive_approach
irrelevant
graph_transformations
fuzzy_quantifier
77%
independent_classifiers
Mimo_formalism
word-based_system
proof procedure
extraction
HK-open,
WSD_task
chunks_of_words
pushdown_automaton
processes
machine_translation_task
natural_language_interfaces
Basque
user_model
syntax-based_constraint
LMs
spoken_corpora
(in
Discourse_Representation_Theory
feature_structures
argued
only
including
spoken_dialogue_systems
determining
100,000
uses
large-vocabulary_speech_recognition
representation_scheme
predicting
sense
[ANA]
MWEs
conceptually
semantic_information
translation_candidates
email_communication
bare_slice_disambiguation
corpus-based_approach
research
translation_quality
access
amount
memory-based_learning_chunker
alternative
semantic_interpretation
Named_Entity_task
prior_knowledge
circuit_specifications
spelling_correction
constructs
marked
dialogue_corpora
during
were
experimental_evaluation
to
Italian and English verb subcategorization frames (SCFs)
procedural
word_pairs
ARPA_large-vocabulary_CSR_corpora
phonological_system
associated
assignments
outperforms
offers
lack
full_parsing
listener
well_calibrated_probabilities
shallow_mapping
loss_functions
TAG
event_structure
calculus
error
pooling
achieves
scfs
JAVELIN_system
involve
automated_evaluation_techniques,
part_of_speech_information
target_vocabulary
input
mutual_information
official_rankings
should
predominant_senses
entirely_data-driven_model_selection_procedure
phrase_chunking
keywords
segment-based_approach
formal_analysis
domain-specific_semantic_information
distinct
maximum-entropy_model
conditional_loglinear_models
8000-word
core_modules
dialog_motivators
ad
parsing_technique
American Sign Language (ASL) animation
information_retrieval_techniques
Japanese_natural_language_processing_studies
polynomial_time_solution
latent_variable_model
PK-closed,
anaphoric_component
feature-based relation extraction
automatic_evaluation_measures
Noun Classifier Associations (NCA)
Plume's_approach_to_parsing
Paramax_spoken_language_understanding_system
event
scientific
robust
direct
aids
exploratory_corpus_analysis
structured
–
part-of-speech_annotation
optimum_iteration_number
rule-based_learning_algorithm,
syntax-based_statistical_machine_translation_system
version
robustness_problems
entities
unsupervised_training
unsupervised_learning
language_independent_modules
methodology
advertisements
voice_input
novel
human_plausible_reasoning
feature_structure-directed_generation,
data_representations
error_correction
Kullback-Leibler_distance,
largely
structural_information
predictive_questioning
corpus_data
abstraction
epistemological_level
Chinese_language,
user-specified
attribute_sequences
fuzzy_syllogism
effectively
strongly
assigning
Spelling-checkers
expletive_occurrences
(e.g.
biomedical_text
Grosz-Sidner-style_focus_model
viewpoint
recall,
than
whole
Longman_Dictionary_of_Contemporary_English
discourse_processing
typicality
morphological_analyzer
four
retrieval
Lucy
adapted
IE_module
semantic_composition
et
problem
varied
conversation_analysis
flexible_parsing
filter
meet
email-threads
interlingual_approach
sequential_models
lexicalised
discourse_segmentation
surface_realizations
ability
strong
makes
multiple_and_nested_interactions
Turkish_word_structures
unification-based_parsing
database
combined
hidden-variable assignments:
knowledge-based_generation_systems
analytical_components
morphological_analysis
qualitative_spatial_constraints
statistical_learning_mechanisms
statistical_machine_translation
algorithm
case-based_MT_(CBMT)
illustrated
conditioning variables
natural_language_interface
translation_performance
may
deterministic_finite_automaton
compare
bootstrap
decoding
PCFG-LA model
along
constructed
events
can
semantic_criterion
terminology_structuring
lexical_substitutions
Statistical_Machine_Translation_(SMT)
unification-based_linguistic_descriptions
personal_computers
word_significance_(weights)
new_sublanguage
spatial_descriptions
rank,
VME_bus
named entities
linguistic_resources
HMM_training
40
English_sentence_structure
enriching
yields
chunking
triple
ungrammatical_input
tractable
segmentation
dynamic_language_model_combination
easy-to-implement
compositionality
Gaussian_mixture
dictionary
TV_shows
Japanese_language_dictionary
task-specific_domain_knowledge
limits
skips
IBM_translation_models
implements
user
averaging
grammar
textual_corpus
discourse_structure
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
real-world entities
arbitrary
claimed
have
translation_hypotheses
generative_history-based_latent_variable_model
both
research_articles
direction-giving_task
strengths
high
comparative
modular
reasonably
emoticons
"glue_language"
dialogue_acquisition_and_tracking_algorithm
formulated
word-senses
domain_independent_features
ways
two-phase_shift-reduce_dependency_parser
set
quantification_over_events
widely
words,
ungrammatical segmentations
Czech_WordNet
helpful
young
conceptual_level
F-measures
ILIMP
operates
nominals
machine_translation
generator
hardware_designs
clustering_methods
viewed
question/answer_pairs
made
represented
unequal
military_and_civilian_systems
greatly
under
logical_formulas
contexts
conditional_log-linear_model,
improvement
cohesive text
accuracy
was
word_tokens
bottom-up_pattern-matching_parser
MWEs_database
spoken_language
exact_match_accuracy
characterize
stereotyped_text_structure
grammar_checker
VSM_model
level
f-structures
critical_discussion
definitions
evaluation_metrics
hidden_variables
learners
on
related
build
integrates
could
estimated
produce
incorporate
agree
tree-to-tree_translation
systems
dictionaries_of_word_forms
distributional_concept-distance_measures
linguistic_phenomena
extensive
deep_processing
searched
Graph_unification
resolution_component
offer
[Zernik88],
retrieval_approach
generalized_metaphor
small
into
recognition_network
definition_sentences
MT,
large-scale
chart-based_phrase_structure_parsing
honorifics
speaker-independent_(SI)_training
NLP_tasks
RINA,
relative_frequency_of_occurrence
word_significance
particularly
one
phrase_structure_grammar
word-based_models
mathematical_expressions
flexibilities
noun_WSD_problems
cooperative
relevant
text
dialogue_system
semantic_equivalence
more
cannot
linguistic_and_non-linguistic_knowledge
named_entity_(NE)_recognition_(NER)_system
SCFs
word
non-configurational_languages
generalized_translation_knowledge
Graphical_User_Interface_(GUI)_functions
5%
educational_tool,
probabilistic_model
Collins_(2000)_reranker
160
log-linear and linear interpolation,
way
make
underpinning,
term_extraction
Japanese
numerous
program
126,610
confidence_measures
electronic_newsgroup_discussions
text-level_anaphora
HDAGs
auxiliary
predictive_performance
LT_(LF)
deaf
similar
expectations,
finite-state_models
character_and_word_error_rate
hypothesis
tailoring
machine_translation_output
grammar_formalisms
input_word
word_sense_disambiguation_(WSD)_systems
Hong
conversation_transcripts
Arabic_word_segmenter
deduced
answers
observed
natural_language_processing,
work
MSR-open
formalization
expressed
encyclopedia,
Japanese_script
account
WordNet-based_measures,
sometimes
focussed
pronoun
train
search
extensively
<
excluded
hypothesize
ideograms
target speaker
textual_domain,
English-French_document_pairs
final
natural_language_interpretation
grammar_coverage_problems
RAREAS
top-down_derivation
identifying
answer_candidates
designed
robust_generator
kinds
0(n)_time
retrieval_performance
procedures
word_error_rate_(WER)
idiosyncrasies
normal
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
generation_problem
inference_types
underspecified representations
translation_lexicon
explanation_generation
subcategorization_frame_(SCF)
word-lemma_based_feature_function_models
same
elementary_structures
referential_information
polynomial_time
collocations
traditional_distributional_word-distance_measures
statistical_alignment_techniques
expectation-maximization_(EM)_based_word-clustering_algorithm,
discursive_usage
grammar_sensu_stricto
hard_problems
edges
significance
cooccurrence_statistics
Mimo,
parse_forest_representation
spoken_language_corpus
Czech-English_statistical_machine_translation_system
introduction
applying
constraining
semantic_relations
ranking_learning_problem
grs
arguments
embodied
generative_probabilistic_model
character_bigrams
articles
control
context-free_chart_parsing
handles
reflect
decision_tree_based_approach
pronominalization,
story
text,
interlingua
text_processing
derived
newswire_texts
Korean_and_English_language_pairs
marks
suffix_array-based_data_structure
compactly
saturation
threads
lexical_affinity
resource-frugal_approach
tree
model_parameters
compact
whose
system_response
polarization
modified
lexical_and_syntactic_features
support
bilingual_dictionaries
probabilistic_finite_automaton
BMM_algorithm
Penn_WSJ
spectral_clustering_based_approach
declarative_languages
cognitively_well-motivated_interfaces
starting
part
comprehensive
language_processing_systems
probabilistic context-free grammars
part-of-speech_tagging,
non-terminals
cue_phrases
extraction_system
information_extraction_system
exhibit
threading_algorithm
pragmatics_processing,
MT_evaluation
development
alignment
context-free_phrase_structure_rules
strictly_syntactic_cross-serial_agreement
generated
(
polysemy
likelihood
automatic_metrics
many
an
ambiguous
28,449
commonsense_reasoning
spelling-checkers
which
plays
track
open-domain_question_answering
are
parallel_data
domain-independent_capabilities
vectors
oriented
minor
training_material
robust---an
relying
full_NPs
word_string
reestimation_formulas
etc.,
spontaneous_speech
utterances
unlexicalized_parser
areas
keep
input_dataset
Construct_Algebra
describes
dynamic_programming_(DP)
grammatical_relations
Slavic language
dependency_parsing
graphical_model
large_Czech_MWE_database
how
formulas
centering approach
author
subset_of_logic
enumeration
Generalized_Alignment
syntactic_descriptions
NL_evaluations
corpus-based sample
acquire
available
rating
derivational_history
dialog_management_system
syntactic_disambiguation
rhetorical_patterns
translation_paths
semantic
queries
preceding_words
method_to_automatically_acquire_paraphrases
KPSG
potential
MBR_decoding
Automatic_Speech_Recognition_technology
feature_selection_methods
trend
graceful
lexicalized_grammar
integration
higher
computational_linguistics
built
existing
presented
seem
smaller
empirical
configurable
unsegmented_Arabic_corpus
linguistic_processing
computational_lexicon
Procedural_Systemic_Grammar
new_event_detection
unique
discourse segment,
manual_transcription
preceeding
accuracies
scenario_templates
Syllogistic_reasoning_with_dispositions
making
reference_sets
syntactic_analyzer,
Japanese_character_strings
WH-questions
categorization_task,
flexible,
sense_priors
linguistic_PoS_tagger_and_chunker
automatically
Coedition
task-specific_language_development
Log-linear_models
pronoun_"it"
represent
MORphological_PArser_MORPA
smoothing
Smadja,1993)
tag
reduplications
semi-supervised_methods
small,_domain-specific_corpus
speeches
worse
labels
English-Chinese_bitexts
laws
parts of speech
descriptions
new_domain
topic_signature
word_sense_definitions
consist
segmentation_standards
multilingual,_multimedia_data
French
multilingual_input
translation_images
aware
language processing pipeline
multi-strategy_and_multi-source_approach_to_question_answering
did
direct_orthographical_mapping_(DOM)
priors
discourse_context
stochastic_output_selection
natural_language_processing_(NLP)_systems
gain
modeling
require
cross-entropy
constituent_parts
synonymous expressions
information_source
spoken_dialogue
dialogue
parser_MDCC
satisfactorily
respect
transformation_model
maximum_entropy_word_alignment_algorithm
user-directed_summaries
well-written_discourse
conventionally
SCFs_distributions
general_linguistic_knowledge
translation lexicons
types
introduce
LFG_semantics
FDA
dialogue_systems
German_text_corpora
distance
relatively
hidden Markov models (HMM),
HMM_with_Gaussian_mixture_observation_densities
range_concatenation_grammar_[RCG]_formalism
phrase-based_statistical_machine_translation_method,
automatically_acquired_parallel_corpus
subcategorization_dictionary
directly
occur
tests
full_scale_two-level_morphological_description
MT
guide
take
unsupervised learning
sequences
punctuation
subcategorization_frames
properties
patterns
natural_language_environment
backwards_transliterations
multiple_complementation_patterns
CTL
developing
blackboard-like_architecture
answer
voice_interactive_system
induced
rely
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
improvements
song_lyrics
statistical_analysis
from
discourse
complex_sentences
Arabic_information_retrieval
Japanese_sentence_structure
understanding
language_modeling
logic,
text-to-speech_conversion_system
coordinations
text_applications
weaknesses,
SVM_learning
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
resulting
source_interval_projections
paraphrases
substrings
language-independent_system
feature_vectors
based
address
cooccurrence
gives
unambiguous_structures
word-based_alignments
adequate
traditional_knowledge-based_techniques
explicit
as
Chinese_newspapers
referents
node_structures
parse-trees
Czech
gained
generative_model,
clustering_and_filtering_processes
users
associative_similarity
human
sentences,
extracting_subcategorization_frames
1
dependency_relations
machine_transliteration/backtransliteration
space
semantically_related_words
graphics_displays
disjunctive_feature_structures
CFG_parsers
hand-crafted_template-based_or_rule-based_approaches
augment
concept-distance_measures
Words
document-oriented_applications
multi-pathway_MT_architecture_design
JAVELIN
result
tree-bank
syntactic_coverage
grammatical_sentences
method_of_analyzing_metaphors
Polymorphemic_stems
capture
Chinese_text_corpora
MT_output
utilizing
syntactic_priming
derived_string
disjunctions
bilingual_dependency_relations
chunking_results
HBG_model
manually_segmented_corpus
distribution
electronic_discussions
lexical_similarity
extracted
determination
F-measure
different-quality_references
query_optimisation
incorporates
pruning_criteria
non-contiguous_phrases
performance_improvement
element
determined
textual_credibility_indicators
stemming_model
rule-based_heuristics
Nigam
Lexical-Functional_Grammars_(LFG)
segment_order-sensitive_methods
BLEU
construction
comprising
training_and_testing_factors
medium-length
expression
syntax
yield
portion
automatic_evaluations
probabilistic_context-free_grammars
done
automatic_abstracting_systems,
raw_text
vagueness
integrating
inflected_forms
upon
"one-time_look_up"_method
planning-based_architecture
computational_methods
WWER
lexicon
sentence_analysis
genre-specific_regularities
RCL_parsers
format
context_free_languages
simple_clausal_structures
suffix_analysis
Bayesian_learning
1983)
spoken_language_technology
song_lyric_document
IE_paradigm
tree_adjoining_grammar
comparable,_non-parallel_corpora
decision-tree_approach
NLP
sides
pronouns
writing
genetic_search
members
outperform
improved
summarization
formalising
rule-based_translation_systems
spatial_attributes
indices
supervised_and_unsupervised_methods
trees
discourse-level construct
KL-ONE_style_representation
113K
classifier_word
stored
parse_forest
marine
improve
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
distributional_hypothesis
test_language
onto
subpredicates
user_interface_styles_or_conventions
multi-strategy_approach
entailment_relations
mobile_military_command_and_control
topic_signatures
Proposition_Bank_data
whether
purposes
solution
speaker_adaptation_(SA)
NLP_system
program,
decision_trees
grammatical_gender
phonetic_recognition
annotating_scheme
seed_sentences
currently
syntactico-semantic_(tectogrammatical)_annotation
Praguian_dependency-based_approach
exceeds
small-scale
differ
deal
in
special
captures
Cooperative_Model
mainly
JINTACCS_messages
surface_representation
discourses
rather
CCLINC_Korean-to-English_translation_system
fits
LR-parser
meaning-entailing_substitutability
formal_intersections_of_FSAs
spoken_language_understanding_system
management_of_uncertainty
theoretical_linguistic_investigations
running
objects
references
temporal_relations
natural_language_generation_community
decoding_strategy
machine-readable_resources
feature-based_word_grammar
part_of_speech_(pos)_tagging
reduplication
sounding
beyond
finite
hierarchical_lexicon
continuous_density_HMM
linguistic_representation
rule-invocation_strategies
classified
word_error_rate
necessary
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
correlate
Chinese_text
Systemic_grammar
's
automatic_Q/A
compositional_syntax_rules
operational_semantics
lower
disambiguation_tool
evaluation_measures
computational_problems
classifiers
monolingual_and_bilingual_information
localized_phrase-based_prediction_model
parse trees
legal_terminology
combines
terms,
extracted_fields
classifier
search engine
histogram
GUIs
grammatically_correct_input
extracted_field
construct
linguistic rules
building
equivalent
learning_algorithm
segments
specialized_parsing_techniques
seeds
fragments
expectations
free_indexation
lattice-based_approach
state-of-the-art_performance
knowledge_engineering
purpose
referential_properties_of_noun_phrases
English-Japanese,
heuristic_principles
knowledge-based_and_random_selection_procedures
baseline
gave
Word_Sketch_Engine,
dependencies
regarded
morphological_constructions
standard
cognito-pragmatic
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
traditional_deterministic_parsers
provide
word-aligned_corpora
lemma-based_model
text_mining_method
contextual_similarity
answer_extraction
SI_corpus
PoS-tag_feature_function
Path-based_inference
on-line_encyclopedias_and_dictionaries
topics
statistical_machine_translation_(MT)
computer_text_generation_system
pattern
modules
ECA
automatic_segmentation
test
EDOL
Node-based_inference_rules
weighted_finite-state_device
MT_evaluation_techniques
human_judgment
unknown_words
human_understanding_of_natural_language
statistical_techniques
overt_case_markers
task_representation
captured
derived_strings
supervised_learning
bigram_back-off_language_models
statistical_profile
restricted_subset
IE-enhanced_text_browsers
processing
machine-readable_dictionaries_(MRD's)
useful
spoken_language_understanding
temporal_adverbials
abduction
linguistically
Plume
left_corner_parsing_algorithm
broad_coverage_lexicon
hierarchical_(or_other_types_of)_relations
vocabulary),
attain
completeness
unification-based_grammar
at
transition_graphs
repository
allow
neat_texts
probabilistic_context-free_grammar
very
evaluated
inference
dramatically
extracts
OT
itself
relational_database
written_English
denotational_semantics
class_of_languages
parse_tree
(German-English,
English-Chinese_parallel_corpora
statistical_parameters
Large-scale_natural_language_generation
GPSG
limitations
deviates
first
morpho-syntactic_and_semantic_characteristics
leading
metric
overall
efficiency
constructions
parsed
proper_names
names
motivated
machine_translation_outputs
word_clusters
facilitate
al.
alleviate
sentence_plans
theory_of_attention,_intention,_and_aggregation_of_utterances
mapped
lexical_approaches
training_examples
much-studied
zero pronouns
clusters
frequency_profiles
information_extraction_techniques
genres
presence
weights
semantic_expressibility
textual_corpora
dialogue_interaction
Dutch_Senseval-2_test_data
thematic_grid_tagging,
adopts
-
needs
agglutinating_free_word_order_language
TRDR_score
performance
mappings
time_exponential_on_the_size_of_the_grammar
learned
POS_learning
restrictive_statements
deals
representation
all
decision_strategies
text_corpus
segment_boundaries
much
domain_knowledge
--
parallel_corpora
lexical_coverage
synthesizes
grammars
shows
common_text_processing_modules
TAP-XL_Automated_Analyst's_Assistant
hybrid_generator,
abstracts
translation_framework
cooperative_responses
model_design
of
technique
tools
speech_and_text-image_recognition
probabilistic_translation_models
semantic_caseframe_instantiation
enhance
semantic-oriented_NLP_applications
dependency-based_grammar_model
Boolean_conditions
ordinary
word_clustering
reliable
critical
encodes
rank
implicitly
Temporal_Expression_Anchoror_(TEA),
generators
PropBank
bag-of-words_methods
word_order
such
token_classification_task,
Dialogue_strategies
constraint_system
equivalence
draws
DARPA_Spoken_Language_Systems_(SLS)_program
variety
semantics
ill-formed_input
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
MeSH_relations
computed
language_modeling_tasks
interconnected
linguistic_structure
used
Dictionary_construction,
parsing_algorithm
reference
handle
lexical category ambiguity
out
agreement
interpret
context-sensitive,_phrase_structure_grammar
AS-closed,
Name List,
distinguish
generative_model
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
prototype_system
shift-reduce_dependency_parsers
connectivity
heuristic_learning
industry_watch
SMT_research_community
annotation
laboratory_study
lexicalized_structures
semantic_annotation
deterministic_parsers
polarity-tagged_corpus
valuable
sentence-level_and_text-level_anaphora
symbolic knowledge
scruffy_texts
fully-connected_first-order_statistical_class_grammar
biological_entities
generalized_metaphor_mappings
syntactic_information
surface_forms
Path-based_inference_rules
multi-strategy_framework
lexical,_syntactic,_semantic,_and_structural_information
acquired
machine translation (MT) systems
unification-based_grammatical_frameworks
parsed_corpus
KL-Conc,
adding
difficult
macro-average_F1_performance
defined
information_extraction_tasks
habituality
individual
linguistic information,
explore
Combination_methods
transfer_approach
suitable
maximization
substantial
word-based_collocational_properties
found
functional_structure
word_examples
produced
use
unification-based_grammar_parsing
incremental_probabilistic_parser
Generalized_Quantifier_approach
distributional_approximation
hierarchy
superordinate -hyponym relation,
augmented
ambiguities
large-vocabulary_CSR,
parser
n-gram_transliteration_model_(n-gram_TM),
APT
tagging
faced
together
utterance
contributes
M
shown
context
valid
computationally
tagger
adaptive_learning_procedure
Child_Language_Data_Exchange_System_(CHILDES)
dialog_manager,
probability-based_scoring_function
2491
scope_ambiguity
predicate_calculus_notation
Topic_signatures
multisentential and multi-paragraph explanations
indirectly
content-independent_formalism
language_(L0)
translation_memory_system
natural language interfaces
computational
hypotheses_graph
sublanguage,
overcome
hard decisions
positive_and_negative_definition_examples
single-snippet_answers
through
sense-tagged_training_data
machine_learning_techniques
biases
natural_languages
Translations
meta-inference_types
considered
large
Horn_clauses
ambiguity_resolution
35.0%
certainty_conditions
TL
speed
statistical_parser
Korean
Taiwan_Child_Language_Corpus
providing
groupings
embodied_conversational_agent
parsing-based_NE_rules
verb-noun_collocation_dictionary_for_Polish
statistical_machine_translation_(SMT)
formalism
PCFG-LA
comes
conceptual
inevitable
system
"conventional"_context-free_morphological_grammar
single-strategy_parsers
sense_resolution
Isomorphic Grammars
subtrees
characterized
Bikel's_parser
question-answer_pairs
top_human-ranked_sentence_plan
labeled
adaptation
machine
syntax,
lexicologists
participated
sentence_plan
probabilistic_spectral_mapping
translation_lexicons
KL-ONE
domain-specific_(in-domain)_word_alignment
exploit
i/l:::'=--~--
interpretation_and_generation_of_natural_language
(called
discovering_parallel_sentences
expected_(grammatical)_sentences
delimiters
HMM_and_Max-ent_models
demonstrative_expressions
standalone_system
syntactic_structure_information
linguistic_information
automatically,
predicative_information
also
linear_logic
description
Arabic
ICICLE_system
consistency_problem
problems
multiple
directionality
comparable
discourse_task
syntactic_cues
distance values
presuppositional_nature
block_selection_criteria
relative clauses
agglutinative_languages
LTAG
Chinese_word_segmenter
limited-domain_spoken-language_task
theories
large-scale_knowledge_base
~0.25%
explanation_system
ccg_supertagging
Penn_discourse_annotation
obtain
deterministic_grammar
speech_and_text_image_processing
asymmetric,_or_directional,_relations
allows
uniform_processing
Japanese_parsers
tracks
verb_form_meanings,
NP
pieces
other
POS tags in English,
questions
lexical_methods
boosting_approach
Combinatory_Categorial_Grammar_(CCG)_lexicon
words_with_multiple_meanings
simplify
syntax_directed_approach
English text
according
fast,
opposed
interactions
results
news_articles
exotic,
paraphrase_class
citing
retrieve
identification_of_non-local_depenencies
)
regular_languages
best
lexical_items
co-occurrence_distribution
placement
sentences
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
macro-average_F1
natural_sublanguages
Chinese_word_sense_disambiguation_model
statistics
advances
unsupervised_algorithm
character-_and_word-segmented_data
times
Chinese_text_input
intuitive
English_questions
CMU
entity-oriented_parser
important
techniques
approximation
implemented
deadline
four-participants_face-to-face_meetings
around
heuristic_rules
describe
scratch
feature_functions
representations
coarse-level_clustering
capitalization
mixture
exponential
published
includes
test_set
pipelined_NLG_architecture,
choose
levels
has
control_structure
base_parser,
tenses
statistical_method
treated
given
Information_extraction_techniques
English,_Arabic_and_Spanish_lexicons
labeled_directed_graph
Verbmobil_task
EBMT
6
known_deterministic_parser
defeat_rules
HPSG_natural_language_system
large_corpora
analysis
confidence
concept-concept_matrix
Sentence_boundary_detection
probabilistic_synchronous_dependency_insertion_grammar
paraphrase_examples
answer_expressions
translations
lend
topical report,
local_structure
strategies,
recognition_of_extra-grammatical_input
generate)
revision_component
annotation_scheme
Penn_Treebank_data
goal
word_vectors
error_correction_mechanisms
write
HDAG_Kernel
parse_trees
put
internal_and_contextual_information
lexical_database
training_data
like
usefully
meaning
data_representation_choice
packed
kernel_functions
complete
strength_of_potential_antecedence
agenda-based_scheduling_parser
collection_of_dialog_motivators
blog_posts
extended
WSD_programs
HK-closed,
unless
representation_tree
thesaurus
ported
Xerox_PARC
Topic_Detection_and_Tracking_tasks
average
performed
CFG_parsing
domain-specific_translation_lexicons
lexical_weighting
attractive
Machine_Translation
Bayesian_semi-supervised_Chinese_word_segmentation_model
after
automatic_extraction
alphabets
Information_Bottleneck
monolingual dependency parse
database_query_application
declarative_formalism
inheritance
formal_language
expected
syntactic_structure_features
included
predicate-argument_structures
closely
annotate
graph
analyses_for_large_treebank_grammars
probabilistic_Horn_clauses
fine-grained_grammatical_categories
induced_model
relative
most
question-answering_NL_systems
developed
text collections
speaker
tasks
preference
unsupervised_learning_algorithm
vectors_representing_morpho-syntactic_properties
pos_tag_ambiguity
Chinese_punctuation_marks
natural_language
performs
(from
automatic_language_identification
recently
sentence_co-occurrences
CoNLL_2008_shared_task
2004)
obtained
PK-open,
number
syntax_proper
software
Intra-sentential_quality
instance
exploits
97.24%
passives,
computational_model
Kong
EUROPARL_corpus
semantic_analyzer
antecedence_recovery
word_sense_disambiguation
speech
log-linear_block_bigram_model
temporal_expressions
MT_systems
complicated
implicit
translation_data
selecting
term_aggregation_system
Tree_Adjoining_Grammars
polysemous_word
phrase-based_models
AS-open,
agglutinative_language
acquiring_adjectival_subcategorization_frames
simple
dialog_model
tutorial_dialogue
class-oriented_framework
printed_text
non-English_(Arabic)_stemmer
identify
discourse_level
requiring
proposition
English,
create
probabilistic_context-free_grammar_(PCFG)
requires
segment
resolves
employing
finite-state_methods
basic
addition
intractability
derivations
or
natural_language_system
ccg_parsing
us
Japanese_patent_claim_sentences
word_graph
comparison
implementation
PAKTUS
text_generation
SMT_models
translation_knowledge
analytical_inverses
dictionaries
verbal_interactions
problem,
terms
embedded
bootstrapping_approach
linguistic_domain
field_structured_text
concrete_noun
run
prominence
EM-algorithm
parsing
chunking_performance
larger
multilingually_aligned_wordnets
for
semantics_directed_approach
lexical_unknown,
practical
highly
their
SL
utterance_classification
recordings
allowing
positive_feature_vectors
another
Korean-to-English_and_a_Japanese-to-English_dictionary
certain
demonstrative_forms_and_functions
web
increased
frames
(using
Named_Entity_(NE)_tagging
initially
Conrath
NP-complete
possible
natural_language_processing_systems
select
comma_checker
indicators
HPSG
linguistic_objects
Polish
newspaper texts
never
what
unigram
inherent
distributed_message-passing_infrastructure
SMT
semantically_rich,_large-scale_knowledge_bases
Nagao,1993;
different
lexicons
morphological_and_syntactic_information
approaches
summations
time_O(|G||w|3-e)
HBG
RCL_parser
argument_frames
combining
Minimum_Bayes-Risk_framework
process
several
Expectation-Maximization_(EM)_algorithm
range_concatenation_languages_[RCL]
written_texts
incorporating
model_of_grammatical_processing
recognizing
topical_blog_post_retrieval
root_word_lexicon
TIPSTER_applications
word_segmentation_problem
ranking_algorithm
word_segmentation
compounds
patchy
portability
describing
source_and_target_language_sentences
probabilistic_finite_automata
grammatical_frameworks
share
provided
structure_of_communicative_context
context-free_languages
tend
parse_record
live_closed_captions
utilized
would
corpus
vocabulary
IBM_models
unknown_word
thesaurus_construction
dependency_structures
method
natural_language_applications
finite-state_approximation
translates
bilingual_dictionary_coverage
weight
among
human_transcription
Augmented_Transition_Network
predictions
carried
semantic_representation
linguistic_theory
magnitude
vocabularies
declarative and imperative utterances,
(konpyuutaa)
n-best_speech/language_integration_architecture
domain_independent_model
size
define
variable
intense
basis
word-lemma_model
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
pronominal_anaphora_resolution_module
IR,
high-accuracy_word-level_alignment_models
associative_relationship
classification_method
better
not
success,
formal_definition
Wizard_of_Oz_technique
verbal_and_nonverbal_grounding_acts
text_browser
corpus_text
parser_for_non-configurational_languages
between
argumentation_system
pronoun_il
lower_bound_estimation
order
Human-Machine_Communication
tagging_strategies
Penn_Treebank_Corpus
crossed_serial_dependencies
consists
generic
relations
Languages
memory-based_system
despite
fewer
SRI_toolkit
Chine_language
lexico-syntactic_knowledge
dedicated
70%_precision
consider
sentence_extraction
relation extraction
statistical_methods
log-linear_(maximum-entropy)_models
viz.
numbers
constituent_structure_trees
20k
Q/A
highly_inflective_languages
rules
Presentor
display_of_graphical_information
labeled_data
feature-based_relation_extraction
language_pairs
superior
unlexicalized_PCFG_parser
syntactic_behavior
case-based_reasoning
presented,
general
recognition_technology
abstract_flat_syntactic_representations,_LFG_f-structures,
dependency_structure
effective
towards
taggers
because
per
training_techniques
extraction_tool
it,
being
types_of_knowledge
helping
entirely
Japanese_text
two-step_clustering_process
but
morphological_component
CRF
met
compositional_approaches,
databases
frequency_classes
latent_variable
SLS_systems
complex
Koskenniemi,
semantically_unmarked_term
recent
parallel_concordances
SVMs
layout
paraphrase_classification_accuracy
German_corpus
WordNet,
character_types
parallel_structures
example
1.6
language_acquisition
speech_recognition
essential
conjuncts
precision_rate
estimations
MT-based_paraphrasing_technique
unsegmented_corpus
sentence-level_semantic_equivalence_classification
unrestricted_texts
inescapable
indeed
easy
explicitly
discourse_copying_algorithm
means
newspaper_corpus
statistical_alignment_models
linguistic_structures
Similarity-driven_Transfer_System_(SimTran),
ambiguous wordform,
HMM-based_chunk_tagger,
MT_system
bearing
software_library
Spoken_Language_Systems_(SLS)
compositional_interpretation
discusses
verb_forms
speech_data
intelligibility
analyses
dynamic_programming
inferred
randomly
added
source of data
phone-string_classifier
algorithms
information_redundancy
TIPSTER_Architecture_specification
citations,
1983;
benefit
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
SUN4
original
aims
translation_accuracy
labelled_bracket_F-score
spoken_dialogue_system
knowledge-based_mechanisms
s-VSM_model
discourse_connectives
architecture
predicting_top-level_boundaries,
general_domains
place
board
Southern_Min_Chinese
severely
finding
ATIS_(Air_Travel_Information_System)_domain
exactly
expert_systems
decision_tree
noun
Acoustic_modeling
discontinuous_constituents
lexical_and_syntactical_variation
manner
A_deterministic_parser
outputs
verb_final_language
experimental
000
taxonomic_similarity
(and
consisting
generalizable_semantic_principles
every
any
role
statistical_and_constraint-based_disambiguation
interaction
editor
interactive_question-answering_(Q/A)_system
become
feature_weighting_and_selection_function
ASR
domain-specific_word_alignment
SI recognition,
algorithm_for_translation_lexicon_acquisition_(SABLE),
abductive_inference
over
superordinate_substitution
addressed
Term_similarities
coarse-grained_concepts,
corresponding
identification_of_paraphrases
LEXSYS
semantic network
discovered
word-trigram_recognition
evaluate
principle-based_theory
phrase
reduced
linguistic_expressiveness
unification
these
system's_output
scripts
data_retrieval
word_senses
drawn
enough
compete
MBR_decoders
transfer_component
advantage
recognizer
practice,
tagged
knowledge
character
non-literal_aspects_of_communication
richer
linguistic_concepts
arbitrary,
entropy
summing
pivot
discourse_constraint
LFG
automatic_estimation_method
information
hardness
compared
Information_Extraction
Japanese_Dictionary_Task_in_SENSEVAL2
precision
hubs
nodes
regular_expressions
data
robust_explanation_system
multidimensional_chart_parser
convey
speech_understanding
verb_semantics
~
transcription_errors
achieving
decision-tree_classifier
salience
CFG_rules
n-gram_statistics
converge
ungrammatical input
continuous_speech_recognition_(CSR)_techniques
training_(reference)_speaker
texts
permits
lexical_hierarchy
feature_structure_unification
WordNet
transformed
called
metaphors
essays
statistical_information
Turkish
new
CSR
multilingual_TIPSTER_user_interfaces
where
computational_theory
trainable_components
bilingual_parallel_corpus
Message_Understanding_Conferences
own
CSG
topic
Chinese_punctuation_marks,
Korean-English_translation
they
Memo-functions
models
Wall_Street_Journal_articles
with
adopt
language_processing_tasks
subcategorization_acquisition
proportion_problem
dialog_schemata
maximum_likelihood_method
lexically-induced_relations
AI_text_generation
conceptual_operations
words
communicative_signals
system_performance
interpretation
SVM
domain-independent
fake
meanings
decision_list
test_corpus
expanded
parse
log-linear_models
GLOSSER
involves
SSTC
real
MeSH
creation
bilingual_material
EM_algorithm
additional
structure
text-plan_input
credibility_indicators
principled
modification_probabilities
influence
core
abstract_moves
by
ungrammatical_structures,
following
TiMBL,
linear-chain_conditional_random_field_(CRF)
Definite_Clause_Grammar_techniques
semantically_annotated_corpus
English
independently
answer/question_terms
grammatical_formalisms
existing_grammar
Jiang
semantic_verb_classes
newspaper text,
structural_and_lexical_dependencies
'
DARPA_Resource_Management_corpus
2.284
documents_with_signal_content
determiners
resemble
dependency_tree
digital_learning
candidate_parses
stack
ASR_output
cepstrum-based_features
TAGs
coherent_text
ranking_problems
unadulterated
apply
binary_relational_calculus_notation
house,
rate
training_and_test_data
statistical_translation_model
sentence_retrieval_problem,
inflection
Korean-to-Japanese_dictionary
lemma-based_approach
Wall_Street_Journal_treebank
disambiguation_algorithms
will
wordbreaks
revealed
mapping_score
often
transliteration
declarative
must
decision_tree_architecture
textual_representation
derivation
inferential component
ambiguity
advantages
coherence_assessment
improving
Conceptual_Dependency_Theory
distributional_word_feature_vectors
gold-standard_parse_trees
OCR
definite_clause_grammars
vital
synonym relation
hierarchies
readily
general_and_domain_corpora
evaluation
departure
phrasal_patterns
inflow
training_speakers
intelligent_mobile_agents
move-tagged_abstracts
unification-based_grammar_formalism
introduced
clues
text-to-speech_form
incrementally
disambiguate
unit
coherent
gene_and_protein_interactions
construction-specific_approach
syntactic_ambiguity_resolution
best-reported
coherence
little
present
interfaces
children
subordinate_clause
represents
discourse_understanding_process
well_calibrated_probabilities,
language_tutoring_application
multilingual_speech_and_language_applications
constructing
domain_entities
ellipsis
and
ellipsis_resolution
this
challenges
achieved
weather
binary_relations
NL
word_alignment
automatic_discovery_of_text
sharing
is
discriminative_log-linear_models
-speaking
class
phrase_translations
permitted
prosodic
synchronous dependency parser
English-Japanese_machine_translation,
units
requirements
interface
Comparator
structured_data
traditional_MT_architectural_designs
text_processing_software
up
lexical_translations
multi-component_architecture
AI_problem_solving_techniques
analysed
German_pronouns
probability_estimation
human language learners,
efficiently
correctness
information workers
commonly
who
pronoun_resolution
nominal_constituents
reversible
produces
originally
typed_feature_structures
parsing_method
in-domain_word_alignment
good
text_classification_problems
Arabic-English
respectively
logical_well-formedness_conditions
usual
sentiment_vector_space_model_(s-VSM)
machine_learning_approach
moment
ambiguous_word
supervised_training_data
corpora
CriterionSM_Online_Essay_Evaluation_Service
sparsity_of_the_feature_space
multi-tagging_approach
LCS_representations
log(d)_overheads
alignment_errors
time
fundamentally
block_reordering
permit
ranking_rules
application
domains:
associative_relationships_between_verb_phrases
instead
Prague_Dependency_Treebank
quantified_sentences,
model
Boolean_matrix_multiplication_(BMM)
supports
takes
integral
treebank
manually_sense-tagged_data
Metagrammatical_formalisms
methods
appropriate
module
mismatch_resolution_scheme
generate
cooccurrence_patterns
context-free_phrase-structure_grammar
nouns
errors
reduce
fuzzy_quantifiers
two
approach
grammaticality
known
against
underspecified_semantic_representation_(USR)
measure
word_forms
argument_structures
enhances
Minimum_Bayes-Risk_(MBR)_decoding
domains
word-sense_ambiguity
hierarchically-structured_terminology
bibliographic
our
12.5%
Bulgarian,
collected
wide
