ranks
baseline_system
large_corpora
small-scale
formatted_weather_data
deterministic_grammar
finite
Turkish_word_structures
et
PCFG-LA
rhetorical_patterns
OT
segment_boundaries
significance
collection_of_relations_and_operations
87.5%
answer_expressions
show
SCFs
scientific
lend
such
translation
disambiguate
run
entity-based_representation
along
presented
estimate
Comparator
extensively
describes
appears
grammars
second_language_and_cognitive_skill_acquisition
calculus
understanding
reduplication
comparable
word-based_system
met
acquire
Penn_Treebank_Corpus
compositional_approaches,
circuit_specifications
superset_of_L
(in
morphological_constructions
not
mathematical_expressions
positive_feature_vectors
feature_structure_unification
maximum_entropy_word_alignment_algorithm
non-configurational_languages
grammar_checker
speech_and_text-image_recognition
experimental
threads
full_scale_two-level_morphological_description
transcription_errors
monolingual_parallel_corpora
HBG
Wall_Street_Journal_articles
known_deterministic_parser
regarded
automatic_discovery_of_text
speaker
phonological_system
naming_conventions
monolingual_and_bilingual_information
centering approach
randomly
paraphrases
SI_corpus
unification-based_parsing
sentence_analysis
part_of_speech_(pos)_tagging
conditional_loglinear_models
heuristic_rules
utterances
recognition_network
dependency_structure
lexicalized_structures
systemic_grammar
conjunction
itself
presence
four
morphological_analysis_problem
genetic_search
statistical_techniques
parser
them
each
domain-specific_(in-domain)_word_alignment
ranking_problems
temporal_adverbials
domain_entities
(Karttunen,
information_extraction_system
argument_frames
needed
scruffy_texts
modified
contains
event
relative clauses
hypotheses_graph
introduce
require
context-free_languages
significant
Proposition_Bank_data
subcategorization_acquisition
boosting_approach
f-structures
deadline
sublanguage,
argumentation_system
vector_space_model
Temporal_Expression_Anchoror_(TEA),
referring_expressions
usual
verb
sets
where
areas
essays
possible
typed_feature_structures
acquired
method_of_analyzing_metaphors
base_parser,
excluded
newspaper text,
Chinese_text
multimodal_parsing_and_understanding
of
constructions
Large-scale_natural_language_generation
decision_strategies
seem
unification-based_grammar_formalism
corpus_data
fuzzy_quantifiers
utterance_classification
Turkish_dependency_treebank
incorporates
robust_explanation_system
natural_language_interpretation
personal_computers
proper_names
PoS-tag_feature_function
create
corpus-based sample
electronic_discussions
set
Collins_(2000)_reranker
Verbmobil_task
translation_accuracy
distance values
lexical,_syntactic,_semantic,_and_structural_information
transformed
natural_language_environment
lexically-induced_relations
competitive
ad
gives
unsupervised_training
IntEx_system
input_dataset
post-processing
compositionality
effective
NP-complete
presuppositional_nature
defeat_rules
problems
parse trees
types
weather
depend
elaborated
which
associated
parsed_corpus
task_representation
helping
graphic_interpretation_system
embodied_conversational_agent
able
input
inflected_forms
sometimes
probabilistic context-free grammars
rule-invocation_strategies
DRT
spoken_language_corpus
pairs
NLP_tasks
grammatical_relations
subcategorization_cues
reduce
semantically_rich,_large-scale_knowledge_bases
event_structure
cepstrum-based_features
decision_trees
tutorial_dialogue
takes
MUC-6 and MUC-7 English NE tasks
Japanese_character_strings
direct
text-to-speech_form
pragmatics_processing,
convey
clusters
GPSG
linguistic rules
ECA
bare_slice_disambiguation
event_map
legal_terminology
priors
cooccurrence
document-oriented_applications
called
necessary
recently
paraphrase_classification_accuracy
as
language_modeling
deterministic_parsers
FDA
formalism
KL-ONE-like_knowledge_representation_systems
discriminative_log-linear_models
overcome
segment-based_approach
newspaper_corpus
they
lexical_methods
Semantic_theories
stages
either
also
unrestricted_texts
gene_and_protein_interactions
language_independent_modules
"black-box"_methodology
formal_analysis
electronic_newsgroup_discussions
80.5%
statistical_and_constraint-based_disambiguation
irrelevant
written
Czech
(konpyuutaa)
certification
context-free_phrase-structure_grammar
speech_recognition
log(d)_overheads
integrating
case-based_MT_(CBMT)
sentences,
arbitrary
's
lexical_affinity
state-of-the-art_coherence_model
analyze
MBR_decoding
Construct_Algebra
linguistic_structures
concrete_noun
verbs
dependency-based_grammar_model
annotate
grammar_sensu_stricto
translation_lexicon
Procedural_Systemic_Grammar
relation extraction
new_event_detection
illustrated
serves
revealed
English/Chinese_and_English/Japanese_language_pairs
unsegmented_Arabic_corpus
problem,
enriching
operates
correlate
cognito-pragmatic
made
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
intelligibility
tagging
consequences
exploratory_corpus_analysis
inference_types
segmentation bakeoff
model_parameters
linguistic_expressiveness
share
HMM_training
Machine_Translation_(MT)_systems
our
variable
)
continuous_speech_recognition_(CSR)_techniques
original
frames
biomedical_text
graceful
advances
Japanese-English_translation,
Topic_signatures
word-to-word_alignments
Information_Extraction
target_document
replete
generalized_metaphor_mappings
equivalence
construct
superordinate -hyponym relation,
unadulterated
subcategorization_classes
word_sense_definitions
survey
gained
English,_Arabic_and_Spanish_lexicons
utilizing
identification_of_paraphrases
Task-based_evaluation
fewer
TIPSTER_applications
dialogue_acquisition_and_tracking_algorithm
(Biber,1993;
SRHs
together
automaton
devised
feature_structures
handles
logic
MBR_decoders
bibliographic
derivations
lexical_conceptual_structure_(LCS)_representations
experimental_evaluation
ill-formed_input
parsing_algorithm
discourse_context
CSR
does
natural_language_applications
German
probabilistic_synchronous_dependency_insertion_grammar
phonetic_recognition
data_representations
Memo-functions
dynamic_programming
chunking_results
manually_segmented_corpus
word-sense_disambiguation_systems,
wildcards
human_cognition
character_types
training_data
handling
task-specific_domain_knowledge
Japanese_text_processing
apply
instead
bag-of-words_methods
characterized
analytical_inverses
indeed
Coedition
coherent_text
supervised_training_data
this
lexical category ambiguity
written_English
management_of_uncertainty
student
parsing_process
manner
English text
adopts
blocks
theory
7.5%
compact
1983)
arguments
n-best_speech/language_integration_architecture
automatic_abstracting_systems,
97.24%
candidates
satisfactorily
EBMT
dialog_systems
web
computational_theory
suffix_analysis
flexible_parsing
tracks
us
English-French_document_pairs
independently
lexical_and_syntactical_variation
domain-specific_word_alignment
(Bikel,
Chinese_text_corpora
Statistical_Machine_Translation_(SMT)
numerous
automatic_evaluations
inevitable
abstraction
portion
encodes
connectivity
discovering_parallel_sentences
pair
greatly
semantic_verb_classes
own
improvement
crossed_serial_dependencies
be
resolve
author
treebank
PK-open,
learners
nodes
goal
applications
class_of_languages
evaluation_method
general
developing
delimiters
linguistic_processing
undisambiguated
ranking_rules
Graph_unification
compression_ratio
enhances
different
resemble
requirements
new_sublanguage
machine translation (MT) systems
Node-based_inference
paper
vocabulary),
size
previously
denotational_semantics
maximization
top-down_derivation
unlexicalized_parser
generative_probabilistic_model
Japanese
available
Southern_Min_Chinese
coordinate_phrases
contextual_similarity
sentiment_vector_space_model_(s-VSM)
phrase_boundary_heuristics
allow
preceding_words
by
open-domain_question_answering
unknown_words
non-contiguous_phrases
Basque
dependency_tree
coordinations
MT_evaluation_techniques
MT-based_paraphrasing_technique
sentences
clustering_methods
SVMs
variety
frequency_counts
test_corpora
(P05-1076.10
software_library
unknown_word
English_sentence_structure
word_clustering
traditional_distributional_word-distance_measures
PER
discusses
phone_n-gram_model
[Zernik88],
statistical_approaches,
analytical_components
rely
construction
automatic_estimation_method
SMT_models
four-participants_face-to-face_meetings
benefit
then
evaluation_measure
correlation_measure
hardness
edges
syntactic_ambiguity_resolution
alignment_adaptation_approach
moment
partial_theories
has
vectors
efficiency
TAP-XL_Automated_Analyst's_Assistant
references
word_sense_disambiguation
natural_sublanguages
rank,
based
Arabic
F-measures
TL
dialog_motivators
shallow_mapping
JINTACCS_messages
finite-state_approximation
alphabets
free_word_order
like
disambiguation_algorithms
evaluated
exploits
Japanese_verb_phrases
temporal_anaphora_phenomena
viewpoint
manual_transcription
adjacent
reduplications
applying
agglutinative_languages
language_model
tree_adjoining_grammar
attributes
Named_Entity_task
resource-frugal_approach
but
place
relative_frequency_of_occurrence
large_Czech_MWE_database
sense
move-tagged_abstracts
discourse_connectives
semantic_caseframe_instantiation
deals
relied
success,
subcategorization_frames
fourteen
implicit
uses
20k
Automatic_Speech_Recognition_technology
search engine
GLOSSER
POS_learning
semantically_unmarked_term
synonymous expressions
graphical_model
human
shows
dependencies
polynomial_time
word_string
pipelined_NLG_architecture,
interfaces
user_knowledge_modeling_architecture
convolution_kernel
construction-specific_approach
ambiguity
human_understanding_of_natural_language
sentence_co-occurrences
capture
O(n6)_time
Arabic_information_retrieval
rank
models
abstract_moves
Chinese_language,
word-lemma_model
query_optimisation
hybrid_generator,
kernel_functions
domain-specific_semantic_information
ccg_parsing
in-domain_word_alignment
interrogatives
Comparator_software
approximation
Bulgarian,
limited
use
LFG_semantics
purposes
improving
answer
Arabic-English
natural_language_processing_(NLP)_systems
text-to-speech_conversion_system
interactions
text_processing
could
valid
find
lemma-based_model
oral_communication
been
spoken_dialogue_systems
compared
implemented
natural_language_interface
reduced
vast
advantages
nature
large
word-based_alignments
bit-vector_operations
state-of-the-art_performance
rate
detect
LT_(LF)
alternative
character
conversation_transcripts
AI_text_generation
parsing_method
multilingually_aligned_wordnets
i/l:::'=--~--
classifier
Natural_Language_Processing_(NLP)_applications
knowledge_engineering
incremental_description_refinement
theory_of_attention,_intention,_and_aggregation_of_utterances
incremental_probabilistic_parser
results
tagged
attractive
modeling
restrictive_statements
lack
answers
resolving
challenges
ATIS_(Air_Travel_Information_System)_domain
question-answering_NL_systems
performance
written_and_spoken_language
probability_estimation
mixture
best-path,_bottom-up,_deterministic_parser
adapted
extracted_fields
representations
meaning
characters-based_Chinese_collocation_system
syntactic_analyzer,
formal_intersections_of_FSAs
control_structure
co-occurrence_distribution
bootstrap
TiMBL,
rule-based_systems
English,
Noun Classifier Associations (NCA)
translations
wide
captured
human language learners,
RCL_parsers
produces
word_sense_disambiguation_(WSD)_systems
constructs
is
programming_language
TAGs
transformation_model
syntactic_categories
any
augmented_Friedman_-_Warren_algorithm
ambiguous wordform,
email_conversation
account
expert_systems
speech-based_Information_Retrieval_(IR)
respectively
role
transliteration_process
selected
lexical_similarity
ellipsis_resolution
listener
well_calibrated_probabilities
introduction
we
various
multisentential and multi-paragraph explanations
hubs
mapped
describe
knowledge_sources
source_and_target_language_sentences
computational_problems
information workers
Presentor
decision_tree
ambiguity_resolution
scenario_templates
incorporating
considered
running
little
will
dynamic_language_model_combination
user_modeling
interactive_question-answering_(Q/A)_system
field_structured_extraction_tasks,
only
level
interpretation
in
verb-noun_collocation_dictionary_for_Polish
training_and_test_data
aligned_bilingual_corpus
improved
language_tutoring_application
CoNLL_2008_shared_task
Word_Sketch_Engine,
CMU
fast,
genre
labeled
sides
discourse_constraint
instance,
topic_information
traditional_MT_architectural_designs
interpretation_and_generation_of_natural_language
training_techniques
topic
argument_structures
annotation
achieves
Korean-to-English_and_a_Japanese-to-English_dictionary
APT
natural_language_processing_systems
computational_semantic_analyses
Head_Grammars
interlingual_approach
procedures
histogram
outputs
non-English_(Arabic)_stemmer
ported
statistical_parameters
what
dependency_relation_paths
extracted
lexical_unknown,
CCR_formalism
language_identification
dictionary
providing
theories
computational_methods
unless
solution
produced
taxonomic_similarity
computational_model
dependency_parsing
linguistic_and_non-linguistic_knowledge
finite-state_models
good
generalized_metaphor
marked
predicting_top-level_boundaries,
human_data
direct_orthographical_mapping_(DOM)
decision_tree_learning
model_checking
syntactico-semantic_(tectogrammatical)_annotation
Source_and_Target_languages
interpolation_methods,
Chinese_punctuation_marks
problematic
access
operate
problem
user_model
Words
precision_rate
according
dialog_manager,
Penn_Treebank_data
pronoun_resolution
spectral_clustering_based_approach
senses
dialog_schemata
permitted
subordinate_clause
syntax-based_statistical_machine_translation_system
emoticons
trained
extracts
on-line_encyclopedias_and_dictionaries
Chinese_word_segmenter
hierarchy
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
~0.25%
context-free_grammars
language_processing_systems
critical
aims
time_exponential_on_the_size_of_the_grammar
segmentation_standards
word_sense_disambiguation_(WSD)
answering_agents
aware
Horn_clauses
classifier_assignment
non-terminal_symbol
combination_methods
derived_string
CFG_parsers
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
terms
components
coherence_assessment
logical_form_language
machine_translation_(MT)_evaluation
ARPA_large-vocabulary_CSR_corpora
out-of-domain_corpus
97%
practice,
in-domain_corpus
Prague_Dependency_Treebank
names
French
despite
difficult
KL-Conc,
explicitly
resolves
SL
tailoring
single
space
language
conditional_log-linear_model,
lexicalized_grammar
planning-based_architecture
parsing_technique
WH-questions
unsupervised_automatic_acquisition
paraphrase_class
underspecified_semantic_representation_(USR)
SLS_systems
user
formalization
meaning-entailing_substitutability
feature-based relation extraction
strengths
computed
Korean-to-Japanese_dictionary
tie
lexical_hierarchy
CFG_rules
synonym relation
target speaker
broad_coverage_lexicon
likelihood
single-strategy_parsers
optimum_iteration_number
probabilistic_spectral_mapping
LR-parser
context-free_phrase_structure_rules
transfer_phase
fake
million
recognition_of_extra-grammatical_input
shared_derivation_forest
generation
28,449
depending
Xerox_PARC
fuzzy_syllogism
shallow_techniques
reference
IBM_models
modular_architecture
clauses
content-independent_formalism
words
log-linear_models
shift-reduce_dependency_parsers
departure
block_selection_criteria
expectations,
dramatically
1983;
bilingual_corpora
statistical_profile
semantic_role_labeling,
translates
occurring
compositional_interpretation
comparative
flexibilities
better
DoPS_system
NL
multi-component_architecture
general_and_domain_corpora
analysis_mechanism
song_lyrics
Conrath
real-valued_features
small
estimations
pronominalization,
performed
vectors_representing_morpho-syntactic_properties
prosodic
passed
using
formulas
NP
integral
tune
data_representation
tractable
textual_corpus
forward_pass,
discourse-level construct
semantic_representation
semantics
syntactic_descriptions
explicit
prior_knowledge
speed
similar
NLP_system
priming
types_of_knowledge
event_terms
160
inherent
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
underpinning,
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
restricted_subset
procedural
CFG_parsing
referential_properties_of_noun_phrases
Generalized_Alignment
gave
psycholinguistic_literature
co-occurrence_similarities
dynamic_combiner
analogies
formal_definition
demonstrative_forms_and_functions
non-terminals
train
well_calibrated_probabilities,
latent_variable
ensemble_learning_approach
dictionaries
relatively
parsing_strategies
utilized
weighted_finite-state_device
translation_paths
other
from
regular_languages
containing
verbal_interactions
MeSH_relations
described,
Lexical-Functional_Grammars_(LFG)
dedicated
preceeding
linguistic information,
keywords
human_plausible_reasoning
placement
SMT_research_community
conjuncts
deep_processing
sense_priors
relational_database
intentions
DARPA_Spoken_Language_Systems_(SLS)_program
large-vocabulary_speech_recognition
sentence_plans
employing
categorization_task,
macro-average_F1_performance
write
shown
wordbreaks
discourse_segmentation
formulated
or
Graphical_User_Interface_(GUI)_functions
generative_model,
parse_forest_representation
building
its
induced
abstract
adding
efficient,
searched
large-scale_knowledge_base
source_language_text
generated
affix_removal
discovered
first
the
working
time_O(|G||w|3-e)
Nagao,1993;
formal
formalising
parse-trees
speech_processing
Log-linear_models
predictive_questioning
stemming_model
statistical_translation_model
machine_transliteration/backtransliteration
another
analysis
thesaurus_construction
modification_probabilities
complex_sentences
members
semantic_interpretation
system_response
normal
Gaussian_mixture
Chinese_punctuation_marks,
HK-closed,
starting
etc.,
unsupervised_learning
averaging
adopt
subset
part_of_speech_information
abstract_flat_syntactic_representations,_LFG_f-structures,
Korean-English_translation
referential_elements
abstractions
arbitrary,
multilingual,_multimedia_data
retrieve
KDS
performs
predictions
information_extraction_tasks
learn
limitations
inferential component
AS-closed,
word_order
reduced_IL_formulae
word_error_rate
architecture
translation_lexicons
influence
machine-readable_dictionaries_(MRD's)
similarity
discourse_relations
automatic_language_identification
hypothesis
unsegmented_corpus
motivated
whose
take
graphics_displays
automatically
real-world entities
MT_evaluation
language_learning_model
found
documents_with_signal_content
real
BLEU
NP-_and_non-NP-antecedents
never
computer_text_generation_system
dictionary_word_sense_definitions
represents
generators
mobile_military_command_and_control
firmly
consists
knowledge
structure-sharing_of_graphs
impacts
RCL_parser
than
model
Chat-80
LCS_representations
derived_strings
SI recognition,
alignment
methodology
basic
STRAND
appropriate
grammar_formalisms
function_words
Markov_model
domain_knowledge
SUN4
relying
syntactic_structure_information
translation_quality
entailment_acquisition
distinguish
attribute_sequences
model_theoretic_interpretation
translation_images
Recognition_of_proper_nouns
new_domain
word-aligned_corpora
exactly
data
semantic_information
context-sensitive,_phrase_structure_grammar
theoretical_linguistic_investigations
nouns
Jiang
JAVELIN_system
probabilistic_context-free_grammars
meet
research
PK-closed,
conceptually
existing
practical
needs
unification-based_linguistic_descriptions
HDAG_Kernel
sparsity_of_the_feature_space
Dutch
retrieval
Penn_discourse_annotation
Web
clustering_and_filtering_processes
IBM_translation_models
Expectation-Maximization_(EM)_algorithm
language processing pipeline
machine_learning_approach
email_communication
morphology
domain_specific_terms
textual_representation
powerful
automatic_evaluation_measures
news_articles
regular_expressions
morphological_component
subpredicates
Polish
individual
term_extraction
single-snippet_answers
OCR
antonymous_adjectives
agglutinative_language
benchmark_system
Languages
confidence
two-step_clustering_process
category
Slavic language
properties
n-gram_transliteration_model_(n-gram_TM),
Korean
English-Japanese_machine_translation,
paraphrasing
how
IE_module
classifier_word
8000-word
descriptions
significantly
error
trend
GUIs
addressee_identification
combines
events
n-gram_statistics
via
obtained
Named_Entity_(NE)_tagging
(and
usually
number
target_vocabulary
blog_posts
discourse segment,
logic,
input_word
citations,
proposition
data_retrieval
commonsense_reasoning
epistemological_level
high
knowledge-based_and_random_selection_procedures
provides
verbal_and_nonverbal_grounding_acts
conditioning variables
HMM-based_chunk_tagger,
pharmaceutical news archive
incorporate
precision
hierarchically-structured_terminology
Japanese_unknown_words
grammaticality
NLP
SCFs_distributions
distributional_approximation
predominant_senses
initially
linguistic_theory
concept
several
formalisms
numbers
system
young
dimensionalized_space
saturation
IR,
relevant
tasks
easy
class-oriented_framework
probabilistic_finite_automaton
Korean_and_English_language_pairs
story
alignment_errors
strategies,
CAS
semantic_composition
common
recognizer
training_(reference)_speaker
development
compounds
improve
TRDR_score
question_phrases
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
feedback
structured_databases
frequency_classes
thus
indicators
morpho-syntactic_and_semantic_characteristics
errors
Boolean_conditions
Combination_methods
skips
yields
speech
readily
most
existing_grammar
question/answer_pairs
morphological_and_syntactic_information
dependency_relations
WSD_models
chunks_of_words
English-Japanese,
word_alignment
referents
disjunctions
consisting
viz.
retrieval_approach
address
accuracy_rate
log-linear and linear interpolation,
integrate
indices
system_performance
summary_generation
fundamentally
achieving
spoken_dialogue_system
Czech_WordNet
through
(German-English,
WSD_task
attentional_state
compositional_syntax_rules
spoken_language
metric
directly
demonstrated
limited-domain_spoken-language_task
XTAG
up
2491
much
efficient
utterance
captures
constituent_structure_trees
declarative
completeness
right-side dependencies
surface_English
compete
discursive_usage
decision_list
explanation_generation
binary_relational_calculus_notation
bottom-up_pattern-matching_parser
hand-crafted_template-based_or_rule-based_approaches
flexible,
antecedence_recovery
simple_clausal_structures
because
built
it,
MeSH
kinds
Japanese_text
easy-to-implement
segments
automated_interpretation
draws
referential_information
hidden-variable assignments:
range_concatenation_languages_[RCL]
target_corpus
accuracy
automatically_acquired_parallel_corpus
multi-strategy_framework
embodied
database
cooperative_responses
asymmetric,_or_directional,_relations
thesaurus
adequate
multi-pathway_MT_architecture_design
designed
identify
scf types
same
weights
HMM_with_Gaussian_mixture_observation_densities
constraining
POS tags in English,
grammatical_number
text_processors
variant
tree
reference_sets
human_judgment
reflect
German_corpus
Discourse_Representation_Theory
straightforward
surface_realizations
Kullback-Leibler_distance,
email-threads
natural_language
global_meaning
demonstrative_expressions
hoc
user_interface_styles_or_conventions
constructing
morphological_analyzer
enumeration
carry
projecting
expected_(grammatical)_sentences
credibility_indicators
multi-strategy_approach
test_set
Chinese_word_sense_disambiguation_model
automatic
cognitive_psychology
Information_Bottleneck
exhibit
presented,
Unification_Categorial_Grammar_(UCG)
linear_logic
constituent_parts
--
named_entity_(NE)_recognition_(NER)_system
research_articles
instance
paraphrase
"one-time_look_up"_method
framework
subcategorization_dictionary
all
spoken_language_understanding_system
citing
unification-based_grammar_parsing
statistics
capitalization
widely
ability
mainly
derived
spontaneous_speech
macro-average_F1
representation_scheme
anaphora
human_transcriptions
contributes
manually_sense-tagged_data
offers
MT
result
information_redundancy
machine_translation_outputs
printed_text
duration_model
French_tenses
Japanese_natural_language_processing_studies
declarative_formalism
known
given
natural_languages
determination
analyst
choose
12.5%
heuristic_learning
trajectory
Plume
discourse_level
abductive_inference
computational_complexity
combining
approach
interpret
statistical_alignment_techniques
Child_Language_Data_Exchange_System_(CHILDES)
translation_relation,
linguistic_objects
attentional_focus
unified
statistical_machine_translation_(MT)
about
computational_linguistics
semantics_directed_approach
that
under
coherence
associative_similarity
IR
unsupervised_algorithm
semantic constraints
training_method
keep
distinct
more
every
newswire_texts
Chine_language
consider
ranking_algorithm
PCFG-LA model
BMM_algorithm
generate
unsupervised_learning_algorithm
substitutions
unification-based_grammatical_frameworks
Minimum_Bayes-Risk_(MBR)_decoding
combine
writing
combined
F-measure
unequal
unigram
tree-to-tree_translation
constitute
improvements
feature_vectors
weight
pronoun_il
bilingual_dependency_relations
reversible
feature_structure-directed_generation,
natural_language_system
communicative_signals
spatial_attributes
functional_structure
assignments
log-linear_combination
'
IE_paradigm
overall
tend
1
induced_model
included
statistical_machine_translation
LTAG
prominence
sentence-level_and_text-level_anaphora
medium-length
text-level_anaphora
dynamic_programming_(DP)
originally
sense_resolution
anaphora_references
guide
P-CFG
lexico-syntactic_knowledge
TIPSTER_Architecture_specification
two
stored
Praguian_dependency-based_approach
MSR- closed
selecting
79.1%
did
varied
words,
ICICLE_system
predictably
monolingual dependency parse
co-occurrence_patterns
text-plan_input
empirical
phrase-based_statistical_machine_translation_method,
children
learning_algorithm
relative
distributional_hypothesis
tag
machine
semantic_role_labeling
SRI_toolkit
simplify
abduction
language_functionalities
surface_forms
task-specific_language_development
features
operational_semantics
extraction_system
exploit
automatically,
word_segmentation_problem
similar_context_features
Wizard_of_Oz_technique
quantifying_noun_groups
translation_candidates
unsupervised_learning_approach
WWER
Japanese_patent_claim_sentences
distance
into
modular
definition_sentences
fine-grained_grammatical_categories
outperform
are
naturally
inference
upon
entirely
paraphrasing_method
compare
EM_algorithm
parallel_structures
dictionaries_of_word_forms
2.284
carried
VME_bus
amount
Augmented_Transition_Network
Spoken_Language_Systems_(SLS)
words_with_multiple_meanings
spatial_descriptions
namely
minor
additional
reasoning_with_dispositions
Machine_transliteration/back-transliteration
when
statistical_models
test_corpus
ordinary
reasonably
inflection
hierarchical_(or_other_types_of)_relations
(using
grs
query_terms
node_structures
Czech-English_statistical_machine_translation_system
Tree_Adjoining_Grammars
mapping_score
structured
part-of-speech_annotation
collecting
agreement
creation
strong
while
concept-distance_measures
packed
represented
integration
machine_translation_pipeline
knowledge-based_mechanisms
interface
cross-lingual_comparisons
SMT
phrases
computationally
further
linguistic_annotation
statistical_machine_translation_(SMT)
temporary_belief
MSR-open
free_indexation
visualization_method,
auxiliary
dialogue_systems
pivot
left_corner_parsing_algorithm
addressed
supported
Definite_Clause_Grammar_techniques
phrasal_patterns
articles
aids
~
relevance
valuable
MT_system
inflow
patterns
evaluation_metrics
inheritance
translation_hypotheses
genre-specific_regularities
root_word_lexicon
check
training
grammatical_formalisms
Chinese_text_input
select
CTL
suitable
case-based_reasoning
candidate_parses
terminology_structuring
internal_and_contextual_information
answer_candidates
linguistic_domain
126,610
AI_problem_solving_techniques
on
language-independent_system
text_classification_problems
traditional_deterministic_parsers
coherent
lattice-based_approach
recognition
translation_framework
discourse
translation_data
culling
Machine_Translation
unambiguous_structures
enhance
linguistic_representation
introduced
summing
speech_processing,
achieved
(e.g.
expletive_occurrences
suffix_array-based_data_structure
generalized_translation_knowledge
linguistic_concepts
effectiveness
newspaper texts
domains
70%_precision
particularly
multiple_and_nested_interactions
between
proposed
pronoun_"it"
proportion_problem
phrase_structure_grammar
KPSG
system_output
field_structured_text
summary
occur
efficiently
a
ellipsis
relationship
advantage
comparison
laws
laboratory_study
automatic_segmentation
transliteration/backtransliteration_experiments
recall,
statistical_methods
CFG filter
enough
entropy
parser_MDCC
word
user-specified
traditional_knowledge-based_techniques
part
structured_data
specifications
source_language
per
tree-bank
word_error_rate_(WER)
there
effectively
exponential
idiosyncracies
board
advertisements
modules
MWEs_database
statistical_analysis
unit
feature_functions
token_classification_task,
definitions
proof procedure
verb_final_language
structural_information
multi-strategy_and_multi-source_approach_to_question_answering
volume
polarity-tagged_corpus
personal_names,
phrase translations
model_design
mappings
training_material
linguistic_resources
text collections
MORphological_PArser_MORPA
display_of_graphical_information
data_objects
natural_language_generation
segmented_strings
allowing
bit-vector-based_CKY-style_parser
domain-independent
linguistic_PoS_tagger_and_chunker
bilingual_dictionary_coverage
automatic_Q/A
unsupervised_learning_method
constructed
English
computational_lexicon
independent_classifiers
word_significance
world
machine_translation_output
Bikel's_parser
dictionary-based_word_vectors
topical report,
retrieval_performance
speech_data
developed
generates
Chinese_words
data_representation_choice
applied
become
who
participated
discourse_structure
(from
German_text_corpora
topic_signature
embedded
smoothing
resulting
constraint
text,
discourse-relevant_purposes
training_examples
often
evidence
strongly
tagging_strategies
M
knowledge-based_generation_systems
fits
certainty_conditions
marks
mutual_information
ungrammatical input
feature_weighting_and_selection_function
Japanese_parsers
performance_improvement
translation_performance
Node-based_inference_rules
recognition_technology
missing_words
spelling-checkers
predicate_calculus_notation
yield
spoken_multiparty_dialogue
interactive_problem_solving
opposed
involve
source_dependency_parse
annotating_scheme
spoken_language_technology
meanings
queries
exotic,
still
finite-state_methods
grammatical_sentences
transcribing
natural_language_processing,
answer/question_terms
weaknesses,
AS-open,
primitive_Optimality_Theory_(OTP),
useful
local_structure
speech_synthesis_systems
ambiguities
raw_text
automatic_alignments
concept-concept_matrix
connectionist_component
stems
substantial
independently trained models
word_segmentation
dialogue_translation_system
claimed
syntactic_behavior
localized_phrase-based_prediction_model
industry_watch
ambiguous_word
behavioral_patterns
assigning
focus
published
text_processing_software
currently
maintains
typicality
phrase
accuracies
bilingual_parallel_corpus
equivalences,
statistical_alignment_models
interlingua
KL-ONE_style_representation
objects
Message_Understanding_Conferences
Sentence_boundary_detection
EDOL
forecasts
DARPA_Resource_Management_corpus
studied
HTML_documents
restricted_natural_language
robust---an
polynomial_time_solution
labels
word-trigram_recognition
includes
purpose
experiments:
speech_and_text_image_processing
contain
WSD_programs
lexicon
probabilistic_Horn_clauses
crossing_liaisons
make
Bayesian_semi-supervised_Chinese_word_segmentation_model
well
transliteration
possible,
natural_language_interfaces
simple
derived_words
dialogue_corpora
core
permit
syntactic_structure_features
database_query_application
plays
scope_ambiguity
unification-based_grammar
qualitative_spatial_constraints
subtrees
kind
associative_relationships_between_verb_phrases
natural_language_processing
commonly
were
answer_extraction
block_reordering
discourses
maximum-entropy_model
SVM_learning
intelligent_mobile_agents
word-senses
hierarchical_relations
idiosyncrasies
final
incorporated
linear-chain_conditional_random_field_(CRF)
defeasible_reasoning
virtual_reality_3D_scene_modeling_software
configurable
categories
deviates
6
pronoun
unsupervised learning
lexical_coverage
rather
official_rankings
biological_entities
determined
vocabularies
classifiers
multi-tagging_approach
lexical_approaches
logical_formulas
parallel_corpora
domain-specific_translation_lexicons
statistical_information
type
labelled_bracket_F-score
application
Boolean_matrix_multiplication_(BMM)
NL_evaluations
Human-Machine_Communication
rule-based_learning_algorithm,
35.0%
worse
protocol_analysis
texts
tools
polysemy
statistical_MT_performance
should
binary_relations
to
RAREAS
groupings
alternative_markers
question-answer_pairs
elementary_structures
identification_of_non-local_depenencies
thematic_grid_tagging,
verb_form_meanings,
phone-string_classifier
context
questions
source of data
defined
parse
begin
entirely_data-driven_model_selection_procedure
Turkish
(called
involves
acquiring_adjectival_subcategorization_frames
hierarchical_lexicon
beyond
5%
character_bigrams
determiners
times
lexical_and_syntactic_features
Spelling-checkers
vocabulary
for
full_parsing
provide
Bayesian_learning
algorithm
permits
chunking_performance
machine_translation
general-purpose_NLP_components
resource
small,_domain-specific_corpus
synthesizes
analyses
capability
intractability
speaker_adaptation_(SA)
sharing
gaps
WordNet-based_measures,
speaker-independent_(SI)_training
trainable_components
structure_of_communicative_context
differ
bearing
syntax-based_constraint
house,
discourse_processing
indirectly
Cooperative_Model
predicting
entailment_relations
textual_credibility_indicators
supervised_and_unsupervised_methods
semantic_constraints
offer
machine_translation_system
hard decisions
parse_forest
lexical_items
translation lexicons
comes
syntax_proper
augment
facilitate
source_interval_projections
honorifics
well-written_discourse
phrase_translations
focus_of_attention
helpful
languages
segment_order-sensitive_methods
observed
extraction_tool
strictly_syntactic_cross-serial_agreement
segmentation
syntax
conceptual_system
text_browser
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
semantic_equivalence
character-_and_word-segmented_data
[ANA]
leading
word-based_collocational_properties
metaphors
error_correction
CCLINC_Korean-to-English_translation_system
hidden Markov models (HMM),
Topic_Detection_and_Tracking_tasks
graph_transformations
technique
syntactic_analysis
identifying
MWEs
Italian and English verb subcategorization frames (SCFs)
discourse_copying_algorithm
parse_reduction
verb_forms
structured_natural_language_data
corpus-based_approach
punctuation
decision-tree_approach
remains
bilingual_dictionaries
order
Dialogue_strategies
makes
equivalent
ambiguous
adaptation
explanation_system
computational
so
parts of speech
stack
logical_model
annotation_scheme
translation_memory_system
neat_texts
English-Chinese_parallel_corpora
large-vocabulary_CSR,
utilizes
highly_inflective_languages
cooccurrence_patterns
around
supports
al.
conceptual
shared_lexical_information
comprehensive
Japanese_sentence_structure
can
MT_systems
text_understanding
word_tokens
cross-entropy
language_modeling_tasks
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
evaluate
PropBank
constraint_system
cognitively_well-motivated_interfaces
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
language_(L0)
best-reported
natural_language_text
100,000
77%
Japanese_script
algorithms
conventional_statistical_methods
multilingual_TIPSTER_user_interfaces
within
Chinese_newspapers
manually_segmented_Arabic_corpus
need
statistical_method
zero pronouns
Information_extraction_techniques
towards
feature-based_word_grammar
define
automatic_metrics
representation
biases
frequency_profiles
QA_system
fuzzy_quantifier
Korean_phonological_knowledge_base_system
patchy
decision-making
preference
text_corpus
syntactically_motivated_relations
semantic_analyzer
word-sense_ambiguity
whether
parsing
seed_sentences
path_values
polysemous_word
CriterionSM_Online_Essay_Evaluation_Service
Systemic_grammar
parsing-based_NE_rules
agenda-based_scheduling_parser
labeled_directed_graph
directionality
improves
Prolog
logical_well-formedness_conditions
pronouns
Smadja,1993)
special
standalone_system
23,000
000
few
word_n-grams
distributions
test
lexicons
gold-standard_parse_trees
range_concatenation_grammar_[RCG]_formalism
pushdown_automaton
primarily
format
even
element
ways
textual_domain,
general_domains
habituality
filter
Hidden_Markov_Model
expectation-maximization_(EM)_based_word-clustering_algorithm,
implicitly
dialogue_system
stochastic_output_selection
military_and_civilian_systems
human_transcription
viewed
parallel_concordances
Kong
WordNet
defeasibility
deductive_approach
over
potential
both
sentence
created
generator
dialogue_interaction
inescapable
probabilistic_model
parallel_data
non-literal_aspects_of_communication
A_deterministic_parser
showing
voice_interactive_system
probabilistic_translation_models
lexical_weighting
rule-based_translation_systems
string_similarity
latent_variable_model
Combinatory_Categorial_Grammar_(CCG)_lexicon
put
ranking
encyclopedia,
definite_clause_grammars
parse_record
traditional
memory-based_system
Penn_WSJ
focussed
high-accuracy_word-level_alignment_models
genres
measure
Intel_i860_chip
Mimo,
compactly
linguistic_information
method
cooccurrence_statistics
(
integrates
evaluation
derivation
complete
HK-open,
parse_trees
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
analysed
techniques
corpus-based_method
particular
probability-based_scoring_function
n-ary_relations
syntactic_analysis_system
intuitive
2004)
grammar_coverage_problems
temporal_expressions
answer_resolution_algorithm
less
spoken_language_understanding
core_modules
ungrammatical_input
word_forms
description
generative_model
text_mining_method
two-phase_shift-reduce_dependency_parser
contexts
word-sense_disambiguation_algorithm
sentential_paraphrases
Koskenniemi,
error-correction_rules
specific_heuristics
pruning_criteria
Similarity-driven_Transfer_System_(SimTran),
feature-based_relation_extraction
Japanese_language_dictionary
Plume's_approach_to_parsing
example
during
interconnected
labeled_data
linguistic_introspection
quality
derivational_history
conversation_analysis
acquisition_of_word-semantic_information
common_text_processing_modules
–
syntax,
text
human-machine_interactions
voice_input
grammatically_correct_input
unique
apartment
linguistic_parser/generator
deduced
machine-readable_resources
inferred
PAKTUS
series
CRF
transfer_component
program
linguistically
many
higher
unlexicalized_PCFG_parser
unification
anaphoric_component
cooperative
extraction
Acoustic_modeling
critical_discussion
Japanese_Dictionary_Task_in_SENSEVAL2
highly
rankings
Syllogistic_reasoning_with_dispositions
some
Paramax_spoken_language_understanding_system
marine
domain_independent_features
user-directed_summaries
correctness
entity-oriented_parser
syntactic_coverage
module
Translations
-
sounding
<
relations
"glue_language"
written_texts
feature_selection_methods
dialog_management_system
these
sentence_plan
practically_unsupervised_learning_method
spelling_correction
would
Conceptual_Dependency_Theory
disjunctive_feature_structures
verb_semantics
WordNet,
semi-supervised_methods
semantic network
disambiguation_tool
time
hardware_designs
Nigam
determining
model_of_grammatical_processing
biomedical_and_linguistic_ontologies
component
segment
mismatch_resolution_scheme
blackboard-like_architecture
done
principled
information
morpheme_sequence
express
probabilistic_context-free_grammar_(PCFG)
good,
average
audio_and_scanned_image_data
software
HDAGs
hard_problems
domain_dependence
semantic_annotation
"conventional"_context-free_morphological_grammar
reestimation_formulas
term_aggregation_system
ILIMP
word-lemma_based_feature_function_models
Japanese_sentence_analyses
salience
statistical_parser
transfer_approach
lexicalised
resolution_component
MT,
predicate-argument_structures
retrieval_effectiveness
extract
pronominal_anaphora_resolution_module
summarization
present
collection_of_dialog_motivators
task
beam-search_decoder
body
hidden_variables
Polymorphemic_stems
amounts
indexing
multidimensional_chart_parser
nominal_compounds
pattern
arbitrarily
processes
relative_error_rate_reduction
grammatical_frameworks
approximation_error
lexical_translations
sequential_models
conceptual_level
best
loss_functions
comma_checker
node-based_inference
approaches
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
Path-based_inference_rules
standard
SSTC
generate)
TAG
German_pronouns
required
Isomorphic Grammars
declarative_languages
JAVELIN
existence
LM
performing
log-linear_(maximum-entropy)_models
layout
previous
parallel_corpus
syntax_directed_approach
part-of-speech_tagging,
one
syntactic_priming
discriminative_training_criterion
Dictionary_construction,
scfs
temporal_logic_CTL
analyses_for_large_treebank_grammars
classified
principle-based_theory
quantification_over_events
transition_graphs
much-studied
fundamental
evaluation_of_Natural_Language_systems
candidate
155
making
examples
error_correction_mechanisms
ungrammatical_structures,
Arabic_word_segmentation_system
full_NPs
may
smaller
reference_model
augmented
requiring
predicative_information
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
at
word's
spoken_dialogue
symbolic knowledge
means
extended
complex
American Sign Language (ASL) animation
word_senses
synchronous dependency parser
grammar
discontinuous_constituents
superior
live_closed_captions
units
process
large-scale
among
word_vectors
achieve
word-based_models
parsing_data
must
robust
character_and_word_error_rate
HBG_model
probabilities
s-VSM_model
recordings
language_pairs
lexical_database
summations
levels
error_rate
RINA,
HMM_and_Max-ent_models
related
machine_translation_task
reliable
direction-giving_task
classification-based_representation_techniques
temporal_relations
word_graph
interaction
outperforms
syntactic_and_semantic_dependencies
training_resources
TV_shows
sense-tagged_training_data
following
0(n)_time
training_corpus
multiple_parsing_strategies,
nominal_constituents
89.75%
semantically_related_words
lower
free-content
processing
useful_terms
syntactic_disambiguation
extended_domain_of_locality_(EDOL)
subset_of_logic
MT_output
pooling
high-quality_data
target
fully-connected_first-order_statistical_class_grammar
formulate
Minimum_Bayes-Risk_framework
recognizing
semantic_expressibility
stereotyped_text_structure
support_vector_machine
restricted_vocabulary
natural_language_generation_community
after
stochastic,_graph-based_method
text_model
linguistic_structure
generation_system
correspond
requires
coarse-level_clustering
ASR
build
Metagrammatical_formalisms
pieces
superordinate_substitution
onto
produce
decoding_strategy
search
vital
Wall_Street_Journal_treebank
incrementally
deterministic_finite_automaton
general_linguistic_knowledge
ccg_supertagging
text_generation
unseen_data
test_language
tagger
tests
KL-ONE
essential
represent
consist
unannotated_text
temporal_connective
explore
token-based_models
functions
semantically_annotated_corpus
terms,
meta-inference_types
lexicologists
noun
automated_evaluation_techniques,
databases
discourse_understanding_process
attentional_structure_in_discourse
word_examples
statistical_model
evaluating
converge
help
different-quality_references
extensive
customized
program,
and
entities
connectionist_(neural)_network
an
word-dependent_substitution_costs
semantic-oriented_NLP_applications
underspecified representations
portability
robustness
Dutch_Senseval-2_test_data
structure
exceeds
ranking_learning_problem
baseline
HPSG
being
oriented
rules
fragments
word_clusters
topical_blog_post_retrieval
operational_foreign_language_tutoring
used
training_and_testing_factors
suggests
noun_phrase_chunks
semantic_relations
Longman_Dictionary_of_Contemporary_English
expressed
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
strength_of_potential_antecedence
distributional_word_feature_vectors
generation_problem
natural language interfaces
semantic
structural_and_lexical_dependencies
task-oriented_dialogs
log-linear_block_bigram_model
magnitude
decision-tree_classifier
uniform_processing
flexible_parser
sequences
domain-independent_capabilities
generalizable_semantic_principles
finding
Hong
Natural_Language_Processing_(NLP)_system
overt_case_markers
limits
grammatical_gender
classification_method
supervised_learning
scoring
information_source
IE-enhanced_text_browsers
text_applications
word_significance_(weights)
generative_history-based_latent_variable_model
corresponding
seeds
quantified_sentences,
-speaking
Arabic_word_segmenter
cue_phrases
unsupervised_methods
category_labels
extracting_subcategorization_frames
ASR_output
distributional_concept-distance_measures
specialized_parsing_techniques
spoken_corpora
lemma-based_approach
threading_algorithm
CFG_parser
roots_words
taggers
robustness_problems
repository
tenses
methods
statistical_learning_mechanisms
collected
dialogue
concepts
semantic_distance
increased
graph
expression
LEXSYS
expectations
semantic_criterion
specified
Situation_Theory
CF_grammars
allows
confidence_measures
cohesive text
decoding
added
cannot
40
important
largely
decision_tree_architecture
algorithm_for_translation_lexicon_acquisition_(SABLE),
information_flow
Path-based_inference
context_free_languages
syntactic_cues
filled
out
their
multiple_complementation_patterns
bigram_back-off_language_models
1.6
adaptive_learning_procedure
backwards_transliterations
predictive_performance
describing
richer
parser_for_non-configurational_languages
collocations
deal
sentence_extraction
associative_relationship
larger
implements
question-focused_sentence_retrieval
exact_match_accuracy
parsed
Name List,
content_words
edit_distance
maximum_likelihood_method
method_to_automatically_acquire_paraphrases
lower_bound_estimation
basis
Grosz-Sidner-style_focus_model
speech_understanding
control
digital_learning
usefully
word_pairs
distributed_message-passing_infrastructure
passives,
polarization
translation_knowledge
addition
multilingual_input
multilingual_speech_and_language_applications
automatic_evaluation
closely
editor
documents
triple
output
handle
SVM
HPSG_natural_language_system
system's_output
VSM_model
training_speakers
probabilistic_context-free_grammar
respect
113K
lexical_substitutions
attain
expensive
Q/A
unpleasant
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
work
heuristic_principles
judicious
intense
though
declarative and imperative utterances,
generic
English_Wikipedia,
phrase-based_unigram_model
ambiguity_representations
decision_tree_based_approach
rule-based_heuristics
revision_component
scripts
evaluation_measures
language_acquisition
trainable_sentence_planner
was
morphological_analysis
rating
developed,
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
intentional_structure
comparable,_non-parallel_corpora
support
domain_independent_model
named entities
dialog_model
version
discourse_task
expanded
minimizes
provided
with
EM-algorithm
domain
new
agglutinating_free_word_order_language
manual_feature_selection
severely
abstracts
multiple
scratch
comprising
prototype_system
estimated
deaf
hypothesize
gain
representation_tree
probabilistic_finite_automata
treated
information_retrieval_techniques
vagueness
sentence-level_semantic_equivalence_classification
tool
chart-based_phrase_structure_parsing
bootstrapping_approach
speech_recognition_hypotheses_(SRH)
substrings
context-free_chart_parsing
recent
educational_tool,
memory-based_learning_chunker
agree
continuous_density_HMM
characterize
speeches
expected
systems
sentence_retrieval_problem,
ideograms
conventionally
natural_language_understanding
Term_similarities
information_extraction_techniques
song_lyric_document
novel
corpus
bilingual_material
English-Chinese_bitexts
nominals
complicated
CSG
automatic_extraction
have
formal_language
proper
implementation
topic_signatures
class
whole
way
alleviate
users
conceptual_operations
Generalized_Quantifier_approach
LFG
extracted_field
noun_WSD_problems
coarse-grained_concepts,
current
projection_of_structures
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
joint_model
argued
textual
learned
obtain
linguistic_phenomena
including
language_processing_tasks
Thai_key_prediction
robust_generator
do
Lucy
trees
phrase-based_models
distribution
drawn
very
presumed
paraphrase_examples
Intra-sentential_quality
it
LSA-based_and_the_cooccurrence-based_word_vectors
Taiwan_Child_Language_Corpus
corpus_text
ungrammatical segmentations
runs
pos_tag_ambiguity
InfoMagnets
chunking
hierarchies
consistency_problem
subcategorization_frame_(SCF)
EUROPARL_corpus
described
English_questions
dependency_structures
semantic_domain_models
corpora
syntactic_information
clues
context-free_parsing
faced
certain
ambiguity_packing_and_stochastic_disambiguation_techniques
appear
phrase_chunking
track
against
architectural_modules
parse_tree
(for
aid
top_human-ranked_sentence_plan
shallow_linguistic_features
treat
textual_corpora
topics
positive_and_negative_definition_examples
surface_representation
LMs
Mimo_formalism
accurate
domains:
machine_learning_techniques
