relatively
Thai_key_prediction
unification-based_parsing
phrase-based_statistical_machine_translation_method,
hard_problems
scruffy_texts
place
InfoMagnets
within
linear_logic
members
BLEU
containing
real
portability
training_examples
approximation
Comparator_software
pragmatics_processing,
rule-invocation_strategies
co-occurrence_patterns
surface_forms
computational_complexity
describe
like
hypotheses_graph
irrelevant
words_with_multiple_meanings
communicative_signals
traditional_knowledge-based_techniques
instance,
resemble
(e.g.
significantly
word-aligned_corpora
taggers
dependency_relation_paths
cooccurrence_statistics
SL
zero pronouns
theoretical_linguistic_investigations
non-terminals
collecting
readily
knowledge_sources
annotation_scheme
exploratory_corpus_analysis
stages
natural_language
robustness
bag-of-words_methods
HMM_with_Gaussian_mixture_observation_densities
demonstrative_forms_and_functions
transfer_approach
known_deterministic_parser
RCL_parser
obtain
core
cognitively_well-motivated_interfaces
Korean-to-English_and_a_Japanese-to-English_dictionary
synonym relation
problems
interpretation_and_generation_of_natural_language
superordinate -hyponym relation,
adopts
multilingual,_multimedia_data
reasonably
LT_(LF)
considered
Paramax_spoken_language_understanding_system
log(d)_overheads
captures
unit
estimate
collocations
whole
interrogatives
stemming_model
predictive_questioning
Arabic
associative_relationships_between_verb_phrases
able
focus_of_attention
large_corpora
conventionally
handling
indeed
direct
result
Kong
appropriate
content-independent_formalism
dependency-based_grammar_model
ccg_supertagging
discourse_understanding_process
sentence
AI_problem_solving_techniques
wide
marine
formulated
for
available
clustering_methods
context-free_parsing
verb-noun_collocation_dictionary_for_Polish
credibility_indicators
discourses
<
candidate
benchmark_system
complicated
determining
decision_tree_architecture
word-lemma_based_feature_function_models
logic,
human_data
CoNLL_2008_shared_task
grammar_formalisms
NP-complete
language_processing_tasks
ported
character-_and_word-segmented_data
NL
(from
context-free_languages
challenges
commonsense_reasoning
(in
7.5%
subcategorization_classes
does
linguistic_concepts
clues
training_(reference)_speaker
exponential
rather
spontaneous_speech
analytical_components
compression_ratio
parsing_method
machine_translation_system
discusses
generative_model,
tenses
sharing
SCFs
estimations
JINTACCS_messages
represent
training_resources
context-sensitive,_phrase_structure_grammar
the
human_transcription
Proposition_Bank_data
Combination_methods
discourse-level construct
concepts
MT_evaluation
Basque
token-based_models
unknown_word
translation_candidates
corpus-based_approach
lexical_similarity
derived_words
lexical_database
comma_checker
show
natural_language_interface
class-oriented_framework
automatic_abstracting_systems,
referents
larger
representation
lexical_methods
annotating_scheme
particularly
features
HTML_documents
newspaper text,
research_articles
same
statistical_methods
paraphrase_classification_accuracy
set
kind
graphical_model
unification-based_grammatical_frameworks
pronoun_"it"
speech_synthesis_systems
generators
grammar_coverage_problems
finite-state_approximation
such
modification_probabilities
capture
data_representation
CSG
anaphoric_component
basic
primarily
positive_and_negative_definition_examples
lexical_weighting
relevant
knowledge
through
elaborated
system_response
80.5%
(and
Generalized_Alignment
every
hardware_designs
independently
will
co-occurrence_similarities
NP-_and_non-NP-antecedents
type
lexicon
backwards_transliterations
writing
Spoken_Language_Systems_(SLS)
need
hardness
speeches
deductive_approach
formal_intersections_of_FSAs
from
system_output
Node-based_inference_rules
algorithm_for_translation_lexicon_acquisition_(SABLE),
associative_similarity
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
polysemous_word
probabilistic_model
Hidden_Markov_Model
5%
incremental_probabilistic_parser
likelihood
outperform
verb_final_language
IBM_translation_models
it
Collins_(2000)_reranker
structure_of_communicative_context
built
expected_(grammatical)_sentences
scfs
input_word
CF_grammars
linguistic information,
symbolic knowledge
automatically,
verbs
identification_of_non-local_depenencies
CCLINC_Korean-to-English_translation_system
disjunctive_feature_structures
token_classification_task,
information_extraction_system
text-plan_input
multi-strategy_approach
display_of_graphical_information
NLP
small,_domain-specific_corpus
explore
permits
Japanese_sentence_analyses
computational_linguistics
word-senses
frequency_counts
meaning-entailing_substitutability
substantial
clusters
subpredicates
speech_and_text-image_recognition
resource-frugal_approach
open-domain_question_answering
task
measure
baseline
feature-based_relation_extraction
word_order
passives,
domain_independent_features
part_of_speech_(pos)_tagging
paraphrase_examples
though
automatically
natural_sublanguages
roots_words
referential_information
TAP-XL_Automated_Analyst's_Assistant
retrieval
semantic-oriented_NLP_applications
control
parallel_data
rely
satisfactorily
textual_representation
lower_bound_estimation
projection_of_structures
well_calibrated_probabilities,
computational
with
each
PER
pruning_criteria
pattern
continuous_density_HMM
regular_expressions
grammar_sensu_stricto
less
derived_string
generation_system
surface_English
priming
method
linguistic_objects
AS-closed,
automated_evaluation_techniques,
then
phonological_system
mismatch_resolution_scheme
run
interpretation
high
hidden Markov models (HMM),
program,
word_error_rate_(WER)
word-sense_ambiguity
more
question_phrases
by
modified
texts
analyze
Japanese_language_dictionary
attributes
class
addressed
simple_clausal_structures
POS tags in English,
ASR_output
many
linguistic_processing
gain
parse_forest_representation
correlate
sublanguage,
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
implicit
multiple
serves
discourse_processing
audio_and_scanned_image_data
functional_structure
treated
comparable
verb_form_meanings,
repository
mainly
lemma-based_model
tree-bank
acquire
element
Source_and_Target_languages
word_pairs
limitations
subcategorization_frames
passed
speech_data
simple
neat_texts
types
speaker
solution
lexical_and_syntactical_variation
computationally
collection_of_dialog_motivators
previously
other
permit
meta-inference_types
Words
explanation_generation
one
bearing
statistical_method
customized
generalizable_semantic_principles
strategies,
met
them
into
documents
natural_language_interfaces
syntactic_ambiguity_resolution
defeasibility
reduce
syntactic_categories
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
reflect
conversation_transcripts
word_segmentation
~
fewer
example
sense
reasoning_with_dispositions
finite-state_models
information_retrieval_techniques
feature_functions
French
natural_language_applications
improving
amounts
information
chunks_of_words
pivot
probabilistic_context-free_grammars
polysemy
components
proposed
transfer_phase
ranks
summary_generation
ARPA_large-vocabulary_CSR_corpora
LCS_representations
dictionary-based_word_vectors
IR,
part_of_speech_information
worse
additional
interactions
coordinations
translates
four-participants_face-to-face_meetings
hubs
parse-trees
case-based_MT_(CBMT)
suffix_analysis
representations
answer/question_terms
Chinese_text
113K
suggests
helping
abstracts
they
retrieval_performance
multisentential and multi-paragraph explanations
offers
viewed
morphological_and_syntactic_information
reference_sets
MSR- closed
grammatical_relations
Bayesian_semi-supervised_Chinese_word_segmentation_model
MeSH_relations
under
move-tagged_abstracts
text,
boosting_approach
applied
(using
tools
blocks
proper
KL-ONE_style_representation
MBR_decoding
translation_hypotheses
cognitive_psychology
discourse_constraint
tutorial_dialogue
discriminative_training_criterion
valuable
"glue_language"
WordNet
been
MT-based_paraphrasing_technique
recognition_technology
Japanese_sentence_structure
inflection
specialized_parsing_techniques
benefit
knowledge_engineering
Statistical_Machine_Translation_(SMT)
SMT
M
constructed
instance
tree-to-tree_translation
proposition
error_correction
intelligibility
variant
definition_sentences
multilingual_speech_and_language_applications
conditional_log-linear_model,
specified
what
combines
number
recognition
biases
dictionaries
Korean-to-Japanese_dictionary
deterministic_parsers
coherent
implementation
hoc
paper
known
Tree_Adjoining_Grammars
word-based_alignments
viz.
text_processing
unsupervised_methods
Name List,
machine_translation_outputs
multiple_and_nested_interactions
Japanese_patent_claim_sentences
Information_extraction_techniques
subcategorization_acquisition
qualitative_spatial_constraints
visualization_method,
base_parser,
concept-distance_measures
–
extracted_fields
algorithm
rule-based_heuristics
semantic_equivalence
block_reordering
subcategorization_dictionary
defeasible_reasoning
TiMBL,
allows
novel
also
inference
theory
79.1%
training_material
require
translation_data
lexicologists
scripts
discovered
natural_language_processing
Longman_Dictionary_of_Contemporary_English
predicate_calculus_notation
semantically_unmarked_term
sequences
explanation_system
statistics
applying
model_of_grammatical_processing
speech_processing
entailment_acquisition
aligned_bilingual_corpus
including
ambiguities
ability
verbal_interactions
electronic_discussions
recent
WordNet-based_measures,
extracted
HPSG_natural_language_system
cooccurrence_patterns
word_significance
crossing_liaisons
Penn_Treebank_Corpus
optimum_iteration_number
corpus
enumeration
resolves
function_words
textual_domain,
superior
named_entity_(NE)_recognition_(NER)_system
discriminative_log-linear_models
final
related
training_method
transcribing
induced_model
task-specific_domain_knowledge
text_applications
linguistic_introspection
computational_methods
macro-average_F1_performance
decision_list
text_corpus
et
segment_order-sensitive_methods
TAG
Dutch
incorporating
synthesizes
parallel_structures
electronic_newsgroup_discussions
chunking_performance
accuracy
word_clustering
exploit
train
pronoun_resolution
polynomial_time
LR-parser
full_scale_two-level_morphological_description
Chinese_word_segmenter
personal_names,
semantic
included
Information_Extraction
success,
segment
IE_paradigm
currently
PAKTUS
written_and_spoken_language
Augmented_Transition_Network
hierarchical_(or_other_types_of)_relations
honorifics
bilingual_dictionary_coverage
parallel_corpora
al.
words
it,
devised
Machine_Translation_(MT)_systems
have
possible
part-of-speech_annotation
of
regular_languages
whether
different
conceptual
pieces
permitted
generator
useful_terms
task_representation
combined
designed
provides
subordinate_clause
faced
feature-based relation extraction
board
compositional_approaches,
decision_tree
OCR
declarative_formalism
GUIs
transformation_model
computational_model
SLS_systems
best
collected
scenario_templates
contains
syntactic_disambiguation
written_English
Verbmobil_task
translation_lexicon
dependency_structures
shows
parse_reduction
topic_signature
LMs
several
SVM_learning
method_to_automatically_acquire_paraphrases
natural_language_understanding
semi-supervised_methods
23,000
Chinese_language,
primitive_Optimality_Theory_(OTP),
n-gram_transliteration_model_(n-gram_TM),
translation_memory_system
Translations
apply
loss_functions
formal
house,
demonstrated
tests
tagged
machine_learning_approach
did
implicitly
adapted
maximization
robust_generator
superordinate_substitution
language_acquisition
asymmetric,_or_directional,_relations
listener
machine
processing
topical report,
English/Chinese_and_English/Japanese_language_pairs
hidden_variables
relations
variety
RINA,
objects
laboratory_study
formalising
agreement
transcription_errors
sometimes
logical_model
higher
TL
citing
sparsity_of_the_feature_space
DARPA_Spoken_Language_Systems_(SLS)_program
subset_of_logic
syntax_proper
relative clauses
category_labels
Japanese-English_translation,
classified
transliteration_process
unannotated_text
bit-vector-based_CKY-style_parser
JAVELIN
hybrid_generator,
portion
presumed
syntactic_coverage
Construct_Algebra
definitions
spatial_descriptions
"conventional"_context-free_morphological_grammar
VSM_model
which
1983)
gave
experimental_evaluation
PropBank
express
fake
formulate
referential_elements
thesaurus_construction
rules
logic
interface
search
construct
expectations,
hidden-variable assignments:
takes
stereotyped_text_structure
recognition_network
automatic_estimation_method
MT
HK-open,
dynamic_language_model_combination
Korean-English_translation
performance
user_model
at
produces
Jiang
(Biber,1993;
derived_strings
richer
corpus_data
reduplication
Topic_signatures
appears
phrasal_patterns
semantically_annotated_corpus
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
topic_information
Semantic_theories
word_string
planning-based_architecture
hand-crafted_template-based_or_rule-based_approaches
enriching
presented,
missing_words
statistical_analysis
bootstrapping_approach
useful
general-purpose_NLP_components
thesaurus
vagueness
German_corpus
selected
expletive_occurrences
pair
unsupervised_training
training
extensively
statistical_learning_mechanisms
LM
relative_frequency_of_occurrence
constituent_parts
dialogue_acquisition_and_tracking_algorithm
searched
who
results
160
log-linear_models
distinct
ambiguity_resolution
CCR_formalism
hard decisions
do
certification
unambiguous_structures
vital
semantic_domain_models
operates
suitable
topic_signatures
new
SRI_toolkit
interactive_problem_solving
comprising
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
us
spoken_multiparty_dialogue
fundamentally
generate
syntax,
integrating
advantage
lexicalized_grammar
used
TV_shows
gained
tie
so
computational_lexicon
well-written_discourse
155
Chinese_text_corpora
ranking_rules
new_domain
robustness_problems
entities
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
select
English
discourse_relations
heuristic_rules
multilingually_aligned_wordnets
named entities
song_lyric_document
representation_scheme
segmented_strings
problem
translation_images
industry_watch
feature_structure-directed_generation,
automatic_metrics
chunking_results
MT,
email_communication
limited
domain-specific_semantic_information
model
linguistic_representation
crossed_serial_dependencies
flexible,
relative_error_rate_reduction
incorporated
identifying
arbitrarily
information_redundancy
cooperative_responses
problem,
word_sense_disambiguation
LEXSYS
Topic_Detection_and_Tracking_tasks
MeSH
KL-ONE
retrieval_approach
word-based_collocational_properties
LTAG
Arabic_information_retrieval
even
characterize
spoken_language_corpus
extraction
labeled_directed_graph
sentence_co-occurrences
manually_sense-tagged_data
extracting_subcategorization_frames
shared_lexical_information
conceptual_operations
Languages
pairs
interaction
unique
program
LSA-based_and_the_cooccurrence-based_word_vectors
single-strategy_parsers
author
APT
vocabularies
probabilistic_Horn_clauses
facilitate
Path-based_inference_rules
digital_learning
distance
information_extraction_techniques
presuppositional_nature
linguistic_and_non-linguistic_knowledge
vectors_representing_morpho-syntactic_properties
MT_evaluation_techniques
purposes
Taiwan_Child_Language_Corpus
embodied
event_map
event_terms
averaging
individual
describing
seed_sentences
derived
practical
AS-open,
convey
statistical_techniques
Coedition
Node-based_inference
evaluate
Polymorphemic_stems
word_sense_definitions
Arabic_word_segmenter
claimed
while
indirectly
paraphrase_class
achieves
discourse_context
reliable
CAS
outperforms
focus
manually_segmented_Arabic_corpus
effective
abstractions
multilingual_TIPSTER_user_interfaces
programming_language
speech_understanding
word_tokens
volume
NLP_system
powerful
ranking_learning_problem
machine_transliteration/backtransliteration
there
dependency_relations
access
implements
top_human-ranked_sentence_plan
unpleasant
duration_model
segmentation_standards
cooccurrence
tractable
to
terms,
spoken_dialogue_system
translation_quality
HDAGs
language
probabilistic_context-free_grammar
language_pairs
substrings
lexico-syntactic_knowledge
feature_weighting_and_selection_function
statistical_machine_translation_(SMT)
critical_discussion
lexicons
discourse_copying_algorithm
distinguish
accuracies
dependency_structure
Czech
could
spoken_language_technology
pronoun
f-structures
range_concatenation_grammar_[RCG]_formalism
preceding_words
software
construction-specific_approach
statistical_translation_model
English-Japanese_machine_translation,
guide
SMT_models
manual_transcription
quantification_over_events
latent_variable_model
classification-based_representation_techniques
P-CFG
exotic,
employing
term_extraction
remains
Chine_language
word_vectors
labeled
argument_frames
node_structures
Memo-functions
correlation_measure
young
culling
defined
IE-enhanced_text_browsers
reversible
QA_system
determination
test
during
anaphora_references
extracted_field
chunking
term_aggregation_system
query_optimisation
semantic_distance
Kullback-Leibler_distance,
fine-grained_grammatical_categories
indexing
requires
training_and_test_data
supervised_training_data
CriterionSM_Online_Essay_Evaluation_Service
unsupervised_algorithm
ambiguous_word
patchy
phrases
Plume's_approach_to_parsing
use
little
database_query_application
indices
document-oriented_applications
find
recall,
unseen_data
Dialogue_strategies
runs
grammar_checker
on-line_encyclopedias_and_dictionaries
trainable_sentence_planner
words,
ideograms
structure-sharing_of_graphs
(Bikel,
closely
combining
Situation_Theory
overt_case_markers
configurable
morphological_analysis_problem
ordinary
Large-scale_natural_language_generation
test_corpora
human_judgment
articles
tree_adjoining_grammar
search engine
Turkish_word_structures
trained
text_processors
word
improved
domain_specific_terms
showing
text_processing_software
information workers
abduction
conditioning variables
translation_paths
account
proportion_problem
dependency_tree
~0.25%
sentence-level_and_text-level_anaphora
Turkish_dependency_treebank
sentences
query_terms
probabilities
around
characters-based_Chinese_collocation_system
lexical_substitutions
syntactic_analysis
tracks
97%
recognizing
interactive_question-answering_(Q/A)_system
itself
German_text_corpora
distributional_word_feature_vectors
Hong
process
achieving
positive_feature_vectors
ILIMP
shift-reduce_dependency_parsers
Term_similarities
generation_problem
domain_dependence
standalone_system
performance_improvement
KL-Conc,
against
analyst
numbers
translation lexicons
syntactically_motivated_relations
relational_database
acquired
developed
TRDR_score
MT_system
dependency_parsing
framework
compare
apartment
keep
referential_properties_of_noun_phrases
trend
found
lexical_translations
terminology_structuring
analyses_for_large_treebank_grammars
spoken_language
module
via
way
alleviate
dialog_manager,
IntEx_system
domain
track
small
Intra-sentential_quality
two-phase_shift-reduce_dependency_parser
utterance_classification
1.6
algorithms
conversation_analysis
size
preference
synonymous expressions
survey
question/answer_pairs
inference_types
(for
widely
Word_Sketch_Engine,
weight
MWEs_database
per
bilingual_dictionaries
text collections
resulting
rankings
predicative_information
requirements
user-directed_summaries
natural_language_text
Penn_discourse_annotation
local_structure
methods
seem
conjunction
topic
better
heuristic_principles
educational_tool,
generate)
character
reduced_IL_formulae
layout
parsed_corpus
convolution_kernel
ambiguity
development
average
semantically_rich,_large-scale_knowledge_bases
word-based_system
whose
world
LFG_semantics
German
source of data
associative_relationship
understanding
habituality
data_representation_choice
grammatical_number
towards
linguistic_PoS_tagger_and_chunker
analogies
meanings
O(n6)_time
MSR-open
MT_systems
6
approximation_error
system_performance
TIPSTER_Architecture_specification
ranking
some
was
complex
mappings
classifier_assignment
trainable_components
well
grammatical_frameworks
along
ambiguous wordform,
compositional_interpretation
single-snippet_answers
parsed
commonly
plays
(German-English,
ellipsis_resolution
memory-based_system
based
data_objects
extraction_system
leading
contributes
patterns
aid
performing
English-Chinese_bitexts
consists
how
rule-based_learning_algorithm,
Japanese_unknown_words
similar
SVMs
task-specific_language_development
recently
queries
[ANA]
retrieval_effectiveness
translation_knowledge
automatic_segmentation
concept-concept_matrix
extract
topical_blog_post_retrieval
properties
syntactic_cues
hierarchy
12.5%
small-scale
transliteration
statistical_and_constraint-based_disambiguation
bilingual_material
semantic_representation
that
Natural_Language_Processing_(NLP)_applications
text-to-speech_conversion_system
1
performs
when
thus
source_and_target_language_sentences
pushdown_automaton
but
relied
word-lemma_model
amount
ellipsis
transformed
certain
28,449
about
derivational_history
very
WH-questions
blog_posts
unlexicalized_parser
cooperative
marks
graphics_displays
lexical category ambiguity
overcome
user_interface_styles_or_conventions
machine_translation_task
TIPSTER_applications
coherent_text
Wall_Street_Journal_articles
accurate
idiosyncrasies
viewpoint
assigning
category
has
Generalized_Quantifier_approach
instead
text
pronominalization,
HK-closed,
evaluation_method
EM_algorithm
text-level_anaphora
phrase_translations
spoken_dialogue_systems
inflected_forms
WSD_task
formatted_weather_data
recognizer
distance values
spoken_language_understanding_system
memory-based_learning_chunker
statistical_parser
description
Spelling-checkers
unified
decision-tree_classifier
both
difficult
noun
valid
smoothing
vast
gene_and_protein_interactions
compete
story
gaps
metric
SUN4
acquisition_of_word-semantic_information
hierarchies
simplify
computed
Expectation-Maximization_(EM)_algorithm
information_flow
according
97.24%
differ
agree
adequate
legal_terminology
noun_WSD_problems
consistency_problem
effectiveness
put
still
SSTC
natural_language_generation
uses
phrase-based_unigram_model
restricted_natural_language
strong
independently trained models
mathematical_expressions
domain-specific_translation_lexicons
unification-based_grammar_parsing
multi-pathway_MT_architecture_design
bilingual_corpora
unsegmented_corpus
metaphors
Wall_Street_Journal_treebank
aware
deadline
field_structured_extraction_tasks,
inescapable
automaton
incrementally
summarization
done
meet
described,
maximum_likelihood_method
constructs
0(n)_time
discourse_task
lexical_coverage
coordinate_phrases
NLP_tasks
Web
model_design
syntactic_and_semantic_dependencies
new_sublanguage
existing_grammar
be
produce
nature
Gaussian_mixture
linear-chain_conditional_random_field_(CRF)
fuzzy_quantifiers
appear
error_rate
impacts
English-Chinese_parallel_corpora
few
strengths
integration
translation_framework
agglutinative_language
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
confidence_measures
despite
referring_expressions
parser
discourse_connectives
weather
Xerox_PARC
Noun Classifier Associations (NCA)
editor
phrase
evaluation_metrics
weaknesses,
enough
sentence_plans
distributional_approximation
efficient
2004)
PK-open,
comparable,_non-parallel_corpora
Comparator
version
achieve
speech
studied
learners
non-configurational_languages
Procedural_Systemic_Grammar
source_dependency_parse
manner
critical
MORphological_PArser_MORPA
involves
natural_language_environment
probability-based_scoring_function
clauses
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
domain_independent_model
minor
evaluation_of_Natural_Language_systems
or
CMU
large-scale_knowledge_base
denotational_semantics
application
formalization
ATIS_(Air_Travel_Information_System)_domain
email-threads
sequential_models
formalism
clustering_and_filtering_processes
parallel_concordances
alternative_markers
entirely_data-driven_model_selection_procedure
firmly
summary
nouns
text-to-speech_form
existence
check
Minimum_Bayes-Risk_framework
concrete_noun
feature-based_word_grammar
idiosyncracies
F-measure
after
naturally
mixture
includes
second_language_and_cognitive_skill_acquisition
semantic_criterion
straightforward
subcategorization_cues
knowledge-based_generation_systems
lexical_and_syntactic_features
learning_algorithm
constraint_system
virtual_reality_3D_scene_modeling_software
model_parameters
dictionaries_of_word_forms
Lucy
bilingual_dependency_relations
introduced
role
domain-specific_(in-domain)_word_alignment
subcategorization_frame_(SCF)
further
expert_systems
parser_MDCC
structured
semantic_verb_classes
n-best_speech/language_integration_architecture
dynamic_programming
subtrees
decision-tree_approach
protocol_analysis
summing
global_meaning
linguistically
hypothesize
abstraction
IR
voice_input
statistical_model
connectionist_component
EDOL
draws
language_tutoring_application
software_library
than
statistical_information
free_indexation
threading_algorithm
compositionality
phrase_chunking
raw_text
language_modeling
knowledge-based_mechanisms
terms
error-correction_rules
inflow
determiners
context-free_grammars
word_sense_disambiguation_(WSD)_systems
automatic_discovery_of_text
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
alphabets
text_understanding
linguistic_resources
annotate
previous
relying
bootstrap
capitalization
induced
PCFG-LA model
onto
focussed
discontinuous_constituents
Definite_Clause_Grammar_techniques
seeds
experiments:
reference_model
compactly
A_deterministic_parser
resolving
question-answering_NL_systems
events
kernel_functions
randomly
expected
developed,
official_rankings
salience
parser_for_non-configurational_languages
Dutch_Senseval-2_test_data
illustrated
minimizes
limits
source_interval_projections
trajectory
citations,
lemma-based_approach
nodes
conjuncts
information_extraction_tasks
lexical_items
reestimation_formulas
oral_communication
syntax-based_constraint
disjunctions
SI recognition,
entailment_relations
unequal
marked
presence
utterances
adopt
personal_computers
genre-specific_regularities
question-focused_sentence_retrieval
deep_processing
associated
called
character_and_word_error_rate
ungrammatical input
ambiguity_representations
easy
rhetorical_patterns
approaches
syntactic_descriptions
fourteen
numerous
makes
principle-based_theory
logical_form_language
scope_ambiguity
incorporate
expensive
efficiently
LFG
sentences,
Q/A
depending
general_and_domain_corpora
exhibit
Similarity-driven_Transfer_System_(SimTran),
KDS
model_theoretic_interpretation
high-quality_data
stochastic,_graph-based_method
attain
feature_selection_methods
abstract
n-gram_statistics
unknown_words
tagging
edges
Mimo,
fast,
evaluated
particular
real-world entities
directionality
full_parsing
word-sense_disambiguation_systems,
produced
Chinese_punctuation_marks,
surface_representation
fragments
regarded
cohesive text
theory_of_attention,_intention,_and_aggregation_of_utterances
agenda-based_scheduling_parser
robust_explanation_system
written_texts
semantic_annotation
user
dialog_motivators
bit-vector_operations
Chat-80
handle
aims
standard
contextual_similarity
unification-based_linguistic_descriptions
Markov_model
polarity-tagged_corpus
constitute
linguistic_domain
"one-time_look_up"_method
human_transcriptions
lexicalized_structures
utilized
unigram
presented
classifiers
(called
language processing pipeline
test_set
psycholinguistic_literature
following
characterized
creation
natural_languages
verb_semantics
genres
conceptual_system
abstract_moves
encodes
adjacent
log-linear_combination
classifier
computational_problems
dialog_schemata
automatic_language_identification
translations
observed
sentential_paraphrases
supported
Korean
largely
translation
parsing_process
treebank
text_classification_problems
integral
interlingual_approach
variable
(
much
respect
operational_semantics
PCFG-LA
entirely
internal_and_contextual_information
current
identify
vocabulary),
models
TAGs
dramatically
phone_n-gram_model
underpinning,
NL_evaluations
lexical_hierarchy
language_learning_model
definite_clause_grammars
topics
EUROPARL_corpus
upon
million
Prague_Dependency_Treebank
stochastic_output_selection
addressee_identification
blackboard-like_architecture
manual_feature_selection
occur
Machine_Translation
English_Wikipedia,
discovering_parallel_sentences
documents_with_signal_content
non-literal_aspects_of_communication
Cooperative_Model
paraphrasing_method
field_structured_text
discourse_segmentation
HMM-based_chunk_tagger,
semantic_caseframe_instantiation
combine
126,610
SVM
stems
live_closed_captions
another
ways
original
morphological_constructions
systems
concept
syntactic_structure_information
edit_distance
best-reported
statistical_approaches,
implemented
entity-based_representation
similarity
constituent_structure_trees
argumentation_system
would
EBMT
nominals
antonymous_adjectives
spoken_dialogue
genetic_search
take
CFG_rules
machine-readable_dictionaries_(MRD's)
Penn_Treebank_data
embedded
attentional_structure_in_discourse
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
100,000
procedural
tasks
paraphrase
syntactic_priming
scientific
linguistic rules
weighted_finite-state_device
human
generic
added
generated
morphology
tune
declarative
moment
speech-based_Information_Retrieval_(IR)
cue_phrases
its
comparison
introduce
predictive_performance
Japanese_Dictionary_Task_in_SENSEVAL2
reduced
coarse-grained_concepts,
over
decision_tree_based_approach
Prolog
word_graph
XTAG
right-side dependencies
language-independent_system
precision
means
published
restrictive_statements
alignment
combination_methods
Boolean_matrix_multiplication_(BMM)
post-processing
augment
structural_information
Southern_Min_Chinese
excluded
unrestricted_texts
Nigam
automatically_acquired_parallel_corpus
intelligent_mobile_agents
argument_structures
parsing_strategies
SCFs_distributions
this
word-dependent_substitution_costs
transition_graphs
predicting
bibliographic
SI_corpus
attractive
determined
broad_coverage_lexicon
nominal_compounds
predominant_senses
predicate-argument_structures
Message_Understanding_Conferences
thematic_grid_tagging,
semantics_directed_approach
deviates
segments
can
users
carry
exact_match_accuracy
is
alignment_errors
effectively
automatic_Q/A
monolingual_and_bilingual_information
derivation
quantified_sentences,
augmented
method_of_analyzing_metaphors
morpheme_sequence
retrieve
originally
common
deterministic_grammar
Isomorphic Grammars
unification
integrate
weights
unadulterated
phrase translations
maximum_entropy_word_alignment_algorithm
hierarchical_lexicon
level
generalized_metaphor
cross-entropy
practically_unsupervised_learning_method
root_word_lexicon
speech_recognition_hypotheses_(SRH)
syntax
syntactic_analysis_system
CFG filter
expression
utilizing
translation_performance
wildcards
KL-ONE-like_knowledge_representation_systems
state-of-the-art_performance
heuristic_learning
training_speakers
formalisms
French_tenses
must
interpret
speed
discourse
real-valued_features
temporal_relations
proof procedure
recognition_of_extra-grammatical_input
candidate_parses
disambiguation_tool
comprehensive
we
laws
structure
Polish
statistical_profile
database
lexically-induced_relations
represented
time_exponential_on_the_size_of_the_grammar
ECA
multi-strategy_and_multi-source_approach_to_question_answering
embodied_conversational_agent
non-terminal_symbol
DoPS_system
identification_of_paraphrases
Bayesian_learning
natural_language_processing_(NLP)_systems
fundamental
Presentor
inherent
English,
grs
intentions
dependencies
prototype_system
segment-based_approach
context-free_chart_parsing
depend
format
delimiters
monolingual_parallel_corpora
extraction_tool
word_examples
system's_output
English,_Arabic_and_Spanish_lexicons
addition
mobile_military_command_and_control
initially
English text
discourse-relevant_purposes
vector_space_model
common_text_processing_modules
smaller
examples
hierarchical_relations
statistical_machine_translation
types_of_knowledge
these
multilingual_input
entropy
discursive_usage
drawn
summations
integrates
conceptual_level
basis
different-quality_references
distribution
developing
architecture
abstract_flat_syntactic_representations,_LFG_f-structures,
American Sign Language (ASL) animation
decoding_strategy
and
Systemic_grammar
scratch
ambiguous
parsing-based_NE_rules
evaluation_measures
begin
elementary_structures
aids
should
dialogue_interaction
potential
needed
new_event_detection
VME_bus
write
Intel_i860_chip
Korean_phonological_knowledge_base_system
yield
represents
RCL_parsers
000
phone-string_classifier
directly
FDA
path_values
a
inferred
most
undisambiguated
Discourse_Representation_Theory
user_knowledge_modeling_architecture
[Zernik88],
revision_component
70%_precision
children
phrase_structure_grammar
functions
range_concatenation_languages_[RCL]
using
conceptually
unsupervised_learning_method
generalized_translation_knowledge
respectively
87.5%
manually_segmented_corpus
probabilistic context-free grammars
speaker_adaptation_(SA)
lack
target speaker
word-to-word_alignments
output
task-oriented_dialogs
continuous_speech_recognition_(CSR)_techniques
domain-specific_word_alignment
dictionary
textual
automated_interpretation
Conrath
verb_forms
possible,
STRAND
adaptive_learning_procedure
partial_theories
Grosz-Sidner-style_focus_model
introduction
pooling
Japanese_text_processing
make
domains
MBR_decoders
out-of-domain_corpus
meaning
graceful
phonetic_recognition
Chinese_words
projecting
natural language interfaces
speech_recognition
translation_lexicons
training_corpus
MWEs
obtained
relation extraction
modular
preceeding
semantic network
speaker-independent_(SI)_training
create
on
left_corner_parsing_algorithm
alternative
gives
statistical_MT_performance
Plume
case-based_reasoning
word_clusters
auxiliary
WordNet,
superset_of_L
pharmaceutical news archive
fits
linguistic_information
as
names
polynomial_time_solution
support
Czech-English_statistical_machine_translation_system
capability
Chinese_newspapers
song_lyrics
semantic_analyzer
machine_learning_techniques
enhances
(P05-1076.10
ungrammatical segmentations
defeat_rules
WWER
replete
surface_realizations
traditional_MT_architectural_designs
between
empirical
magnitude
Praguian_dependency-based_approach
formal_analysis
machine_translation_(MT)_evaluation
processes
mutual_information
underspecified_semantic_representation_(USR)
series
judicious
restricted_vocabulary
Head_Grammars
opposed
verb
's
machine_translation_pipeline
restricted_subset
grammatically_correct_input
necessary
knowledge-based_and_random_selection_procedures
RAREAS
stored
equivalent
synchronous dependency parser
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
Log-linear_models
NP
unsupervised_learning
required
argued
parts of speech
reference
compared
strongly
annotation
define
classification_method
provide
structured_data
significant
shown
translation_relation,
corresponding
theories
language_processing_systems
string_similarity
event
dynamic_programming_(DP)
operate
syntactico-semantic_(tectogrammatical)_annotation
discourse_level
automatic_evaluation_measures
tool
pronouns
severely
because
answer_resolution_algorithm
natural_language_interpretation
pipelined_NLG_architecture,
Boolean_conditions
efficient,
20k
either
flexible_parsing
DARPA_Resource_Management_corpus
naming_conventions
namely
problematic
interconnected
grammar
structured_natural_language_data
approach
punctuation
traditional
dialogue_corpora
inferential component
relevance
spatial_attributes
maximum-entropy_model
limited-domain_spoken-language_task
lexical_approaches
SMT_research_community
explicit
word_alignment
bigram_back-off_language_models
transfer_component
specifications
contexts
parsing_technique
linguistic_structure
advantages
parsing
greatly
English-French_document_pairs
expanded
deduced
context
large-vocabulary_CSR,
providing
build
probabilistic_spectral_mapping
word-trigram_recognition
constraint
carried
gold-standard_parse_trees
context-free_phrase-structure_grammar
units
automatic_extraction
Japanese_parsers
wordbreaks
conventional_statistical_methods
generates
body
essays
IE_module
rate
analysis_mechanism
adaptation
generative_history-based_latent_variable_model
improves
semantic_relations
automatic_evaluation
Natural_Language_Processing_(NLP)_system
categorization_task,
methodology
suffix_array-based_data_structure
collection_of_relations_and_operations
improvements
choose
semantic_information
non-English_(Arabic)_stemmer
motivated
grammars
enhance
Syllogistic_reasoning_with_dispositions
web
phrase_boundary_heuristics
military_and_civilian_systems
(Karttunen,
component
POS_learning
large-scale
Graphical_User_Interface_(GUI)_functions
consequences
evidence
connectionist_(neural)_network
parse_tree
traditional_distributional_word-distance_measures
rule-based_systems
EM-algorithm
dialogue_system
text_generation
intuitive
agglutinating_free_word_order_language
input
Bulgarian,
Human-Machine_Communication
confidence
databases
domain_knowledge
s-VSM_model
analyses
time
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
Arabic-English
single
grammaticality
unification-based_grammar
kinds
traditional_deterministic_parsers
corpus-based sample
parsing_data
overall
triple
parse_trees
discourse segment,
text_browser
good
unsupervised learning
certainty_conditions
prior_knowledge
emoticons
only
improvement
automatic
ungrammatical_structures,
segmentation bakeoff
arbitrary
linguistic_expressiveness
Japanese_text
bare_slice_disambiguation
human language learners,
important
temporal_connective
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
part
generation
constraining
priors
probabilistic_context-free_grammar_(PCFG)
declarative_languages
oriented
dictionary_word_sense_definitions
parse_record
language_identification
frequency_profiles
hypothesis
answer_expressions
explicitly
corpus-based_method
Path-based_inference
word_senses
IBM_models
domain-independent_capabilities
rank
consist
anaphora
genre
principled
--
robust---an
are
finite-state_methods
allowing
shallow_mapping
written
general_linguistic_knowledge
grammatical_sentences
subset
attribute_sequences
efficiency
CFG_parser
data_retrieval
distributional_hypothesis
parse_forest
training_techniques
entity-oriented_parser
phrase-based_models
often
feature_vectors
extracts
Mimo_formalism
probabilistic_finite_automaton
descriptions
deterministic_finite_automaton
modeling
CRF
languages
textual_corpora
epistemological_level
JAVELIN_system
encyclopedia,
tagger
starting
described
exploits
practice,
operational_foreign_language_tutoring
input_dataset
HDAG_Kernel
semantic_constraints
n-ary_relations
speech_and_text_image_processing
beam-search_decoder
temporal_adverbials
saturation
resolve
acquiring_adjectival_subcategorization_frames
Named_Entity_task
conditional_loglinear_models
chart-based_phrase_structure_parsing
Japanese_natural_language_processing_studies
detect
textual_credibility_indicators
expectation-maximization_(EM)_based_word-clustering_algorithm,
running
character_types
baseline_system
Graph_unification
converge
predictably
syntactic_behavior
expressed
log-linear and linear interpolation,
source_language_text
questions
lower
analysed
high-accuracy_word-level_alignment_models
order
nominal_constituents
cepstrum-based_features
8000-word
binary_relations
noun_phrase_chunks
mapping_score
exactly
specific_heuristics
structural_and_lexical_dependencies
multi-component_architecture
robust
paraphrases
formal_language
created
MT_output
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
deals
syntax_directed_approach
decision-making
semantic constraints
Japanese
human-machine_interactions
interpolation_methods,
scoring
temporary_belief
bottom-up_pattern-matching_parser
training_data
speech_processing,
-
etc.,
keywords
coherence
unification-based_grammar_formalism
dialog_systems
text_model
much-studied
domain-independent
systemic_grammar
in-domain_corpus
cannot
requiring
own
Koskenniemi,
taxonomic_similarity
German_pronouns
block_selection_criteria
linguistic_annotation
linguistic_theory
text_mining_method
utilizes
WSD_programs
forward_pass,
constructions
labels
inheritance
an
semantic_composition
direction-giving_task
generalized_metaphor_mappings
generative_probabilistic_model
formal_definition
purpose
prosodic
email_conversation
out
feature_structures
spoken_language_understanding
disambiguate
morpho-syntactic_and_semantic_characteristics
Automatic_Speech_Recognition_technology
parse
classifier_word
vectors
logical_well-formedness_conditions
incremental_description_refinement
antecedence_recovery
full_NPs
best-path,_bottom-up,_deterministic_parser
biomedical_text
probability_estimation
unsupervised_learning_algorithm
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
ICICLE_system
error
coherence_assessment
sentence-level_semantic_equivalence_classification
morphological_analysis
trees
strength_of_potential_antecedence
morphological_component
contain
Italian and English verb subcategorization frames (SCFs)
semantically_related_words
similar_context_features
connectivity
unless
dialog_management_system
supports
discourse_structure
maintains
in
machine translation (MT) systems
unsupervised_automatic_acquisition
Japanese_verb_phrases
log-linear_block_bigram_model
modular_architecture
log-linear_(maximum-entropy)_models
share
time_O(|G||w|3-e)
compounds
indicators
completeness
statistical_machine_translation_(MT)
CFG_parsing
dialogue_systems
circuit_specifications
sense_priors
transliteration/backtransliteration_experiments
well_calibrated_probabilities
core_modules
natural_language_processing,
research
adding
tag
offer
language_modeling_tasks
improve
ill-formed_input
mapped
content_words
multi-tagging_approach
Japanese_character_strings
intense
unsegmented_Arabic_corpus
special
support_vector_machine
alignment_adaptation_approach
our
learn
multiple_parsing_strategies,
Japanese_script
part-of-speech_tagging,
answering_agents
scf types
'
(konpyuutaa)
top-down_derivation
usual
natural_language_generation_community
word_significance_(weights)
context-free_phrase_structure_rules
sides
F-measures
GLOSSER
semantic_interpretation
dedicated
inevitable
never
evaluation_measure
helpful
calculus
HBG_model
good,
control_structure
levels
spelling-checkers
answer_extraction
data_representations
Information_Bottleneck
graphic_interpretation_system
biological_entities
resource
learned
Named_Entity_(NE)_tagging
estimated
first
35.0%
highly
dimensionalized_space
decoding
translation_accuracy
dialogue_translation_system
semantic_role_labeling
localized_phrase-based_prediction_model
CTL
bilingual_parallel_corpus
news_articles
complete
polarization
help
existing
target_document
intractability
human_cognition
representation_tree
Korean_and_English_language_pairs
Recognition_of_proper_nouns
syntactic_analyzer,
departure
information_source
among
participated
statistical_parameters
supervised_learning
quantifying_noun_groups
relative
all
accuracy_rate
architectural_modules
recordings
user_modeling
deal
test_language
ad
Sentence_boundary_detection
allow
attentional_state
word-based_models
equivalences,
being
state-of-the-art_coherence_model
rating
two
SRHs
references
compositional_syntax_rules
computational_theory
frequency_classes
"black-box"_methodology
procedures
tree
packed
hierarchically-structured_terminology
may
HMM_and_Max-ent_models
KPSG
semantics
influence
language_independent_modules
advances
behavioral_patterns
structured_databases
multiple_complementation_patterns
areas
arbitrary,
co-occurrence_distribution
printed_text
test_corpus
computer_text_generation_system
Chinese_punctuation_marks
Child_Language_Data_Exchange_System_(CHILDES)
various
parsing_algorithm
corpus_text
monolingual dependency parse
word_error_rate
linguistic_phenomena
pronoun_il
pos_tag_ambiguity
word's
made
usually
centering approach
analytical_inverses
feature_structure_unification
temporal_logic_CTL
distributions
strictly_syntactic_cross-serial_agreement
their
answers
analysis
varied
senses
Chinese_text_input
technique
making
context_free_languages
extensive
)
i/l:::'=--~--
evaluating
parallel_corpus
space
expectations
human_plausible_reasoning
error_correction_mechanisms
beyond
treat
segment_boundaries
sentence_extraction
dialog_model
threads
lexicalised
decision_trees
system
significance
where
construction
multi-strategy_framework
natural_language_processing_systems
essential
lattice-based_approach
two-step_clustering_process
AI_text_generation
sense-tagged_training_data
cognito-pragmatic
working
utterance
labeled_data
constructing
DRT
student
model_checking
achieved
answer_candidates
applications
filled
English-Japanese,
Wizard_of_Oz_technique
BMM_algorithm
derivations
general
ensemble_learning_approach
statistical_models
handles
Turkish
latent_variable
parse trees
decision_tree_learning
temporal_anaphora_phenomena
CFG_parsers
syntactic_information
domains:
newspaper texts
building
large
interlingua
semantic_role_labeling,
lexical_unknown,
vocabulary
Unification_Categorial_Grammar_(UCG)
declarative and imperative utterances,
HPSG
Chinese_word_sense_disambiguation_model
assignments
automatic_evaluations
consider
coarse-level_clustering
logical_formulas
temporal_expressions
Dictionary_construction,
interfaces
class_of_languages
direct_orthographical_mapping_(DOM)
free-content
deaf
performed
Lexical-Functional_Grammars_(LFG)
spectral_clustering_based_approach
data
management_of_uncertainty
word_n-grams
groupings
usefully
fully-connected_first-order_statistical_class_grammar
affix_removal
machine_translation_output
GPSG
rule-based_translation_systems
describes
tailoring
multimodal_parsing_and_understanding
Temporal_Expression_Anchoror_(TEA),
extended
incorporates
77%
uniform_processing
dynamic_combiner
Nagao,1993;
Horn_clauses
captured
demonstrative_expressions
compact
free_word_order
relationship
given
predictions
biomedical_and_linguistic_ontologies
word_segmentation_problem
lexical_affinity
Combinatory_Categorial_Grammar_(CCG)_lexicon
candidates
sets
Conceptual_Dependency_Theory
ranking_algorithm
techniques
target
cross-lingual_comparisons
semantic_expressibility
lend
domain_entities
tagging_strategies
source_language
graph
augmented_Friedman_-_Warren_algorithm
tend
computational_semantic_analyses
lexical_conceptual_structure_(LCS)_representations
flexible_parser
fuzzy_quantifier
typed_feature_structures
HMM_training
prominence
large_Czech_MWE_database
Bikel's_parser
probabilistic_translation_models
correspond
typicality
-speaking
resolution_component
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
easy-to-implement
correctness
independent_classifiers
increased
complex_sentences
Metagrammatical_formalisms
MUC-6 and MUC-7 English NE tasks
address
WSD_models
unsupervised_learning_approach
sounding
frames
equivalence
finite
ranking_problems
flexibilities
attentional_focus
Machine_transliteration/back-transliteration
segmentation
Slavic language
PK-closed,
target_corpus
categories
disambiguation_algorithms
human_understanding_of_natural_language
skips
times
highly_inflective_languages
labelled_bracket_F-score
event_structure
revealed
Task-based_evaluation
newspaper_corpus
large-vocabulary_speech_recognition
verbal_and_nonverbal_grounding_acts
sense_resolution
comparative
work
evaluation
not
yields
consisting
rank,
stack
were
linguistic_structures
reduplications
filter
competitive
selecting
comes
language_(L0)
grammatical_gender
shallow_techniques
dialogue
abductive_inference
involve
supervised_and_unsupervised_methods
feedback
ccg_parsing
distributed_message-passing_infrastructure
agglutinative_languages
provided
corpora
precision_rate
CSR
English_sentence_structure
goal
generative_model
joint_model
lexical,_syntactic,_semantic,_and_structural_information
macro-average_F1
target_vocabulary
HBG
exceeds
up
shallow_linguistic_features
pronominal_anaphora_resolution_module
binary_relational_calculus_notation
proper_names
linguistic_parser/generator
statistical_alignment_techniques
language_model
present
1983;
ASR
any
OT
morphological_analyzer
advertisements
unlexicalized_PCFG_parser
newswire_texts
in-domain_word_alignment
formulas
paraphrasing
errors
predicting_top-level_boundaries,
user-specified
syntax-based_statistical_machine_translation_system
modules
occurring
needs
become
textual_corpus
word_forms
together
Smadja,1993)
placement
PoS-tag_feature_function
histogram
Arabic_word_segmentation_system
word-sense_disambiguation_algorithm
training_and_testing_factors
word_sense_disambiguation_(WSD)
question-answer_pairs
89.75%
fuzzy_syllogism
underspecified representations
answer
quality
finding
English_questions
forecasts
experimental
non-contiguous_phrases
medium-length
sentence_analysis
probabilistic_synchronous_dependency_insertion_grammar
voice_interactive_system
2.284
40
intentional_structure
automatic_alignments
four
graph_transformations
Acoustic_modeling
distributional_concept-distance_measures
machine_translation
outputs
Czech_WordNet
general_domains
sentence_retrieval_problem,
machine-readable_resources
substitutions
spoken_corpora
node-based_inference
syntactic_structure_features
sentiment_vector_space_model_(s-VSM)
normal
ambiguity_packing_and_stochastic_disambiguation_techniques
decision_strategies
natural_language_system
Minimum_Bayes-Risk_(MBR)_decoding
Penn_WSJ
multidimensional_chart_parser
character_bigrams
statistical_alignment_models
probabilistic_finite_automata
spelling_correction
extended_domain_of_locality_(EDOL)
2491
grammatical_formalisms
shared_derivation_forest
language_functionalities
arguments
ungrammatical_input
sentence_plan
