free-content
or
graphic_interpretation_system
pronouns
SI_corpus
portion
summations
patterns
classification-based_representation_techniques
machine_translation_system
anaphora_references
Construct_Algebra
voice_interactive_system
discovered
statistical_machine_translation_(SMT)
contexts
tree-to-tree_translation
trend
context-free_parsing
intense
elementary_structures
developed,
word_vectors
domain_entities
grammatical_formalisms
improvements
SCFs
word-based_models
generative_history-based_latent_variable_model
Generalized_Alignment
natural_language_interface
target speaker
lexical_coverage
class_of_languages
showing
2.284
synchronous dependency parser
Generalized_Quantifier_approach
coarse-grained_concepts,
BMM_algorithm
MT_system
devised
bag-of-words_methods
statistical_methods
included
utterance
direct_orthographical_mapping_(DOM)
cognitively_well-motivated_interfaces
existing
set
training_data
Japanese-English_translation,
97%
recognizing
multiple
dimensionalized_space
MSR-open
declarative
MWEs_database
NP
example
resource-frugal_approach
threads
transfer_component
differ
multi-strategy_framework
suffix_analysis
referential_information
parallel_concordances
permits
time
spoken_language_corpus
novel
shallow_techniques
spatial_descriptions
query_optimisation
linguistic_annotation
honorifics
interrogatives
XTAG
presumed
translation_candidates
aids
HK-closed,
contain
translation lexicons
limits
model_checking
so
TIPSTER_applications
algorithm
source of data
irrelevant
evidence
predicate_calculus_notation
applied
core
Penn_discourse_annotation
learners
Information_extraction_techniques
stems
Japanese_unknown_words
select
answer_candidates
syntactic_priming
medium-length
used
sentence_retrieval_problem,
control
nominal_constituents
allows
average
knowledge
retrieval_performance
domain_specific_terms
argument_frames
ASR
post-processing
estimated
improves
identify
continuous_speech_recognition_(CSR)_techniques
namely
Dutch_Senseval-2_test_data
centering approach
limited
transliteration/backtransliteration_experiments
acquisition_of_word-semantic_information
memory-based_system
significance
parser_MDCC
would
Spoken_Language_Systems_(SLS)
well
syntactically_motivated_relations
problem
Chinese_language,
HDAG_Kernel
characterized
(Bikel,
proposition
richer
LFG_semantics
machine_learning_techniques
specified
evaluated
noun
extracting_subcategorization_frames
software
translation_paths
statistical_analysis
tree_adjoining_grammar
meaning
predicting
dialog_schemata
constructed
dialogue_acquisition_and_tracking_algorithm
nouns
rank,
character-_and_word-segmented_data
word-to-word_alignments
Languages
compositionality
share
defeasibility
relative clauses
linguistic_expressiveness
OT
error_correction
million
references
scfs
MT,
useful_terms
analogies
useful
intentions
ambiguity_packing_and_stochastic_disambiguation_techniques
spoken_language_understanding
range_concatenation_grammar_[RCG]_formalism
discourse segment,
text-level_anaphora
automatic_evaluations
pipelined_NLG_architecture,
phrase_translations
flexibilities
Minimum_Bayes-Risk_framework
retrieval_approach
nature
containing
text_model
part-of-speech_tagging,
grammatical_relations
discourse_segmentation
converge
dynamic_programming
Word_Sketch_Engine,
phrase-based_models
segment-based_approach
weaknesses,
Bayesian_learning
translation_hypotheses
translates
Korean_phonological_knowledge_base_system
discusses
extensive
represents
did
characterize
natural_language_generation_community
1983)
Spelling-checkers
semantic
modification_probabilities
yield
anaphoric_component
dialogue_systems
WordNet-based_measures,
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
CFG_rules
particularly
grammar_formalisms
translation_performance
KDS
Penn_WSJ
through
Presentor
reduce
non-English_(Arabic)_stemmer
target
enhance
any
natural_language_processing_(NLP)_systems
DRT
competitive
method_to_automatically_acquire_paraphrases
best-reported
155
concept-concept_matrix
user_model
strategies,
robustness_problems
robust_explanation_system
best-path,_bottom-up,_deterministic_parser
gives
(in
provide
aligned_bilingual_corpus
natural language interfaces
mismatch_resolution_scheme
graphical_model
such
inflow
large
direction-giving_task
restricted_subset
abductive_inference
Japanese_Dictionary_Task_in_SENSEVAL2
parse_forest
information_source
MUC-6 and MUC-7 English NE tasks
trainable_components
blackboard-like_architecture
multiple_complementation_patterns
vagueness
HK-open,
phrase_structure_grammar
components
intuitive
state-of-the-art_performance
F-measure
communicative_signals
crossed_serial_dependencies
100,000
frequency_counts
takes
rather
bilingual_dictionaries
grammar_checker
multi-strategy_approach
speaker-independent_(SI)_training
maximum_entropy_word_alignment_algorithm
MT_evaluation
formalism
neat_texts
theoretical_linguistic_investigations
source_language
epistemological_level
chunking_results
every
data_representation_choice
who
surface_representation
habituality
semantic_relations
classification_method
size
conditional_loglinear_models
log-linear and linear interpolation,
connectionist_(neural)_network
multilingual_input
coherence_assessment
following
structured
predicate-argument_structures
check
series
unification-based_grammar
members
qualitative_spatial_constraints
categorization_task,
computer_text_generation_system
Comparator
elaborated
good,
interactive_question-answering_(Q/A)_system
captures
structured_data
body
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
operates
Sentence_boundary_detection
previous
morphological_analyzer
question-answering_NL_systems
TV_shows
program,
conversation_analysis
house,
STRAND
disjunctions
stages
human_data
randomly
currently
itself
WWER
extracts
natural_language_processing,
Jiang
compression_ratio
probabilistic_Horn_clauses
Italian and English verb subcategorization frames (SCFs)
recognition_network
language-independent_system
natural_language_understanding
verbal_interactions
resemble
feature-based relation extraction
different
grammars
known
morphological_analysis
TIPSTER_Architecture_specification
embedded
finite-state_methods
statistical_translation_model
statistical_model
IE-enhanced_text_browsers
augment
semantically_related_words
sentence-level_semantic_equivalence_classification
semi-supervised_methods
system's_output
graphics_displays
macro-average_F1
declarative and imperative utterances,
pivot
small
translation_lexicons
discontinuous_constituents
into
inevitable
MBR_decoding
adaptation
forward_pass,
speech_synthesis_systems
human_transcriptions
features
circuit_specifications
cooccurrence
'
temporal_logic_CTL
it
exhibit
pairs
descriptions
probabilistic_context-free_grammar
test_corpus
recall,
text_corpus
assigning
feature_vectors
draws
citing
generation_problem
with
interpret
ellipsis_resolution
Nigam
cue_phrases
verb_semantics
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
probabilistic_finite_automaton
express
ambiguity_resolution
labeled
evaluation_method
language_processing_systems
unification-based_linguistic_descriptions
sometimes
appropriate
translation_lexicon
extracted_field
supervised_training_data
model_parameters
verb_final_language
CMU
evaluation_metrics
stochastic_output_selection
levels
expectation-maximization_(EM)_based_word-clustering_algorithm,
logical_form_language
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
KL-ONE-like_knowledge_representation_systems
specifications
most
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
system_response
genre
structure
scruffy_texts
root_word_lexicon
naming_conventions
information
TAP-XL_Automated_Analyst's_Assistant
corpus-based sample
disambiguation_tool
makes
statistics
identification_of_paraphrases
largely
English
derived_words
portability
Xerox_PARC
SRHs
Intel_i860_chip
correlation_measure
reversible
transition_graphs
arbitrarily
lexical_methods
machine_translation_task
Noun Classifier Associations (NCA)
instead
sets
critical
discourse_copying_algorithm
song_lyrics
have
word-sense_disambiguation_algorithm
raw_text
conjunction
educational_tool,
substantial
regular_expressions
despite
guide
account
temporal_anaphora_phenomena
hypothesize
Topic_Detection_and_Tracking_tasks
machine_learning_approach
abstract
KPSG
vital
classifier_word
intentional_structure
making
text-to-speech_conversion_system
helping
JAVELIN
unique
requirements
alignment
personal_names,
grammatically_correct_input
generated
extended_domain_of_locality_(EDOL)
comparative
integrate
unsupervised_automatic_acquisition
Dialogue_strategies
n-best_speech/language_integration_architecture
compared
graph_transformations
computationally
analysis_mechanism
overall
topics
Kullback-Leibler_distance,
12.5%
automatic
parsing_strategies
grammatical_frameworks
resolving
logic,
formalisms
[Zernik88],
explicit
dependency_relations
though
extracted_fields
theories
introduction
information_flow
human language learners,
fragments
constituent_parts
quantification_over_events
machine_translation_(MT)_evaluation
identification_of_non-local_depenencies
trainable_sentence_planner
same
display_of_graphical_information
segmentation bakeoff
parallel_corpora
embodied
Systemic_grammar
etc.,
generation_system
apartment
wide
HBG_model
word-based_collocational_properties
unpleasant
research
program
monolingual dependency parse
syntactic_ambiguity_resolution
includes
1
formal_analysis
unigram
language
generalized_metaphor_mappings
song_lyric_document
feature_structure_unification
version
analysis
official_rankings
--
some
non-literal_aspects_of_communication
LMs
parser
NLP
called
subcategorization_dictionary
designed
stemming_model
whether
verb-noun_collocation_dictionary_for_Polish
paper
part_of_speech_(pos)_tagging
assignments
Memo-functions
Statistical_Machine_Translation_(SMT)
addition
formal_language
translation_images
large_corpora
event_terms
capture
existence
manner
captured
transcription_errors
classifiers
linguistic_representation
well-written_discourse
linguistic_structure
explanation_system
strong
missing_words
local_structure
predominant_senses
(e.g.
precision
lexical_weighting
6
it,
human_understanding_of_natural_language
addressed
(called
user-directed_summaries
direct
proposed
time_exponential_on_the_size_of_the_grammar
complex
discourse_understanding_process
information_extraction_techniques
binary_relations
SMT_research_community
TAG
achieve
improved
context-free_chart_parsing
dialog_motivators
memory-based_learning_chunker
hierarchical_lexicon
Japanese_script
~
WSD_programs
deductive_approach
LT_(LF)
typed_feature_structures
CFG filter
scientific
ambiguity
token-based_models
comparison
topic_information
semantic_information
utterances
SMT
-speaking
we
DARPA_Spoken_Language_Systems_(SLS)_program
language_(L0)
lower_bound_estimation
simple_clausal_structures
segment_boundaries
log-linear_block_bigram_model
accurate
result
manual_transcription
system_output
confidence_measures
structured_natural_language_data
manual_feature_selection
discursive_usage
treat
statistical_models
laws
number
parse_record
probabilistic_finite_automata
79.1%
benchmark_system
built
topic
SVM_learning
sharing
attributes
electronic_discussions
problem,
best
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
translation_accuracy
126,610
transformation_model
comprehensive
relational_database
"conventional"_context-free_morphological_grammar
significantly
corpus
improve
integrates
embodied_conversational_agent
KL-ONE
word_segmentation_problem
natural_language_system
SLS_systems
collection_of_dialog_motivators
hidden-variable assignments:
independently trained models
linguistic_introspection
model
marks
supervised_learning
maximization
paraphrasing_method
statistical_profile
per
MT_evaluation_techniques
nominals
tutorial_dialogue
combination_methods
structural_and_lexical_dependencies
formal
Syllogistic_reasoning_with_dispositions
base_parser,
questions
hypothesis
explore
mapped
core_modules
interpolation_methods,
Basque
performs
two-phase_shift-reduce_dependency_parser
89.75%
generalized_translation_knowledge
ensemble_learning_approach
word_tokens
context-sensitive,_phrase_structure_grammar
bottom-up_pattern-matching_parser
general-purpose_NLP_components
answer
RAREAS
Korean-to-Japanese_dictionary
distinct
spoken_corpora
vocabulary),
larger
commonly
large_Czech_MWE_database
being
weighted_finite-state_device
tag
asymmetric,_or_directional,_relations
cognito-pragmatic
Topic_signatures
purposes
content_words
what
domain-specific_(in-domain)_word_alignment
us
conditional_log-linear_model,
offers
enumeration
disjunctive_feature_structures
little
taxonomic_similarity
multi-tagging_approach
full_NPs
management_of_uncertainty
Chinese_words
sparsity_of_the_feature_space
strength_of_potential_antecedence
nominal_compounds
NP-complete
correctness
human_cognition
Slavic language
Mimo_formalism
decision-making
allowing
definition_sentences
document-oriented_applications
phonetic_recognition
language_independent_modules
statistical_approaches,
analyst
kernel_functions
collocations
employing
words,
Comparator_software
Natural_Language_Processing_(NLP)_system
SVMs
increased
RCL_parser
automaton
replete
Situation_Theory
presuppositional_nature
statistical_MT_performance
extraction_system
(Biber,1993;
limitations
answer_extraction
efficient
discourse
studied
analyze
subordinate_clause
aware
when
word-aligned_corpora
APT
dictionary_word_sense_definitions
named_entity_(NE)_recognition_(NER)_system
supported
part_of_speech_information
comparable,_non-parallel_corpora
topic_signature
MT
independently
speech_understanding
Chinese_text_corpora
linguistic_and_non-linguistic_knowledge
pharmaceutical news archive
decision_tree
syntax_proper
Message_Understanding_Conferences
different-quality_references
described,
speech_and_text_image_processing
experimental
relations
morphological_and_syntactic_information
cooccurrence_statistics
presented
arbitrary,
annotate
speech_data
PER
aims
ordinary
parser_for_non-configurational_languages
become
word_segmentation
overcome
defeat_rules
capitalization
training_resources
deterministic_finite_automaton
repository
dialogue_translation_system
incorporating
processing
clauses
word_graph
Conceptual_Dependency_Theory
their
dictionary
AS-closed,
taggers
fuzzy_quantifiers
provided
000
context
constraining
German_text_corpora
semantics
placement
surface_forms
given
log(d)_overheads
hand-crafted_template-based_or_rule-based_approaches
theory_of_attention,_intention,_and_aggregation_of_utterances
automatic_Q/A
benefit
5%
positive_feature_vectors
predictably
Czech_WordNet
GUIs
extraction
lexical_affinity
tracks
modules
usually
metric
in-domain_corpus
Turkish_word_structures
distinguish
latent_variable
temporal_expressions
documents_with_signal_content
finite-state_models
principle-based_theory
articles
ideograms
Graphical_User_Interface_(GUI)_functions
lexico-syntactic_knowledge
printed_text
source_interval_projections
lexical_approaches
rely
syntactic_disambiguation
roots_words
Arabic_information_retrieval
listener
verb
can
packed
Temporal_Expression_Anchoror_(TEA),
programming_language
has
mappings
declarative_languages
parsing
term_aggregation_system
database
log-linear_(maximum-entropy)_models
within
AI_text_generation
summarization
estimate
event
English_questions
added
representation
constructing
pos_tag_ambiguity
building
involve
subcategorization_cues
human
creation
running
filter
dedicated
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
disambiguate
dynamic_programming_(DP)
operational_semantics
salience
error
accuracies
computational_complexity
providing
lexical_items
chunking
treated
semantic_domain_models
lexical_hierarchy
IBM_translation_models
starting
basic
argument_structures
transcribing
hard decisions
expletive_occurrences
attribute_sequences
ARPA_large-vocabulary_CSR_corpora
averaging
semantic_composition
defeasible_reasoning
customized
distributional_word_feature_vectors
discourse-relevant_purposes
aid
annotation
systems
parsing_algorithm
concepts
as
genre-specific_regularities
part-of-speech_annotation
exploit
morpheme_sequence
training_techniques
optimum_iteration_number
decision_tree_architecture
requiring
news_articles
113K
existing_grammar
decision_tree_learning
restrictive_statements
level
inflection
ungrammatical_input
vectors
proportion_problem
subcategorization_classes
reasoning_with_dispositions
scf types
unannotated_text
test_corpora
indices
word_pairs
gaps
formulas
real-valued_features
multi-strategy_and_multi-source_approach_to_question_answering
WSD_models
TAGs
rating
goal
2491
bilingual_material
candidate_parses
Korean-to-English_and_a_Japanese-to-English_dictionary
language_learning_model
tree-bank
computational_problems
probabilistic_context-free_grammar_(PCFG)
n-gram_statistics
entailment_acquisition
time_O(|G||w|3-e)
collecting
discourse_processing
detect
bilingual_parallel_corpus
Metagrammatical_formalisms
semantic_annotation
shallow_linguistic_features
illustrated
segmented_strings
together
rate
"glue_language"
lexical_translations
syntactico-semantic_(tectogrammatical)_annotation
information_extraction_tasks
new
coherent_text
unification-based_grammatical_frameworks
ambiguous
robust---an
hidden_variables
event_structure
scope_ambiguity
natural_languages
pruning_criteria
opposed
domain-independent_capabilities
statistical_alignment_techniques
unsegmented_corpus
retrieval_effectiveness
translation_data
derived_string
usefully
carried
primarily
80.5%
feature_functions
be
noun_WSD_problems
demonstrative_forms_and_functions
was
electronic_newsgroup_discussions
feature-based_word_grammar
word_clustering
MORphological_PArser_MORPA
thus
IBM_models
terms,
than
entirely
variable
syntax-based_statistical_machine_translation_system
probabilistic context-free grammars
parse_trees
ambiguities
order
thesaurus_construction
state-of-the-art_coherence_model
pronominal_anaphora_resolution_module
mutual_information
varied
frames
CF_grammars
biomedical_text
formulated
kinds
users
70%_precision
domain-specific_translation_lexicons
tractable
process
new_event_detection
often
deal
improvement
practically_unsupervised_learning_method
unsupervised_algorithm
move-tagged_abstracts
morphological_constructions
for
decision_list
fits
POS tags in English,
160
usual
firmly
deep_processing
rank
performance_improvement
stack
naturally
P-CFG
frequency_classes
language processing pipeline
stereotyped_text_structure
normal
techniques
MWEs
system_performance
F-measures
unsupervised learning
spontaneous_speech
outperform
phrase-based_statistical_machine_translation_method,
smaller
40
tend
synonymous expressions
human_transcription
augmented_Friedman_-_Warren_algorithm
dependency_tree
between
morphology
conceptual_level
1.6
textual_domain,
remains
sense-tagged_training_data
LCS_representations
upon
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
summing
weight
learning_algorithm
generalized_metaphor
query_terms
sense_resolution
ccg_parsing
transliteration_process
HMM_with_Gaussian_mixture_observation_densities
proper_names
source_language_text
question-focused_sentence_retrieval
linguistic_phenomena
noun_phrase_chunks
Chinese_word_segmenter
work
automatic_alignments
implemented
readily
ad
user_interface_styles_or_conventions
numbers
conventionally
left_corner_parsing_algorithm
were
purpose
syntax,
computational_model
expected
phrase_boundary_heuristics
methodology
Path-based_inference
training_material
derivational_history
cohesive text
syntactic_coverage
semantics_directed_approach
military_and_civilian_systems
bootstrapping_approach
senses
Conrath
reliable
scoring
four-participants_face-to-face_meetings
described
from
recognition_of_extra-grammatical_input
utilizes
semantic constraints
mathematical_expressions
deadline
hypotheses_graph
essays
special
original
coherent
by
in-domain_word_alignment
dynamic_language_model_combination
polysemous_word
word-sense_ambiguity
agglutinative_language
natural_language_generation
underpinning,
conversation_transcripts
Markov_model
compounds
distance
alphabets
resolve
dramatically
language_tutoring_application
answer_resolution_algorithm
culling
expectations
data_representation
histogram
suffix_array-based_data_structure
Chinese_newspapers
that
tailoring
determined
shared_lexical_information
lexicologists
forecasts
RINA,
originally
processes
superordinate -hyponym relation,
Korean-English_translation
logical_formulas
dictionary-based_word_vectors
natural_sublanguages
–
sense_priors
about
superset_of_L
delimiters
HMM_and_Max-ent_models
Bikel's_parser
corpus-based_approach
flexible,
natural_language_processing
tests
"one-time_look_up"_method
unadulterated
personal_computers
subset_of_logic
summary_generation
dynamic_combiner
meta-inference_types
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
(using
attain
laboratory_study
semantic_role_labeling,
labeled_data
HMM_training
consisting
conceptually
temporary_belief
formal_definition
robustness
general_linguistic_knowledge
young
pronoun
unsupervised_learning_algorithm
spoken_dialogue_systems
implements
will
accuracy_rate
probabilistic_context-free_grammars
focussed
ungrammatical_structures,
over
Japanese_text
Grosz-Sidner-style_focus_model
speech-based_Information_Retrieval_(IR)
conjuncts
groupings
semantic_verb_classes
English,
enriching
probabilities
sentiment_vector_space_model_(s-VSM)
is
English-Chinese_bitexts
human-machine_interactions
dialog_systems
28,449
CFG_parser
fewer
traditional_distributional_word-distance_measures
path_values
drawn
efficiency
meet
English-Chinese_parallel_corpora
tune
exceeds
appears
much
should
high-accuracy_word-level_alignment_models
expressed
each
zero pronouns
analysed
agenda-based_scheduling_parser
consider
to
machine_translation
reestimation_formulas
semantic-oriented_NLP_applications
abstraction
straightforward
inference
compare
satisfactorily
target_document
trees
s-VSM_model
written_and_spoken_language
text_generation
user-specified
IE_module
Wall_Street_Journal_articles
co-occurrence_patterns
subcategorization_frame_(SCF)
word_senses
SSTC
word_sense_disambiguation_(WSD)_systems
emoticons
outputs
equivalence
pronoun_resolution
language_processing_tasks
like
equivalences,
entailment_relations
Arabic_word_segmentation_system
generators
associative_similarity
Web
unknown_word
deaf
shift-reduce_dependency_parsers
word_order
LEXSYS
language_pairs
unless
provides
Intra-sentential_quality
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
automated_interpretation
conceptual_operations
rules
parsed_corpus
dialog_model
unknown_words
speech_recognition_hypotheses_(SRH)
machine
less
dialog_management_system
NL_evaluations
contextual_similarity
newswire_texts
measure
temporal_connective
during
models
translation_quality
stochastic,_graph-based_method
variant
accuracy
NP-_and_non-NP-antecedents
greatly
positive_and_negative_definition_examples
generator
out-of-domain_corpus
citations,
CCR_formalism
planning-based_architecture
trajectory
recordings
systemic_grammar
linguistic_theory
data_objects
context-free_phrase_structure_rules
tasks
introduced
practical
87.5%
lexical_unknown,
marine
real-world entities
encodes
node_structures
non-configurational_languages
including
world
made
configurable
along
ambiguous_word
anaphora
expected_(grammatical)_sentences
supervised_and_unsupervised_methods
ranking_learning_problem
mobile_military_command_and_control
intelligent_mobile_agents
syntactic_analysis_system
Chinese_word_sense_disambiguation_model
structural_information
language_identification
typicality
use
event_map
new_sublanguage
author
interactions
corpus-based_method
wordbreaks
protocol_analysis
lexical_and_syntactic_features
met
temporal_relations
create
prosodic
challenges
structured_databases
hoc
interfaces
relevant
small-scale
reasonably
grammaticality
possible
depending
maximum-entropy_model
syntax
reference_model
predictive_performance
handles
decision_strategies
unsupervised_methods
compositional_interpretation
word_forms
additional
approach
monolingual_parallel_corpora
powerful
advantages
learned
on-line_encyclopedias_and_dictionaries
transformed
associative_relationships_between_verb_phrases
NLP_system
inferred
description
pronoun_"it"
domain_knowledge
evaluating
found
Information_Extraction
Combination_methods
MT-based_paraphrasing_technique
traditional_knowledge-based_techniques
case-based_reasoning
generative_model,
severely
translation
claimed
target_vocabulary
word_alignment
prior_knowledge
words_with_multiple_meanings
inference_types
linguistically
InfoMagnets
fourteen
fundamentally
discriminative_log-linear_models
coarse-level_clustering
passed
Boolean_conditions
word_n-grams
language_model
joint_model
manually_segmented_Arabic_corpus
speech_processing,
domain
represented
heuristic_learning
database_query_application
interpretation
semantic_equivalence
sentences,
generate)
HPSG
primitive_Optimality_Theory_(OTP),
rankings
temporal_adverbials
lexical_and_syntactical_variation
handle
traditional
easy
unambiguous_structures
WSD_task
underspecified_semantic_representation_(USR)
sentence_plans
automated_evaluation_techniques,
requires
training_(reference)_speaker
reduplications
analyses_for_large_treebank_grammars
LFG
take
strictly_syntactic_cross-serial_agreement
subtrees
substitutions
via
lexicon
overt_case_markers
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
mixture
serves
HMM-based_chunk_tagger,
defined
parse_reduction
choose
done
probabilistic_translation_models
Q/A
both
domains
valid
inflected_forms
English-Japanese_machine_translation,
search
cross-lingual_comparisons
relation extraction
good
spoken_multiparty_dialogue
context-free_grammars
mapping_score
labels
instance
seem
a
analytical_components
framework
standard
word_sense_disambiguation
evaluation_of_Natural_Language_systems
linguistic_processing
Machine_Translation
confidence
constructs
restricted_natural_language
chunking_performance
task
hidden Markov models (HMM),
synonym relation
gave
relied
domains:
describing
cooperative_responses
board
rule-invocation_strategies
comparable
conditioning variables
full_parsing
coordinations
Chat-80
macro-average_F1_performance
segmentation
Cooperative_Model
representation_tree
solution
knowledge-based_generation_systems
dictionaries
German_pronouns
intractability
automatically,
simplify
analyses
formatted_weather_data
vocabularies
tagging
extract
annotation_scheme
named entities
procedures
i/l:::'=--~--
specific_heuristics
mainly
spoken_language_technology
either
definite_clause_grammars
Acoustic_modeling
proper
tagger
Semantic_theories
obtain
calculus
presence
parse
syntactic_structure_information
baseline
moment
four
ranking
CRF
morphological_analysis_problem
agreement
meanings
means
grs
Source_and_Target_languages
sides
exponential
parsing-based_NE_rules
shallow_mapping
distance values
input
derivation
times
thematic_grid_tagging,
combined
ways
PCFG-LA model
dependency_parsing
human_judgment
Log-linear_models
antecedence_recovery
adjacent
significant
permit
implicitly
helpful
dependency_relation_paths
co-occurrence_distribution
transliteration
speech_processing
required
paraphrase
heuristic_rules
(for
metaphors
procedural
relationship
writing
priming
boosting_approach
Japanese_character_strings
word-based_system
saturation
parse-trees
bootstrap
user
certain
KL-Conc,
integration
based
attentional_state
subset
[ANA]
Japanese_language_dictionary
IR,
languages
probabilistic_spectral_mapping
utterance_classification
machine-readable_resources
syntax-based_constraint
reference
Named_Entity_(NE)_tagging
support_vector_machine
grammar_coverage_problems
MT_systems
GLOSSER
al.
legal_terminology
two-step_clustering_process
semantic network
Unification_Categorial_Grammar_(UCG)
constituent_structure_trees
consistency_problem
referents
text_browser
input_word
Node-based_inference_rules
limited-domain_spoken-language_task
text-plan_input
retrieve
Chinese_punctuation_marks
classifier
evaluation
substrings
abstract_flat_syntactic_representations,_LFG_f-structures,
architectural_modules
Paramax_spoken_language_understanding_system
automatic_discovery_of_text
entity-based_representation
Japanese_verb_phrases
formal_intersections_of_FSAs
abstracts
pooling
vocabulary
incremental_probabilistic_parser
expression
leading
string_similarity
textual_corpus
denotational_semantics
abduction
deviates
must
but
word's
lack
source_dependency_parse
developed
resource
inherent
access
preference
general_domains
Proposition_Bank_data
this
Chine_language
of
superordinate_substitution
train
structure-sharing_of_graphs
capability
predictions
human_plausible_reasoning
two
role
types_of_knowledge
verbal_and_nonverbal_grounding_acts
hierarchically-structured_terminology
baseline_system
phrase
textual_corpora
ill-formed_input
modular
prototype_system
extraction_tool
linear-chain_conditional_random_field_(CRF)
constructions
word-sense_disambiguation_systems,
knowledge-based_and_random_selection_procedures
exploratory_corpus_analysis
uniform_processing
even
German
necessary
incorporated
another
recognition
need
demonstrated
multilingually_aligned_wordnets
tie
Chinese_punctuation_marks,
recently
n-gram_transliteration_model_(n-gram_TM),
quantifying_noun_groups
SVM
reduplication
specialized_parsing_techniques
manually_sense-tagged_data
interface
translation_knowledge
handling
write
space
supports
20k
syntactic_structure_features
linguistic_objects
Smadja,1993)
Similarity-driven_Transfer_System_(SimTran),
text_processors
verbs
estimations
context-free_phrase-structure_grammar
similar
log-linear_combination
similarity
lend
genres
Gaussian_mixture
shown
alleviate
clues
77%
Information_Bottleneck
areas
terminology_structuring
MeSH
bigram_back-off_language_models
hard_problems
automatic_estimation_method
nodes
then
resolves
abstract_moves
genetic_search
formulate
translation_memory_system
considered
correlate
interactive_problem_solving
"black-box"_methodology
automatic_extraction
tagged
edges
treebank
FDA
Bulgarian,
distributional_approximation
respectively
natural_language_applications
more
multi-pathway_MT_architecture_design
grammatical_gender
automatic_evaluation_measures
Koskenniemi,
and
behavioral_patterns
smoothing
tools
Translations
constraint_system
HTML_documents
error_rate
which
unsupervised_learning
feature_weighting_and_selection_function
constitute
LM
first
top-down_derivation
categories
inferential component
operational_foreign_language_tutoring
parallel_data
monolingual_and_bilingual_information
argumentation_system
success,
lexical_substitutions
other
beam-search_decoder
adopts
advantage
several
sequences
lexical_conceptual_structure_(LCS)_representations
surface_English
QA_system
Mimo,
arbitrary
8000-word
lexical category ambiguity
passives,
referring_expressions
connectivity
multilingual_TIPSTER_user_interfaces
question/answer_pairs
phrasal_patterns
automatic_abstracting_systems,
seed_sentences
spoken_dialogue_system
predicative_information
CCLINC_Korean-to-English_translation_system
could
events
35.0%
word_significance_(weights)
relative_frequency_of_occurrence
lattice-based_approach
implementation
Lucy
names
they
answers
identifying
2004)
discourse_task
adaptive_learning_procedure
training_and_testing_factors
input_dataset
ranks
statistical_machine_translation
incremental_description_refinement
Definite_Clause_Grammar_techniques
address
may
relative_error_rate_reduction
consists
range_concatenation_languages_[RCL]
top_human-ranked_sentence_plan
text_mining_method
summary
semantic_interpretation
pronoun_il
induced
lexicalized_structures
language_modeling_tasks
own
information_redundancy
meaning-entailing_substitutability
blocks
linguistic_parser/generator
much-studied
speaker
fine-grained_grammatical_categories
extracted
sentence_co-occurrences
question_phrases
rule-based_learning_algorithm,
amounts
priors
probability_estimation
respect
outperforms
linguistic_concepts
learn
M
where
experimental_evaluation
lemma-based_approach
language_modeling
interconnected
extended
Task-based_evaluation
segmentation_standards
Chinese_text_input
theory
regular_languages
Verbmobil_task
word_clusters
discourse_context
ranking_rules
computational_linguistics
strengths
ungrammatical segmentations
VSM_model
ability
oriented
cepstrum-based_features
gained
CriterionSM_Online_Essay_Evaluation_Service
place
indexing
deals
children
PAKTUS
parsing_technique
independent_classifiers
NL
method
training_method
sentence-level_and_text-level_anaphora
polysemy
training_and_test_data
published
able
problematic
discourse_level
efficiently
Kong
test_language
data
TiMBL,
<
polarization
needed
contributes
GPSG
polynomial_time
practice,
Chinese_text
corpus_data
statistical_information
distributed_message-passing_infrastructure
alternative_markers
instance,
incrementally
Arabic_word_segmenter
referential_elements
DARPA_Resource_Management_corpus
addressee_identification
facilitate
corresponding
bit-vector-based_CKY-style_parser
word_sense_definitions
databases
determination
Wall_Street_Journal_treebank
-
revealed
generic
relevance
while
Coedition
decision-tree_classifier
latent_variable_model
parsing_process
PCFG-LA
robust
text
oral_communication
lexicalised
reduced
rule-based_translation_systems
related
JINTACCS_messages
bit-vector_operations
uses
represent
(
topic_signatures
also
Japanese_sentence_analyses
hierarchies
permitted
hardware_designs
describe
visualization_method,
decoding_strategy
utilizing
expectations,
digital_learning
stored
manually_segmented_corpus
lexically-induced_relations
IE_paradigm
similar_context_features
derivations
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
English text
decoding
dialogue_corpora
grammatical_number
appear
associated
linguistic_resources
Penn_Treebank_Corpus
auxiliary
linear_logic
high-quality_data
HPSG_natural_language_system
modular_architecture
text_processing
minimizes
selected
recent
Japanese
errors
large-vocabulary_CSR,
log-linear_models
information workers
attentional_structure_in_discourse
chunks_of_words
worse
trained
Prolog
modified
implicit
probabilistic_model
allow
Prague_Dependency_Treebank
search engine
regarded
enhances
common_text_processing_modules
representations
fuzzy_quantifier
well_calibrated_probabilities,
way
RCL_parsers
Minimum_Bayes-Risk_(MBR)_decoding
term_extraction
projecting
Human-Machine_Communication
topical report,
dialogue_interaction
CFG_parsing
higher
effectiveness
binary_relational_calculus_notation
cannot
clustering_and_filtering_processes
dependency-based_grammar_model
knowledge-based_mechanisms
natural_language_interfaces
traditional_MT_architectural_designs
carry
speech
machine_translation_output
Polymorphemic_stems
augmented
parallel_structures
answer/question_terms
syntactic_analysis
multilingual_speech_and_language_applications
generative_probabilistic_model
natural_language_environment
performing
empirical
sentence
word-senses
multimodal_parsing_and_understanding
evaluate
CTL
among
variety
phrase-based_unigram_model
natural_language_interpretation
French_tenses
Polish
widely
generative_model
1983;
natural_language
characters-based_Chinese_collocation_system
easy-to-implement
pronominalization,
incorporates
semantic_distance
localized_phrase-based_prediction_model
task-oriented_dialogs
parse trees
POS_learning
quality
Machine_Translation_(MT)_systems
kind
second_language_and_cognitive_skill_acquisition
discourse_relations
them
begin
linguistic_structures
lexicons
test_set
predictive_questioning
parallel_corpus
particular
output
known_deterministic_parser
retrieval
approaches
spoken_dialogue
unlexicalized_parser
demonstrative_expressions
help
better
achieves
complex_sentences
question-answer_pairs
training_speakers
context_free_languages
words
traditional_deterministic_parsers
strongly
compositional_approaches,
these
objects
Arabic
model_theoretic_interpretation
induced_model
morpho-syntactic_and_semantic_characteristics
focus
interlingua
semantic_criterion
reduced_IL_formulae
23,000
Japanese_text_processing
spectral_clustering_based_approach
large-scale
Expectation-Maximization_(EM)_algorithm
bibliographic
understanding
critical_discussion
semantically_unmarked_term
TL
American Sign Language (ASL) animation
there
parts of speech
Japanese_patent_claim_sentences
unrestricted_texts
statistical_parser
knowledge_sources
define
spoken_language
word_examples
discourse_constraint
EBMT
word-trigram_recognition
apply
analytical_inverses
bare_slice_disambiguation
focus_of_attention
German_corpus
show
unification
incorporate
task-specific_language_development
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
around
simple
word-lemma_based_feature_function_models
CoNLL_2008_shared_task
BLEU
Turkish
sequential_models
lower
semantic_caseframe_instantiation
equivalent
language_acquisition
lexical,_syntactic,_semantic,_and_structural_information
biases
linguistic information,
heuristic_principles
semantic_representation
introduce
class-oriented_framework
Named_Entity_task
developing
prominence
relative
correspond
internal_and_contextual_information
finite-state_approximation
scripts
corpora
data_representations
certification
distributions
answer_expressions
according
EM_algorithm
English/Chinese_and_English/Japanese_language_pairs
approximation_error
phone_n-gram_model
co-occurrence_similarities
editor
agree
acquiring_adjectival_subcategorization_frames
collected
reference_sets
convey
machine-readable_dictionaries_(MRD's)
relatively
produced
Thai_key_prediction
broad_coverage_lexicon
very
needs
open-domain_question_answering
maintains
syntactic_analyzer,
Lexical-Functional_Grammars_(LFG)
conventional_statistical_methods
Japanese_parsers
because
sentential_paraphrases
skips
transfer_phase
sense
examples
encyclopedia,
evaluation_measure
keywords
inheritance
unsegmented_Arabic_corpus
attentional_focus
syntactic_cues
resulting
feature_selection_methods
its
quantified_sentences,
AS-open,
units
category_labels
newspaper_corpus
distributional_hypothesis
potential
ellipsis
tool
compact
subcategorization_acquisition
software_library
word_sense_disambiguation_(WSD)
Nagao,1993;
shows
utilized
threading_algorithm
7.5%
Boolean_matrix_multiplication_(BMM)
are
scenario_templates
modeling
make
hierarchical_relations
closely
comes
unlexicalized_PCFG_parser
coordinate_phrases
control_structure
combining
training
Combinatory_Categorial_Grammar_(CCG)_lexicon
antonymous_adjectives
fake
track
classifier_assignment
faced
training_corpus
semantic_analyzer
EM-algorithm
word-dependent_substitution_costs
participated
(konpyuutaa)
abstractions
pushdown_automaton
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
shared_derivation_forest
computed
field_structured_extraction_tasks,
entropy
associative_relationship
flexible_parser
ungrammatical input
effective
verb_form_meanings,
viz.
combines
web
textual_representation
connectionist_component
types
paraphrase_examples
ranking_problems
probabilistic_synchronous_dependency_insertion_grammar
put
high
industry_watch
the
highly_inflective_languages
SL
whose
results
completeness
discourse-level construct
cooccurrence_patterns
module
feature_structures
pair
recognizer
been
unsupervised_training
TRDR_score
attractive
lexicalized_grammar
probability-based_scoring_function
character_and_word_error_rate
entities
alignment_errors
agglutinative_languages
single-snippet_answers
multilingual,_multimedia_data
hierarchical_(or_other_types_of)_relations
unseen_data
email_conversation
onto
token_classification_task,
vector_space_model
recognition_technology
improving
valuable
produce
constraint
plays
EUROPARL_corpus
surface_realizations
at
training_examples
statistical_alignment_models
Graph_unification
partial_theories
single-strategy_parsers
classified
indeed
dependency_structure
ambiguity_representations
fast,
candidates
automatic_evaluation
never
generation
free_word_order
volume
Czech
gene_and_protein_interactions
component
presented,
punctuation
Czech-English_statistical_machine_translation_system
syntax_directed_approach
automatically_acquired_parallel_corpus
Longman_Dictionary_of_Contemporary_English
real
ambiguous wordform,
)
MT_output
character
generate
paraphrases
grammar
paraphrase_classification_accuracy
derived
pragmatics_processing,
departure
virtual_reality_3D_scene_modeling_software
hybrid_generator,
's
syntactic_descriptions
combine
HDAGs
enough
large-vocabulary_speech_recognition
coherence
CSR
natural_language_text
system
out
hubs
Japanese_natural_language_processing_studies
flexible_parsing
Augmented_Transition_Network
expensive
Large-scale_natural_language_generation
adding
context-free_languages
domain_independent_model
essential
applications
word_string
idiosyncracies
duration_model
beyond
class
phrases
polarity-tagged_corpus
gold-standard_parse_trees
intelligibility
properties
right-side dependencies
speech_and_text-image_recognition
basis
CFG_parsers
judicious
statistical_parameters
segment
polynomial_time_solution
OCR
distribution
SMT_models
filled
textual_credibility_indicators
dialogue
character_types
parse_forest_representation
integrating
support
computational_methods
research_articles
Isomorphic Grammars
AI_problem_solving_techniques
Tree_Adjoining_Grammars
deduced
dialog_manager,
tenses
depend
answering_agents
element
Plume
likelihood
(Karttunen,
formalization
97.24%
spelling_correction
sentence_extraction
format
continuous_density_HMM
domain_dependence
written
magnitude
generalizable_semantic_principles
rule-based_systems
decision-tree_approach
collection_of_relations_and_operations
Arabic-English
Natural_Language_Processing_(NLP)_applications
entirely_data-driven_model_selection_procedure
compositional_syntax_rules
source_and_target_language_sentences
user_knowledge_modeling_architecture
convolution_kernel
vectors_representing_morpho-syntactic_properties
method_of_analyzing_metaphors
~0.25%
CAS
approximation
problems
one
topical_blog_post_retrieval
textual
influence
multiple_parsing_strategies,
newspaper texts
few
subcategorization_frames
MSR- closed
Collins_(2000)_reranker
acquired
Words
dependency_structures
symbolic knowledge
decision_trees
block_reordering
unsupervised_learning_method
WordNet
automatic_language_identification
projection_of_structures
phrase_chunking
computational_lexicon
morphological_component
general
texts
HBG
performed
against
type
undisambiguated
involves
ASR_output
require
explicitly
sentence_analysis
sublanguage,
automatically
task_representation
survey
error-correction_rules
voice_input
semantic_expressibility
weights
rule-based_heuristics
determining
blog_posts
discovering_parallel_sentences
statistical_learning_mechanisms
sentence_plan
domain-independent
O(n6)_time
construction
indirectly
compete
Hidden_Markov_Model
technique
exact_match_accuracy
logical_well-formedness_conditions
SUN4
phonological_system
CSG
synthesizes
unification-based_parsing
automatic_segmentation
on
numerous
word_error_rate
word-lemma_model
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
unsupervised_learning_approach
Child_Language_Data_Exchange_System_(CHILDES)
minor
still
PropBank
relying
IR
EDOL
linguistic rules
distributional_concept-distance_measures
argued
using
affix_removal
runs
compactly
directionality
expanded
non-terminals
discourse_connectives
gain
scratch
achieved
multiple_and_nested_interactions
Name List,
text,
clusters
cross-entropy
text_processing_software
common
exactly
parse_tree
English-Japanese,
Korean
computational_semantic_analyses
domain-specific_word_alignment
labeled_directed_graph
wildcards
VME_bus
construction-specific_approach
live_closed_captions
syntactic_information
evaluation_measures
chart-based_phrase_structure_parsing
alternative
determiners
statistical_method
edit_distance
many
model_design
pattern
exploits
construct
written_English
MBR_decoders
written_texts
WordNet,
email_communication
applying
text collections
psycholinguistic_literature
logic
up
operate
corpus_text
computational
fully-connected_first-order_statistical_class_grammar
multidimensional_chart_parser
not
frequency_profiles
obtained
statistical_and_constraint-based_disambiguation
further
model_of_grammatical_processing
indicators
finding
functions
bilingual_dependency_relations
subpredicates
Wizard_of_Oz_technique
adopt
LTAG
(from
proof procedure
occurring
SRI_toolkit
Term_similarities
our
user_modeling
backwards_transliterations
unified
structure_of_communicative_context
Machine_transliteration/back-transliteration
paraphrase_class
node-based_inference
segment_order-sensitive_methods
semantic_constraints
whole
Discourse_Representation_Theory
machine_translation_pipeline
semantically_annotated_corpus
MeSH_relations
individual
terms
biological_entities
representation_scheme
word-based_alignments
development
statistical_techniques
feature-based_relation_extraction
Taiwan_Child_Language_Corpus
machine_transliteration/backtransliteration
unit
initially
concrete_noun
advances
produces
student
loss_functions
LR-parser
Recognition_of_proper_nouns
deterministic_grammar
syntactic_and_semantic_dependencies
phone-string_classifier
referential_properties_of_noun_phrases
deterministic_parsers
audio_and_scanned_image_data
advertisements
maximum_likelihood_method
weather
logical_model
conceptual
text_applications
annotating_scheme
agglutinating_free_word_order_language
ported
speed
architecture
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
parsed
after
previously
small,_domain-specific_corpus
0(n)_time
documents
yields
lexical_similarity
robust_generator
word_error_rate_(WER)
selecting
extensively
rhetorical_patterns
find
spoken_language_understanding_system
credibility_indicators
methods
paraphrasing
text-to-speech_form
ILIMP
field_structured_text
run
well_calibrated_probabilities
searched
algorithm_for_translation_lexicon_acquisition_(SABLE),
Southern_Min_Chinese
bilingual_dictionary_coverage
keep
hardness
excluded
feature_structure-directed_generation,
task-specific_domain_knowledge
new_domain
JAVELIN_system
word
triple
arguments
Dutch
impacts
crossing_liaisons
present
category
algorithms
(and
f-structures
experiments:
Dictionary_construction,
phrase translations
semantic_role_labeling
working
discourses
parsing_method
revision_component
French
effectively
English_Wikipedia,
bearing
text_classification_problems
lexical_database
interpretation_and_generation_of_natural_language
certainty_conditions
ranking_algorithm
acquire
application
grammar_sensu_stricto
various
PK-closed,
SI recognition,
free_indexation
do
n-ary_relations
consist
information_retrieval_techniques
newspaper text,
conceptual_system
standalone_system
principled
graph
word_significance
semantically_rich,_large-scale_knowledge_bases
explanation_generation
vast
under
thesaurus
verb_forms
Node-based_inference
how
WH-questions
linguistic_domain
SCFs_distributions
unification-based_grammar_formalism
A_deterministic_parser
et
grammatical_sentences
LSA-based_and_the_cooccurrence-based_word_vectors
motivated
general_and_domain_corpora
current
Penn_Treebank_data
statistical_machine_translation_(MT)
graceful
comma_checker
natural_language_processing_systems
labelled_bracket_F-score
finite
suitable
preceeding
(German-English,
tagging_strategies
spatial_attributes
interlingual_approach
resolution_component
feedback
(P05-1076.10
linguistic_information
segments
machine translation (MT) systems
adapted
definitions
final
error_correction_mechanisms
important
information_extraction_system
expert_systems
ATIS_(Air_Travel_Information_System)_domain
concept-distance_measures
syntactic_categories
contains
dependencies
large-scale_knowledge_base
case-based_MT_(CBMT)
story
PK-open,
computational_theory
created
in
spelling-checkers
function_words
offer
performance
highly
difficult
PoS-tag_feature_function
disambiguation_algorithms
speech_recognition
adequate
clustering_methods
Automatic_Speech_Recognition_technology
Path-based_inference_rules
integral
ICICLE_system
functional_structure
complete
ccg_supertagging
marked
available
formalising
complicated
ECA
Procedural_Systemic_Grammar
discourse_structure
discriminative_training_criterion
Head_Grammars
non-terminal_symbol
language_functionalities
consequences
declarative_formalism
Japanese_sentence_structure
NLP_tasks
knowledge_engineering
unequal
suggests
transfer_approach
occur
towards
sentences
Horn_clauses
English-French_document_pairs
part
bilingual_corpora
fuzzy_syllogism
global_meaning
domain-specific_semantic_information
describes
amount
Turkish_dependency_treebank
cognitive_psychology
linguistic_PoS_tagger_and_chunker
does
patchy
full_scale_two-level_morphological_description
queries
single
Praguian_dependency-based_approach
preceding_words
machine_translation_outputs
commonsense_reasoning
build
translations
KL-ONE_style_representation
pieces
automatic_metrics
English_sentence_structure
parsing_data
achieving
concept
viewed
syntactic_behavior
alignment_adaptation_approach
Bayesian_semi-supervised_Chinese_word_segmentation_model
translation_framework
reflect
restricted_vocabulary
English,_Arabic_and_Spanish_lexicons
only
generates
dialogue_system
inescapable
interaction
superior
observed
multi-component_architecture
idiosyncrasies
block_selection_criteria
efficient,
unification-based_grammar_parsing
cooperative
speaker_adaptation_(SA)
Plume's_approach_to_parsing
decision_tree_based_approach
domain_independent_features
speeches
seeds
predicting_top-level_boundaries,
fundamental
content-independent_formalism
candidate
biomedical_and_linguistic_ontologies
derived_strings
text_understanding
multisentential and multi-paragraph explanations
exotic,
Korean_and_English_language_pairs
possible,
all
entity-oriented_parser
layout
DoPS_system
viewpoint
Hong
tree
directly
lemma-based_model
data_retrieval
an
test
translation_relation,
underspecified representations
IntEx_system
sounding
precision_rate
dictionaries_of_word_forms
hierarchy
target_corpus
email-threads
non-contiguous_phrases
comprising
character_bigrams
