which
approaches
practically_unsupervised_learning_method
level
ungrammatical input
interconnected
reasonably
tests
expert_systems
existence
exponential
incorporate
character
explanation_generation
survey
Head_Grammars
23,000
dialogue_corpora
entirely_data-driven_model_selection_procedure
mobile_military_command_and_control
version
rank
possible
bootstrapping_approach
concept-concept_matrix
attentional_structure_in_discourse
anaphoric_component
vector_space_model
structural_information
bearing
augmented_Friedman_-_Warren_algorithm
natural_language_environment
consequences
making
Japanese_script
similar
TL
then
revision_component
state-of-the-art_performance
semantic_interpretation
sets
phrase translations
Jiang
parser
theory
summary_generation
conceptually
shared_derivation_forest
28,449
KPSG
pragmatics_processing,
word_order
news_articles
translation_relation,
paraphrase_examples
framework
domain-independent_capabilities
generalizable_semantic_principles
word_sense_definitions
complex
evaluation_of_Natural_Language_systems
because
word-lemma_based_feature_function_models
TiMBL,
web
LMs
but
Combinatory_Categorial_Grammar_(CCG)_lexicon
discourse_task
parse_forest_representation
large-scale_knowledge_base
onto
classifier_assignment
spoken_language_technology
levels
lexical_conceptual_structure_(LCS)_representations
argued
participated
stored
generated
events
feature_structure-directed_generation,
OT
track
proper
linguistic_structure
utilized
output
arbitrarily
SVM
captures
single-strategy_parsers
coordinate_phrases
identification_of_paraphrases
non-terminal_symbol
strongly
speech_and_text-image_recognition
hidden_variables
terms
complicated
experimental
multiple_complementation_patterns
program
syntactic_priming
well_calibrated_probabilities
synonym relation
lexicalised
domain_entities
new_event_detection
lexical category ambiguity
natural_language_applications
Similarity-driven_Transfer_System_(SimTran),
model
description
genres
word_graph
associated
information_source
possible,
English-Chinese_parallel_corpora
definite_clause_grammars
statistical_methods
argument_frames
ambiguity
first
trained
display_of_graphical_information
subcategorization_acquisition
who
verb-noun_collocation_dictionary_for_Polish
comparable,_non-parallel_corpora
confidence
dictionaries_of_word_forms
called
ungrammatical segmentations
high-accuracy_word-level_alignment_models
domain_independent_features
~0.25%
RINA,
35.0%
word-aligned_corpora
attribute_sequences
CTL
modules
automatically
token_classification_task,
dedicated
supervised_and_unsupervised_methods
over
right-side dependencies
automatic_Q/A
MBR_decoders
statistical_MT_performance
source_dependency_parse
behavioral_patterns
unified
all
enough
closely
extracted_field
distributed_message-passing_infrastructure
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
real
pushdown_automaton
built
biomedical_text
localized_phrase-based_prediction_model
free_word_order
indeed
grammar_formalisms
annotate
predictably
-speaking
programming_language
published
measure
put
completeness
entirely
multilingually_aligned_wordnets
event
formal
related
richer
reversible
word-to-word_alignments
monolingual_and_bilingual_information
discourse_structure
SMT_models
hybrid_generator,
recent
feature_selection_methods
configurable
other
word_pairs
improve
representation_scheme
human_judgment
adopts
Topic_signatures
viz.
formal_intersections_of_FSAs
labels
simple
proposed
NLP_tasks
pronoun
deterministic_finite_automaton
deduced
efficiently
creation
standalone_system
triple
performance_improvement
must
class-oriented_framework
Japanese
IR
extraction_system
among
70%_precision
learners
Japanese_text_processing
speech_synthesis_systems
two-step_clustering_process
cannot
Temporal_Expression_Anchoror_(TEA),
newspaper text,
deadline
abstract_moves
machine_transliteration/backtransliteration
WSD_programs
threading_algorithm
smaller
knowledge_engineering
module
post-processing
German_pronouns
only
tagging_strategies
in-domain_corpus
mutual_information
modular
linguistic_objects
conceptual_system
highly_inflective_languages
Noun Classifier Associations (NCA)
phonological_system
grammatically_correct_input
neat_texts
Chinese_text
distance values
automatically_acquired_parallel_corpus
overt_case_markers
Information_Bottleneck
analogies
declarative
grammatical_gender
retrieval_effectiveness
phrase_chunking
semantic_composition
extract
cooccurrence
skips
spoken_language_understanding_system
grammatical_formalisms
PER
entailment_relations
2004)
segment_order-sensitive_methods
few
subtrees
attentional_state
method_to_automatically_acquire_paraphrases
log-linear_models
multi-component_architecture
interlingua
grammar_checker
gained
phrase_boundary_heuristics
semantic_verb_classes
antonymous_adjectives
significance
part_of_speech_(pos)_tagging
namely
utilizing
through
robust_generator
roots_words
resource
under
enhances
conceptual_operations
oriented
connectionist_(neural)_network
human
models
recognition
derivations
model_of_grammatical_processing
data
motivated
carry
cognitive_psychology
support
best
Bikel's_parser
experimental_evaluation
principle-based_theory
texts
benchmark_system
takes
out
CFG_parsers
this
anaphora_references
sequences
spatial_attributes
nouns
extraction
unification-based_grammatical_frameworks
database
pieces
implicitly
unpleasant
information_redundancy
(using
input_word
user_modeling
word_forms
ranking_learning_problem
well
hypotheses_graph
high-quality_data
translation_knowledge
verb_forms
tune
parallel_corpus
further
printed_text
Intra-sentential_quality
generation
Information_Extraction
non-terminals
allow
delimiters
strategies,
automated_interpretation
collection_of_dialog_motivators
probabilistic_spectral_mapping
citations,
writing
permitted
gene_and_protein_interactions
's
outperform
trainable_components
160
used
CriterionSM_Online_Essay_Evaluation_Service
development
CF_grammars
French
manner
story
whether
approach
Hong
agglutinative_language
logical_model
comprising
discourses
speech
text_applications
system_output
superordinate -hyponym relation,
method
after
lexical_substitutions
textual_domain,
Lucy
paper
Natural_Language_Processing_(NLP)_applications
concept-distance_measures
PAKTUS
interactive_question-answering_(Q/A)_system
empirical
Path-based_inference_rules
traditional_distributional_word-distance_measures
theoretical_linguistic_investigations
relations
summary
lexically-induced_relations
character_bigrams
exploratory_corpus_analysis
best-reported
priming
tree
identification_of_non-local_depenencies
PCFG-LA
chunking_performance
passives,
lexical_weighting
SRHs
hard decisions
circuit_specifications
field_structured_text
utterances
LFG
character-_and_word-segmented_data
evaluation_measures
temporal_relations
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
discriminative_log-linear_models
discovered
knowledge-based_mechanisms
logic,
represented
derivation
conditional_log-linear_model,
free_indexation
97.24%
speech_data
polarization
topic_signatures
automatic_alignments
word-dependent_substitution_costs
most
broad_coverage_lexicon
distinct
structure-sharing_of_graphs
unsupervised_training
exploit
portion
bilingual_dependency_relations
tools
answer/question_terms
natural_language_processing_(NLP)_systems
domain-specific_semantic_information
Longman_Dictionary_of_Contemporary_English
efficient
improving
O(n6)_time
collocations
Italian and English verb subcategorization frames (SCFs)
decoding
source_language
word-senses
natural_language_processing,
dictionary
translation_memory_system
automaton
resemble
40
semantic network
practical
performance
Arabic_word_segmentation_system
edit_distance
machine_translation_system
irrelevant
linguistic information,
language_processing_systems
many
Turkish_dependency_treebank
user-specified
verb
Languages
limited
program,
spoken_language
kind
spoken_multiparty_dialogue
move-tagged_abstracts
BLEU
trees
introduce
unambiguous_structures
TRDR_score
determiners
argumentation_system
pooling
architecture
thematic_grid_tagging,
language_identification
semantic-oriented_NLP_applications
word-sense_ambiguity
scf types
Japanese_Dictionary_Task_in_SENSEVAL2
answer_expressions
scratch
automatic_evaluation
test_corpora
heuristic_rules
classification_method
deviates
characterize
non-literal_aspects_of_communication
system's_output
HK-closed,
node-based_inference
SUN4
supervised_training_data
combines
marks
parallel_structures
articles
target_corpus
tie
core_modules
top-down_derivation
collected
inheritance
human-machine_interactions
stages
intelligent_mobile_agents
task-specific_language_development
(German-English,
constraint_system
classifier
leading
Japanese_verb_phrases
manually_segmented_corpus
domain_specific_terms
source of data
tasks
often
EM_algorithm
alignment
undisambiguated
expectation-maximization_(EM)_based_word-clustering_algorithm,
relative clauses
expected
should
processes
dialogue_acquisition_and_tracking_algorithm
syntactic_behavior
scfs
American Sign Language (ASL) animation
biomedical_and_linguistic_ontologies
architectural_modules
translation_images
lexicalized_structures
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
consists
treated
unequal
computational
and
Proposition_Bank_data
size
statistical_machine_translation_(MT)
considered
known
TAG
bare_slice_disambiguation
asymmetric,_or_directional,_relations
sentence-level_and_text-level_anaphora
well_calibrated_probabilities,
conventionally
unique
equivalences,
knowledge_sources
communicative_signals
our
domain-specific_(in-domain)_word_alignment
automated_evaluation_techniques,
dialogue_systems
correspond
lower
previous
French_tenses
language_modeling
straightforward
compact
statistical_alignment_models
abstractions
Expectation-Maximization_(EM)_algorithm
each
representation
satisfactorily
statistical_parser
rating
take
word_clusters
morphological_constructions
parallel_concordances
Message_Understanding_Conferences
parse
natural_language_interfaces
Memo-functions
structure_of_communicative_context
dictionary-based_word_vectors
transfer_approach
are
semantic_annotation
Chinese_words
Node-based_inference_rules
context-free_chart_parsing
natural_language_generation
surface_realizations
currently
referential_information
inferred
naming_conventions
typed_feature_structures
alleviate
marked
lexicons
word_significance
verbal_interactions
incorporates
incremental_probabilistic_parser
VSM_model
different
results
question/answer_pairs
explicit
ambiguities
originally
frames
MT
answer
still
email_communication
unsupervised_methods
sounding
hierarchies
heuristic_principles
polynomial_time_solution
question_phrases
itself
variable
97%
local_structure
discourse-relevant_purposes
per
unsupervised learning
PK-open,
test
enriching
model_theoretic_interpretation
Arabic_word_segmenter
Source_and_Target_languages
in-domain_word_alignment
rule-invocation_strategies
newspaper_corpus
(Biber,1993;
fragments
8000-word
flexible_parser
translation_candidates
inflected_forms
weather
interlingual_approach
source_and_target_language_sentences
lexical_affinity
prototype_system
data_representation
target
domain-specific_word_alignment
~
variant
state-of-the-art_coherence_model
vital
exactly
applications
English-French_document_pairs
large-vocabulary_CSR,
semantically_annotated_corpus
interfaces
traditional_knowledge-based_techniques
attentional_focus
fits
free-content
nature
discourse_context
multilingual,_multimedia_data
entity-based_representation
how
formal_analysis
laws
block_reordering
tailoring
includes
classifier_word
translation lexicons
pos_tag_ambiguity
syntactic_disambiguation
despite
declarative and imperative utterances,
independently trained models
memory-based_system
English-Japanese_machine_translation,
capture
data_representation_choice
named entities
(and
reduplications
model_checking
word_examples
HPSG_natural_language_system
distributional_approximation
spoken_corpora
included
Chinese_text_corpora
able
generalized_metaphor
while
text_processing_software
connectionist_component
interrogatives
addition
task-oriented_dialogs
hidden Markov models (HMM),
rate
instance,
implicit
Czech
HBG
question-focused_sentence_retrieval
syntactic_analyzer,
represent
plays
machine_translation_task
nodes
retrieve
within
machine_translation_output
multimodal_parsing_and_understanding
recordings
naturally
discourse_understanding_process
offers
contextual_similarity
time_exponential_on_the_size_of_the_grammar
multi-strategy_framework
providing
interactive_problem_solving
compactly
handle
relative_error_rate_reduction
protocol_analysis
speech_understanding
user_model
synonymous expressions
80.5%
syntax_proper
disjunctive_feature_structures
linguistic_theory
probabilistic_context-free_grammar
Sentence_boundary_detection
focus_of_attention
editor
multisentential and multi-paragraph explanations
partial_theories
Semantic_theories
Minimum_Bayes-Risk_(MBR)_decoding
upon
quantification_over_events
respect
tree-to-tree_translation
German
linguistic_processing
phrase-based_models
spoken_language_corpus
NP
Kullback-Leibler_distance,
necessary
comes
–
competitive
CSG
Wall_Street_Journal_treebank
decision_tree_based_approach
polysemous_word
exceeds
language_acquisition
could
natural_language_processing
defined
solution
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
definition_sentences
when
test_corpus
ranking_rules
knowledge
a
probabilistic_model
cue_phrases
methods
acquisition_of_word-semantic_information
SSTC
range_concatenation_languages_[RCL]
Large-scale_natural_language_generation
two-phase_shift-reduce_dependency_parser
structured_data
find
restricted_vocabulary
integrate
feature_vectors
initially
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
medium-length
laboratory_study
words
facilitate
hierarchical_lexicon
Conrath
consider
JAVELIN
exhibit
question-answering_NL_systems
extensive
paraphrases
Lexical-Functional_Grammars_(LFG)
coherence_assessment
event_structure
approximation
formal_definition
Intel_i860_chip
exotic,
word_tokens
LR-parser
alignment_adaptation_approach
vocabularies
flexible_parsing
NLP
MUC-6 and MUC-7 English NE tasks
text_classification_problems
smoothing
statistical_and_constraint-based_disambiguation
class
similarity
transformed
MeSH
field_structured_extraction_tasks,
application
domain_dependence
Augmented_Transition_Network
Chine_language
illustrated
recall,
habituality
small-scale
representation_tree
Japanese_natural_language_processing_studies
them
token-based_models
Comparator
guide
evaluation_measure
symbolic knowledge
largely
means
memory-based_learning_chunker
translation_accuracy
feature_functions
linguistic_annotation
TIPSTER_applications
referents
combine
[Zernik88],
dependencies
syntactic_descriptions
scripts
WordNet,
reflect
convey
similar_context_features
exploits
grammar_sensu_stricto
unsupervised_learning_method
lack
text-plan_input
general-purpose_NLP_components
word_vectors
research
VME_bus
context-free_parsing
research_articles
WH-questions
feature_structure_unification
existing_grammar
unification-based_grammar_parsing
Machine_transliteration/back-transliteration
lexical_and_syntactic_features
LFG_semantics
Systemic_grammar
case-based_reasoning
stack
whole
Kong
Human-Machine_Communication
proof procedure
linguistic_PoS_tagger_and_chunker
functions
)
wide
ability
user-directed_summaries
deterministic_grammar
Japanese_text
associative_relationships_between_verb_phrases
us
macro-average_F1
GPSG
uses
several
content_words
non-English_(Arabic)_stemmer
input_dataset
multidimensional_chart_parser
better
English
achieves
DARPA_Resource_Management_corpus
Penn_Treebank_data
89.75%
wordbreaks
dialog_systems
abstracts
principled
pronoun_"it"
certification
parser_for_non-configurational_languages
set
supports
presence
corpora
small
strictly_syntactic_cross-serial_agreement
certain
created
documents_with_signal_content
virtual_reality_3D_scene_modeling_software
resource-frugal_approach
113K
written_English
novel
quantifying_noun_groups
expensive
groupings
analysis
fine-grained_grammatical_categories
relevance
rhetorical_patterns
adopt
MT-based_paraphrasing_technique
parse_tree
text_mining_method
statistical_machine_translation
exact_match_accuracy
predictive_questioning
seeds
semantic_role_labeling
translation_data
maximum_entropy_word_alignment_algorithm
Japanese_sentence_analyses
sentence_plan
to
semantic_caseframe_instantiation
superior
Graphical_User_Interface_(GUI)_functions
speech_recognition_hypotheses_(SRH)
adding
word-sense_disambiguation_algorithm
performs
2491
two
Korean
dramatically
dialog_management_system
parsing_data
abduction
song_lyrics
77%
morphological_component
combining
ad
improves
from
linguistic_domain
decision-making
probabilistic context-free grammars
rather
induced
particular
Penn_Treebank_Corpus
feature_structures
areas
types
selected
segment-based_approach
cognitively_well-motivated_interfaces
English_sentence_structure
available
overall
referential_elements
transcribing
deals
coherence
corpus-based sample
define
parse trees
domain_knowledge
automatic_segmentation
summations
1.6
effectiveness
revealed
root_word_lexicon
flexible,
procedural
text
context_free_languages
customized
selecting
introduced
aid
distributions
will
complete
textual_corpus
queries
comparison
average
speech_processing,
alternative
textual_representation
would
heuristic_learning
supported
domain_independent_model
ranking
ellipsis_resolution
found
repository
packed
transliteration_process
extended_domain_of_locality_(EDOL)
syntax,
syntactic_analysis
multi-pathway_MT_architecture_design
lexical_database
domain-independent
departure
biases
derivational_history
weaknesses,
unsupervised_learning
abductive_inference
cooperative
adapted
confidence_measures
language
strength_of_potential_antecedence
polysemy
ill-formed_input
problematic
ambiguity_packing_and_stochastic_disambiguation_techniques
mappings
computational_problems
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
decision_tree
operates
CCLINC_Korean-to-English_translation_system
Tree_Adjoining_Grammars
context-free_languages
ordinary
linguistic_parser/generator
transcription_errors
unification-based_grammar
at
sense_priors
retrieval_approach
expectations,
edges
efficiency
syntax-based_statistical_machine_translation_system
met
weight
EDOL
answer_resolution_algorithm
additional
node_structures
control_structure
categorization_task,
maximization
detect
distributional_hypothesis
log-linear and linear interpolation,
model_design
part-of-speech_annotation
unsupervised_automatic_acquisition
dialogue_interaction
5%
tag
morpho-syntactic_and_semantic_characteristics
parse_forest
linguistically
present
needed
general_linguistic_knowledge
model_parameters
parsing_algorithm
simple_clausal_structures
logical_well-formedness_conditions
OCR
speech_processing
another
etc.,
correlate
lower_bound_estimation
can
general_domains
kernel_functions
formulate
PCFG-LA model
centering approach
Wizard_of_Oz_technique
Japanese_patent_claim_sentences
grammatical_relations
direct_orthographical_mapping_(DOM)
Words
AI_text_generation
spoken_dialogue
core
showing
databases
Boolean_matrix_multiplication_(BMM)
severely
relatively
HMM_and_Max-ent_models
relying
dialog_manager,
CRF
rule-based_systems
translations
training_and_test_data
traditional_deterministic_parsers
recognition_network
topic_signature
coarse-level_clustering
algorithm_for_translation_lexicon_acquisition_(SABLE),
126,610
word_string
train
dependency_structure
parsed
verbs
6
Mimo_formalism
translation_framework
multiple_parsing_strategies,
robustness
error_correction
appropriate
addressed
underpinning,
ideograms
success,
Slavic language
frequency_counts
(
likelihood
vast
statistical_techniques
words,
keep
conversation_analysis
inherent
79.1%
regular_languages
interpretation
meet
unannotated_text
text-to-speech_conversion_system
discovering_parallel_sentences
along
individual
graceful
visualization_method,
named_entity_(NE)_recognition_(NER)_system
automatic_extraction
starting
lexicologists
Chinese_word_segmenter
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
discusses
full_scale_two-level_morphological_description
elaborated
represents
contributes
instead
SI_corpus
song_lyric_document
Chat-80
quantified_sentences,
1983)
fundamentally
thesaurus
ILIMP
modified
source_language_text
A_deterministic_parser
path_values
sparsity_of_the_feature_space
Chinese_punctuation_marks
IBM_models
error-correction_rules
substantial
corpus_data
semantic_information
implementation
Basque
SCFs_distributions
segment_boundaries
independently
provides
referring_expressions
definitions
constraint
captured
Arabic-English
opposed
viewed
compositional_interpretation
consistency_problem
deep_processing
conceptual_level
German_text_corpora
gold-standard_parse_trees
explore
Translations
natural_language_processing_systems
statistics
rule-based_heuristics
probabilistic_translation_models
Boolean_conditions
being
current
alphabets
syntactic_and_semantic_dependencies
written
determination
sentence_extraction
chunking_results
meaning-entailing_substitutability
search engine
resolves
Polymorphemic_stems
subcategorization_frame_(SCF)
text-level_anaphora
bilingual_corpora
discriminative_training_criterion
requirements
agglutinating_free_word_order_language
bigram_back-off_language_models
cognito-pragmatic
inferential component
credibility_indicators
s-VSM_model
co-occurrence_distribution
semantic constraints
temporal_anaphora_phenomena
treebank
designed
usually
finite-state_approximation
graphic_interpretation_system
natural_language_text
language processing pipeline
LT_(LF)
been
use
input
fuzzy_quantifiers
shift-reduce_dependency_parsers
based
latent_variable
compositional_syntax_rules
improved
Statistical_Machine_Translation_(SMT)
chunks_of_words
potential
baseline_system
large-scale
studied
evaluated
al.
Acoustic_modeling
log-linear_(maximum-entropy)_models
parsing_method
word-lemma_model
context
write
information_retrieval_techniques
categories
algorithm
existing
mathematical_expressions
mainly
paraphrasing_method
extraction_tool
English-Chinese_bitexts
around
lexical_approaches
do
weighted_finite-state_device
training_and_testing_factors
accuracy_rate
automatic_evaluations
system_response
antecedence_recovery
machine translation (MT) systems
i/l:::'=--~--
Grosz-Sidner-style_focus_model
Generalized_Alignment
(Karttunen,
never
serves
tagging
as
numbers
HMM_with_Gaussian_mixture_observation_densities
well-written_discourse
recently
during
correlation_measure
linguistic_representation
intense
presumed
check
temporal_logic_CTL
dependency_parsing
Topic_Detection_and_Tracking_tasks
developed,
affix_removal
on-line_encyclopedias_and_dictionaries
class_of_languages
conjunction
system
English/Chinese_and_English/Japanese_language_pairs
pair
Chinese_word_sense_disambiguation_model
formalisms
task_representation
generative_probabilistic_model
their
evaluation_metrics
Chinese_newspapers
requires
features
Minimum_Bayes-Risk_framework
produces
worse
higher
WWER
word-based_alignments
phrase_structure_grammar
segmentation
log(d)_overheads
substitutions
ambiguous
dialog_motivators
described
semantics
zero pronouns
processing
linguistic_phenomena
frequency_profiles
clauses
combined
AS-closed,
Coedition
finite
syntactic_ambiguity_resolution
entity-oriented_parser
ways
pruning_criteria
statistical_learning_mechanisms
MT_systems
cooperative_responses
citing
parsed_corpus
linguistic_expressiveness
Machine_Translation_(MT)_systems
HTML_documents
hierarchically-structured_terminology
lemma-based_approach
structure
cooccurrence_patterns
SLS_systems
multiple_and_nested_interactions
procedures
morphological_analysis_problem
devised
rely
machine_translation_(MT)_evaluation
show
culling
final
fake
ARPA_large-vocabulary_CSR_corpora
structured_databases
proper_names
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
natural_language
ccg_supertagging
building
differ
easy
where
structured
base_parser,
EUROPARL_corpus
predicting
common
supervised_learning
lexical_items
appear
legal_terminology
spatial_descriptions
components
obtain
parse-trees
text_generation
written_and_spoken_language
continuous_density_HMM
world
training_material
personal_names,
MBR_decoding
part-of-speech_tagging,
hierarchy
<
comparative
formal_language
intelligibility
"black-box"_methodology
automatic_abstracting_systems,
up
shallow_linguistic_features
restrictive_statements
contains
category_labels
'
DoPS_system
multi-tagging_approach
demonstrated
deaf
query_optimisation
MT_evaluation_techniques
basic
ICICLE_system
specified
widely
human_cognition
surface_forms
suffix_array-based_data_structure
they
bag-of-words_methods
CSR
assignments
conventional_statistical_methods
grammatical_frameworks
answer_candidates
runs
word_sense_disambiguation
punctuation
automatic_discovery_of_text
modular_architecture
electronic_newsgroup_discussions
added
classifiers
user_knowledge_modeling_architecture
involve
incorporating
superordinate_substitution
multilingual_speech_and_language_applications
users
tend
usefully
logic
small,_domain-specific_corpus
operate
extended
multilingual_TIPSTER_user_interfaces
dependency_tree
decision_list
APT
resolution_component
referential_properties_of_noun_phrases
qualitative_spatial_constraints
macro-average_F1_performance
Czech-English_statistical_machine_translation_system
agenda-based_scheduling_parser
or
speaker-independent_(SI)_training
unrestricted_texts
acquire
little
search
word_senses
translation
technique
combination_methods
Task-based_evaluation
Polish
syntactically_motivated_relations
morphological_analysis
grammar_coverage_problems
function_words
reference
polynomial_time
essays
connectivity
incorporated
auxiliary
computational_complexity
systems
integrates
phrasal_patterns
JAVELIN_system
minimizes
restricted_natural_language
syntactic_structure_information
feature-based_relation_extraction
limits
inevitable
newspaper texts
place
conditional_loglinear_models
yield
linguistic_information
sublanguage,
relationship
four
Korean_phonological_knowledge_base_system
phrase
of
fewer
CMU
segments
augment
second_language_and_cognitive_skill_acquisition
decision_tree_architecture
temporal_adverbials
MeSH_relations
ATIS_(Air_Travel_Information_System)_domain
evidence
an
Gaussian_mixture
machine_learning_approach
useful
inference_types
pronouns
occur
KDS
translation_paths
1983;
context-sensitive,_phrase_structure_grammar
shows
cross-lingual_comparisons
information_flow
internal_and_contextual_information
multi-strategy_approach
address
statistical_model
regular_expressions
primarily
concept
thus
MORphological_PArser_MORPA
approximation_error
interaction
event_terms
classification-based_representation_techniques
direct
we
tagged
hierarchical_(or_other_types_of)_relations
compounds
parallel_corpora
gives
Horn_clauses
ambiguity_resolution
listener
systemic_grammar
Prolog
generator
automatically,
discourse_segmentation
analyses_for_large_treebank_grammars
influence
parsing_strategies
defeasibility
role
semantic_criterion
representations
Verbmobil_task
optimum_iteration_number
English,_Arabic_and_Spanish_lexicons
educational_tool,
labeled_directed_graph
syntactic_information
language_independent_modules
language_processing_tasks
Chinese_language,
topic_information
positive_feature_vectors
towards
performing
corpus-based_approach
candidates
descriptions
word-based_system
sentence_analysis
verb_form_meanings,
inference
paraphrase
machine
labelled_bracket_F-score
P-CFG
disjunctions
convolution_kernel
Metagrammatical_formalisms
preceding_words
benefit
natural_language_interface
baseline
MSR- closed
reliable
scoring
adequate
segmentation_standards
co-occurrence_similarities
GUIs
than
meanings
non-contiguous_phrases
polarity-tagged_corpus
answers
semantic_equivalence
IE-enhanced_text_browsers
aligned_bilingual_corpus
paraphrase_class
characterized
temporal_connective
moment
domains
parsing_process
InfoMagnets
young
Comparator_software
alignment_errors
grammaticality
natural_language_generation_community
robust
interactions
rule-based_learning_algorithm,
decision-tree_approach
objects
translation_hypotheses
Markov_model
TAGs
calculus
case-based_MT_(CBMT)
claimed
Nagao,1993;
SMT
Paramax_spoken_language_understanding_system
ungrammatical_input
genre-specific_regularities
analyze
HMM-based_chunk_tagger,
unknown_word
Korean_and_English_language_pairs
lexical_unknown,
million
prominence
handling
predictive_performance
Thai_key_prediction
original
deterministic_parsers
rankings
superset_of_L
event_map
gave
questions
KL-Conc,
volume
various
intuitive
same
mapped
improvements
Q/A
grs
genre
Procedural_Systemic_Grammar
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
dependency_structures
estimations
best-path,_bottom-up,_deterministic_parser
Natural_Language_Processing_(NLP)_system
backwards_transliterations
implements
Child_Language_Data_Exchange_System_(CHILDES)
speech_recognition
word_significance_(weights)
utterance_classification
seed_sentences
may
indexing
unigram
abstraction
applying
traditional
lattice-based_approach
information
portability
required
HK-open,
constructs
Smadja,1993)
introduction
lexicalized_grammar
probability-based_scoring_function
analyses
provide
permit
significantly
histogram
expanded
feature_weighting_and_selection_function
translation_lexicon
contexts
vectors_representing_morpho-syntactic_properties
recognition_technology
audio_and_scanned_image_data
working
though
parsing
adaptive_learning_procedure
coherent
labeled_data
multiple
time
respectively
candidate
learn
forecasts
distributional_concept-distance_measures
pipelined_NLG_architecture,
chunking
semantically_related_words
filled
probabilistic_context-free_grammars
single
theories
LTAG
SVMs
equivalent
range_concatenation_grammar_[RCG]_formalism
dimensionalized_space
create
hierarchical_relations
underspecified_semantic_representation_(USR)
question-answer_pairs
distinguish
Dutch
ellipsis
experiments:
help
developed
RCL_parser
stems
grammatical_number
(for
acquiring_adjectival_subcategorization_frames
shallow_mapping
expletive_occurrences
outperforms
Presentor
finite-state_models
Automatic_Speech_Recognition_technology
M
PropBank
manually_sense-tagged_data
Syllogistic_reasoning_with_dispositions
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
sentiment_vector_space_model_(s-VSM)
word_n-grams
typicality
four-participants_face-to-face_meetings
(P05-1076.10
word_segmentation
patchy
natural_language_understanding
language_tutoring_application
spelling-checkers
decision_strategies
identify
documents
hardware_designs
syntactic_categories
the
between
user
unification-based_parsing
phone_n-gram_model
Prague_Dependency_Treebank
properties
constituent_parts
human_transcriptions
ambiguous wordform,
speed
increased
Plume
dependency_relation_paths
ensemble_learning_approach
positive_and_negative_definition_examples
difficult
multi-strategy_and_multi-source_approach_to_question_answering
emoticons
account
ported
Term_similarities
share
depending
n-gram_transliteration_model_(n-gram_TM),
Nigam
machine_learning_techniques
MWEs
algorithms
certainty_conditions
human_understanding_of_natural_language
methodology
adjacent
meta-inference_types
latent_variable_model
segmented_strings
conceptual
dependency_relations
clustering_methods
specifications
KL-ONE-like_knowledge_representation_systems
subordinate_clause
computational_linguistics
top_human-ranked_sentence_plan
acquired
Japanese_sentence_structure
provided
Turkish_word_structures
offer
distribution
semantically_rich,_large-scale_knowledge_bases
knowledge-based_generation_systems
data_representations
word_sense_disambiguation_(WSD)_systems
CCR_formalism
determined
morphology
CFG_parser
knowledge-based_and_random_selection_procedures
et
corpus-based_method
LEXSYS
English_Wikipedia,
WordNet
construction-specific_approach
complex_sentences
generative_history-based_latent_variable_model
randomly
conditioning variables
parser_MDCC
passed
n-gram_statistics
trainable_sentence_planner
segment
integration
pairs
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
constitute
test_language
relational_database
word-trigram_recognition
large-vocabulary_speech_recognition
embodied
7.5%
aims
computational_lexicon
usual
sentence_plans
that
Mimo,
entities
expression
noun
incrementally
helping
unsupervised_learning_approach
English,
embodied_conversational_agent
semantic_expressibility
previously
underspecified representations
much-studied
board
discourse_connectives
mismatch_resolution_scheme
marine
accuracy
series
distributional_word_feature_vectors
natural_language_interpretation
RAREAS
POS_learning
SI recognition,
discourse_constraint
produced
purpose
disambiguation_algorithms
verb_final_language
is
also
tractable
Recognition_of_proper_nouns
was
reduplication
context-free_phrase_structure_rules
semantics_directed_approach
enumeration
terminology_structuring
error_correction_mechanisms
TAP-XL_Automated_Analyst's_Assistant
entropy
live_closed_captions
handles
occurring
unsegmented_Arabic_corpus
integrating
varied
induced_model
machine-readable_resources
Bulgarian,
interpolation_methods,
particularly
select
Graph_unification
training_examples
transliteration/backtransliteration_experiments
training_(reference)_speaker
capitalization
permits
interface
threads
unlexicalized_PCFG_parser
averaging
global_meaning
new_sublanguage
MT_output
word_error_rate
abstract_flat_syntactic_representations,_LFG_f-structures,
one
frequency_classes
Taiwan_Child_Language_Corpus
lexical,_syntactic,_semantic,_and_structural_information
student
embedded
converge
express
presuppositional_nature
using
transliteration
in
choose
lexical_methods
sense_resolution
via
Word_Sketch_Engine,
less
implemented
easy-to-implement
Web
source_interval_projections
distance
automatic
FDA
incremental_description_refinement
spectral_clustering_based_approach
vocabulary
forward_pass,
transformation_model
presented
20k
generate
language_learning_model
1
reestimation_formulas
155
even
stemming_model
associative_relationship
presented,
salience
layout
searched
vagueness
concepts
military_and_civilian_systems
such
(konpyuutaa)
Unification_Categorial_Grammar_(UCG)
feature-based_word_grammar
predicate-argument_structures
coherent_text
nominal_constituents
apartment
training_method
manually_segmented_Arabic_corpus
JINTACCS_messages
Definite_Clause_Grammar_techniques
decision_tree_learning
unit
describe
hardness
blocks
large
text-to-speech_form
speaker_adaptation_(SA)
Praguian_dependency-based_approach
linguistic_introspection
formulated
paraphrase_classification_accuracy
Bayesian_learning
produce
integral
natural language interfaces
accuracies
not
including
indices
management_of_uncertainty
numerous
--
unknown_words
word_alignment
Hidden_Markov_Model
extracted
Koskenniemi,
instance
expected_(grammatical)_sentences
ambiguity_representations
arbitrary,
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
language-independent_system
monolingual dependency parse
blog_posts
inescapable
inflection
MWEs_database
reduced
pronoun_resolution
phrases
commonly
different-quality_references
cross-entropy
phrase-based_unigram_model
times
document-oriented_applications
statistical_parameters
Turkish
full_parsing
word_error_rate_(WER)
gaps
resolve
understanding
begin
expectations
construct
suitable
statistical_approaches,
subset
enhance
content-independent_formalism
accurate
probabilistic_synchronous_dependency_insertion_grammar
dynamic_language_model_combination
probability_estimation
members
100,000
training
spontaneous_speech
SRI_toolkit
ambiguous_word
developing
taxonomic_similarity
000
12.5%
automatic_evaluation_measures
dialog_schemata
bilingual_dictionary_coverage
(called
indirectly
verbal_and_nonverbal_grounding_acts
lexical_similarity
precision
replete
text collections
errors
speech_and_text_image_processing
compete
decision-tree_classifier
discourse
parallel_data
English-Japanese,
performed
linguistic_and_non-linguistic_knowledge
analyst
blackboard-like_architecture
high
be
formatted_weather_data
hypothesize
HBG_model
0(n)_time
MT_evaluation
single-snippet_answers
disambiguation_tool
techniques
tool
term_aggregation_system
structural_and_lexical_dependencies
dictionary_word_sense_definitions
NL_evaluations
string_similarity
pattern
utterance
comprehensive
2.284
fuzzy_quantifier
human_data
conversation_transcripts
word-based_models
derived_words
domains:
predicative_information
voice_input
parse_trees
meaning
personal_computers
consisting
deductive_approach
HDAGs
annotation
operational_foreign_language_tutoring
patterns
dependency-based_grammar_model
computational_theory
block_selection_criteria
ASR_output
context-free_phrase-structure_grammar
modeling
discourse_relations
PoS-tag_feature_function
specialized_parsing_techniques
verb_semantics
non-configurational_languages
concrete_noun
compared
denotational_semantics
flexibilities
subset_of_logic
fourteen
predominant_senses
given
declarative_languages
need
XTAG
syntactic_structure_features
IBM_translation_models
describes
morpheme_sequence
clustering_and_filtering_processes
noun_phrase_chunks
logical_formulas
task-specific_domain_knowledge
electronic_discussions
evaluation
require
large_Czech_MWE_database
NL
sentences
directionality
predicting_top-level_boundaries,
tree-bank
scruffy_texts
uniform_processing
sentence
grammatical_sentences
maintains
according
probabilities
tagger
good,
idiosyncracies
dynamic_programming
word_clustering
advantages
AI_problem_solving_techniques
part_of_speech_information
sides
recognition_of_extra-grammatical_input
Japanese_character_strings
MT,
prosodic
syntax-based_constraint
vocabulary),
real-world entities
Information_extraction_techniques
language_(L0)
[ANA]
shallow_techniques
linguistic_resources
unadulterated
answer_extraction
suggests
impacts
Combination_methods
statistical_machine_translation_(SMT)
English_questions
identifying
sharing
stochastic,_graph-based_method
explanation_system
Cooperative_Model
quality
crossing_liaisons
human language learners,
firmly
Spoken_Language_Systems_(SLS)
word_segmentation_problem
topic
rank,
on
speeches
planning-based_architecture
reference_sets
machine-readable_dictionaries_(MRD's)
has
advances
robust---an
relied
made
target_vocabulary
lemma-based_model
idiosyncrasies
analytical_components
honorifics
linguistic_concepts
demonstrative_expressions
sentence-level_semantic_equivalence_classification
syntax_directed_approach
linguistic_structures
subcategorization_frames
error_rate
grammar
much
pharmaceutical news archive
demonstrative_forms_and_functions
relation extraction
bibliographic
magnitude
into
expressed
segmentation bakeoff
probabilistic_finite_automaton
format
example
n-best_speech/language_integration_architecture
comparable
n-ary_relations
robust_explanation_system
text,
Penn_discourse_annotation
together
spoken_dialogue_systems
have
way
temporal_expressions
classified
declarative_formalism
computed
SCFs
component
psycholinguistic_literature
for
carried
agreement
contain
text_model
chart-based_phrase_structure_parsing
voice_interactive_system
statistical_translation_model
email_conversation
annotating_scheme
viewpoint
Arabic
problems
fast,
by
words_with_multiple_meanings
retrieval
with
feedback
problem
EM-algorithm
what
syntax
Korean-to-Japanese_dictionary
support_vector_machine
bootstrap
IR,
precision_rate
sense
labeled
target_document
Bayesian_semi-supervised_Chinese_word_segmentation_model
types_of_knowledge
examples
aware
probabilistic_finite_automata
ECA
resulting
beam-search_decoder
sense-tagged_training_data
scenario_templates
valuable
information_extraction_tasks
addressee_identification
Japanese-English_translation,
associative_similarity
relevant
placement
training_techniques
containing
machine_translation_pipeline
summing
F-measures
Japanese_language_dictionary
BMM_algorithm
extensively
Penn_WSJ
software_library
it,
computational_model
effectively
spoken_language_understanding
CFG filter
recognizing
multilingual_input
projecting
treat
draws
constructed
recognizer
arguments
subpredicates
statistical_models
semantic_representation
out-of-domain_corpus
probabilistic_context-free_grammar_(PCFG)
word's
priors
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
co-occurrence_patterns
were
answering_agents
trend
languages
human_transcription
direction-giving_task
pronominalization,
computational_methods
critical_discussion
dialogue
body
automatic_language_identification
system_performance
appears
Dutch_Senseval-2_test_data
achieving
either
generate)
generates
efficient,
Discourse_Representation_Theory
lexical_hierarchy
Machine_Translation
DRT
AS-open,
parsing-based_NE_rules
judicious
defeat_rules
semantic_distance
minor
unsegmented_corpus
clues
computationally
reference_model
essential
domain
discourse_processing
training_data
argument_structures
user_interface_styles_or_conventions
hard_problems
estimate
Chinese_text_input
"glue_language"
construction
corpus_text
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
Plume's_approach_to_parsing
LSA-based_and_the_cooccurrence-based_word_vectors
automatic_estimation_method
following
phrase_translations
extracts
Generalized_Quantifier_approach
task
finite-state_methods
left_corner_parsing_algorithm
discursive_usage
senses
discourse segment,
continuous_speech_recognition_(CSR)_techniques
needs
binary_relational_calculus_notation
lexico-syntactic_knowledge
SVM_learning
QA_system
analytical_inverses
observed
indicators
lexical_and_syntactical_variation
Czech_WordNet
textual
these
Chinese_punctuation_marks,
graphical_model
applied
problem,
PK-closed,
compositional_approaches,
every
dynamic_combiner
duration_model
extracted_fields
corpus
some
type
transition_graphs
traditional_MT_architectural_designs
missing_words
textual_corpora
cepstrum-based_features
substrings
independent_classifiers
spelling_correction
text_corpus
greatly
useful_terms
does
term_extraction
word-sense_disambiguation_systems,
digital_learning
F-measure
attributes
helpful
raw_text
training_speakers
outputs
own
translation_performance
vectors
newswire_texts
manual_feature_selection
software
improvement
kinds
semantic
morphological_and_syntactic_information
structured_natural_language_data
HDAG_Kernel
characters-based_Chinese_collocation_system
consist
Arabic_information_retrieval
highly
so
alternative_markers
against
retrieval_performance
STRAND
unification
WSD_task
written_texts
encodes
German_corpus
joint_model
official_rankings
ungrammatical_structures,
NLP_system
reasoning_with_dispositions
semantic_constraints
subcategorization_classes
Path-based_inference
amounts
training_resources
character_and_word_error_rate
text_processors
generators
-
unlexicalized_parser
topics
computational_semantic_analyses
(Bikel,
learned
text_processing
about
87.5%
sentence_retrieval_problem,
syntactic_cues
evaluation_method
industry_watch
ranking_algorithm
trajectory
computer_text_generation_system
data_retrieval
valid
focussed
word_sense_disambiguation_(WSD)
linguistic rules
candidate_parses
arbitrary
Japanese_unknown_words
semantic_domain_models
powerful
advantage
primitive_Optimality_Theory_(OTP),
determining
readily
Situation_Theory
aids
statistical_alignment_techniques
there
language_model
tutorial_dialogue
statistical_analysis
advertisements
derived
normal
IE_module
both
shared_lexical_information
references
focus
Dialogue_strategies
pivot
noun_WSD_problems
LM
SL
translates
relative_frequency_of_occurrence
monolingual_parallel_corpora
theory_of_attention,_intention,_and_aggregation_of_utterances
proposition
Log-linear_models
defeasible_reasoning
summarization
depend
semantic_role_labeling,
GLOSSER
manual_transcription
lend
generative_model,
gain
dictionaries
good
intractability
augmented
clusters
test_set
correctness
specific_heuristics
unification-based_grammar_formalism
natural_sublanguages
suffix_analysis
translation_lexicons
topical report,
spoken_dialogue_system
its
TV_shows
standard
speech-based_Information_Retrieval_(IR)
email-threads
reduce
author
constraining
finding
EBMT
ranking_problems
Construct_Algebra
formulas
decision_trees
robustness_problems
regarded
textual_credibility_indicators
binary_relations
text_understanding
morphological_analyzer
tenses
semantically_unmarked_term
functional_structure
scientific
hoc
statistical_information
projection_of_structures
important
explicitly
compression_ratio
bit-vector_operations
MT_system
constructing
whose
any
graph_transformations
fuzzy_syllogism
unless
data_objects
remains
variety
compositionality
stereotyped_text_structure
result
Spelling-checkers
run
lexicon
become
topical_blog_post_retrieval
constructions
error
parsing_technique
capability
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
filter
RCL_parsers
Wall_Street_Journal_articles
ranks
maximum_likelihood_method
restricted_subset
LCS_representations
yields
described,
syntactic_coverage
disambiguate
access
assigning
basis
machine_translation
language_pairs
linear_logic
order
KL-ONE_style_representation
commonsense_reasoning
equivalence
comma_checker
taggers
achieved
CFG_parsing
Named_Entity_(NE)_tagging
generic
boosting_approach
discourse_copying_algorithm
collecting
elementary_structures
sentence_co-occurrences
bottom-up_pattern-matching_parser
terms,
wildcards
nominals
corresponding
names
encyclopedia,
simplify
attractive
hubs
metaphors
English text
category
space
children
bit-vector-based_CKY-style_parser
phrase-based_statistical_machine_translation_method,
constituent_structure_trees
more
generation_problem
semantic_analyzer
Southern_Min_Chinese
strong
language_functionalities
dialogue_system
log-linear_block_bigram_model
new
obtained
log-linear_combination
hypothesis
compare
subcategorization_cues
requiring
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
discourse-level construct
Name List,
new_domain
cooccurrence_statistics
unification-based_linguistic_descriptions
(e.g.
control
very
sentential_paraphrases
relative
entailment_acquisition
general_and_domain_corpora
formalising
attain
practice,
evaluating
"one-time_look_up"_method
statistical_profile
did
allows
estimated
synchronous dependency parser
mapping_score
context-free_grammars
learning_algorithm
natural_language_system
annotation_scheme
running
limitations
intentions
fundamental
preceeding
ASR
grammars
pronoun_il
discontinuous_constituents
automatic_metrics
formalism
NP-_and_non-NP-antecedents
hand-crafted_template-based_or_rule-based_approaches
Named_Entity_task
human_plausible_reasoning
Isomorphic Grammars
HMM_training
logical_form_language
hidden-variable assignments:
unsupervised_algorithm
preference
unseen_data
build
Collins_(2000)_reranker
collection_of_relations_and_operations
Xerox_PARC
semi-supervised_methods
keywords
sequential_models
deal
ccg_parsing
interpretation_and_generation_of_natural_language
coarse-grained_concepts,
bilingual_parallel_corpus
house,
NP-complete
anaphora
employing
oral_communication
rule-based_translation_systems
open-domain_question_answering
lexical_coverage
TIPSTER_Architecture_specification
significant
semantic_relations
paraphrasing
CoNLL_2008_shared_task
graph
parts of speech
conjuncts
fully-connected_first-order_statistical_class_grammar
Node-based_inference
character_types
proportion_problem
parse_record
Dictionary_construction,
WSD_models
genetic_search
translation_quality
language_modeling_tasks
IE_paradigm
make
goal
process
Japanese_parsers
inflow
allowing
transfer_phase
synthesizes
decoding_strategy
generation_system
stochastic_output_selection
KL-ONE
dynamic_programming_(DP)
HPSG
purposes
word
scope_ambiguity
POS tags in English,
interpret
saturation
syntactic_analysis_system
part
linear-chain_conditional_random_field_(CRF)
evaluate
database_query_application
CFG_rules
surface_representation
known_deterministic_parser
epistemological_level
target speaker
full_NPs
beyond
coordinations
maximum-entropy_model
Korean-English_translation
seem
generative_model
analysis_mechanism
makes
time_O(|G||w|3-e)
(in
bilingual_dictionaries
modification_probabilities
transfer_component
shown
achieve
reduced_IL_formulae
extracting_subcategorization_frames
loss_functions
units
abstract
temporary_belief
number
information_extraction_system
large_corpora
f-structures
weights
dialog_model
operational_semantics
generalized_translation_knowledge
domain-specific_translation_lexicons
generalized_metaphor_mappings
parse_reduction
graphics_displays
dialogue_translation_system
drawn
crossed_serial_dependencies
DARPA_Spoken_Language_Systems_(SLS)_program
tracks
element
adaptation
text_browser
"conventional"_context-free_morphological_grammar
statistical_method
effective
analysed
subcategorization_dictionary
prior_knowledge
utilizes
thesaurus_construction
critical
(from
apply
involves
overcome
IntEx_system
speaker
Conceptual_Dependency_Theory
SMT_research_community
surface_English
training_corpus
derived_strings
tree_adjoining_grammar
strengths
bilingual_material
limited-domain_spoken-language_task
intentional_structure
information workers
done
predicate_calculus_notation
method_of_analyzing_metaphors
CAS
Korean-to-English_and_a_Japanese-to-English_dictionary
discourse_level
WordNet-based_measures,
mixture
work
pronominal_anaphora_resolution_module
formalization
common_text_processing_modules
MSR-open
query_terms
probabilistic_Horn_clauses
metric
rules
lexical_translations
syntactico-semantic_(tectogrammatical)_annotation
feature-based relation extraction
cohesive text
phonetic_recognition
real-valued_features
amount
directly
agglutinative_languages
nominal_compounds
derived_string
sometimes
special
sentences,
agree
information_extraction_techniques
natural_languages
excluded
machine_translation_outputs
describing
biological_entities
predictions
larger
phone-string_classifier
unsupervised_learning_algorithm
resolving
word-based_collocational_properties
general
it
challenges
faced
like
