""
""CatVar""
""I05-3016.13
"enact"
"enforce"
"textual
%
',
's
(
(1)
(89.1%
(96%)
(CEA)
(CMs)
(DATR)
(EM)
(GTPC)
(I'KTN)
(IV)
(LFG),
(LSA),
(ME)
(MEMT),
(MERT)
(MRDs)
(MT)
(MWE)
(NEE)
(NLP),
(P98-2175.24
(PAS's)
(Portuguese)
(SIDGrid)
(WSD)
(bitexts)
(both
(e.g.
(e.g.,
(of
(uniform
(whose
)
/baseNP
0.6%
1
1,000
1.3M
10
10%
10,000
10.75%
100%
100-
1000
102,846
117,000
1200
126
146
15,000
17
175
18.5%
1947
1998
2
2002
2004
24]
28.29%
3
30
33.926
35
35,000
39,000
4
40,000
450
499
5.000
50
500,000
56.88%
62%
7
71.16%
71.81%
74%
77-80%
78.43
8,
80%
84%
87%
99%
=
A
AI
ATIS
Accuracy
Accurate
Achilles,
Acquiring
Acquisition
AdaBoost
Adaptation
Advanced
Aided
Algorithm
Algorithms
Alias
Alignment
Amharic
An
Analyses
Analysis
Analyzer
Anaphora_resolution
Ancestor
And
Application
Applied
Approach
Arabic
Arabic-
Architecture
As
Association
Augmenting
Automatic
Automatic_Evaluation
BLEU,
BNCL08-1115.36
Bank
Based
Bayesian
Between
Bilingual
Biomedical
Brants
British
Brown_Corpus
Brown_corpus
By
CELEX
CLEF
CRF
CRF_models
CSR
Case-
Case_Study
Categorial_Grammar
Categorization
Character
Charniak
Chi-square
Chinese
Chinese word segmentation
Chinese_Word_Segmentation
Church's
Classification
Classifier
Co-occurrence
Cohesion
Collection
Collocation
Combinations
Combinatory
Combining
Communicator
Comparable
Component
Composing
Computational
Computing
Conceptual
Conditional
Configurable
Congressional
Constraints
Context
Conversational
Conversion
Coreference_Resolution
Corpora
Corpus
Correction
Coverage
Czech
DARPA
DATE
DUC
Data
Database
Decoding
Description
Design
Developing
Dialogue
Dictionary
Direct
Disambiguation
Discourse
Document
Documents
Domain
Duration
Dutch
EPAC
Earley-type
Efficient
English
English-
English-to-
Enhancement
Entity
Entropy
Environment
Error_Analysis
European
Evaluation
Events
Expectation
Experiments
Expression
Extensions
Extracting
Extraction
F-measure)
Feature
Features
Fields
First,
Fl
Focus
For
Fragments
Framework
French
French-W08-0327.9
French-to-C88-1031.25
Frequency
From
Functional
Fundamental
GENIA
Gale
Gazdar
Generation
Generic
German
Given
Global
Government-Binding
Grammar
Graph-W06-0205.3
Graph-based_Approach
Guidelines
HPSG
Headline
Hiero-like
High-quality
Hindi
Homogeneity
Homophone
HowNet
Human-Human
Hungarian
HybridTrim
I
IBl
IC
ITG
Identification
Improving
In
Including
Independent
Indexing
Indirect
Inference
Information
Information Retrieval
Information_Extraction
Information_Retrieval
Information_Retrieval_systems
Information_extraction
Infrastructure
Input
Integer_Linear_Programming
Integration
Inter-linked
Interaction
Interactive
Interpretation
Italian
JMWNL,
Japanese
Jelinek
June-2000
Keyword
KnowNet
Knowledge
Knowledge_Base
Knowledge_Representation
Knowledge_Sources
Korean
Korean-C02-1086.19
LCS-based_approach
LINGSTAT
LR
LRE
LVCs
Language-
Large-W04-2003.4
Latent_Semantic_Analysis
Latent_semantic_analysis
Leaf
Learning
Learning Approach
Letter-to-N07-1047.3
Levenshtein
Lexical
Lexical-
Lexical_Chains
Lexical_knowledge
Lexicon
Library
Linguistic_Analysis
Linguistic_Theory
List
Logical
Lowest-
MERT
MH
MT_evaluation
MT_systems
MUC
MUC-3
MUC-4
MUC-6
MWE
Machine
Machine-
Machine_Learning_Approach
Machine_Translation
Machine_Translation_System
Malt-W08-2128.15
Management
Mandarin
Mapping
Markov_Model
Markov_models
Maximization
Maximum Entropy
Maximum_Entropy
Maximum_Entropy_Model
Measure
Measures
Mechanisms
Meta-Annotators
Method
Minimum_error_rate_training
MoBiDic)
Model
Modeling
Models
Modern
Mongolian
Morphology
Multi-
Multilingual
Multimodal
Multiple-
N-P04-1078.6
NER
NL
NLG
NLP
NLP System
NLP system
NLP_Applications
NLP_applications
NLP_system
Name
Named
National
Natural Language
Natural Language Processing
Natural_Language
Natural_Language_Generation
Natural_Language_Processing_systems
Natural_Language_Processing_techniques
Network
News
Newspaper
Novel
OCR-Error
October-2001
Of
Of-
On
OntoSelect
Ontology
Optimised
Orientation
Oriented
PAKTUS
PCFG
PENN
PERQ's
POPEL
POS_tagging
PTGC
Palpable
Parallel_texts
Parse
Parser
Parseval
Parsing
Parsing_Algorithm
Part-
Partial
Penn
Penn Treebank
Penn_Treebank-trained
Performance
Personal
Phonetic
Phrase
Pipelined
PoS,
PoS_tags
Portuguese
Pragmatic
Predicate-C04-1204.3
Princeton's
Probabilistic
Probabilistic_Model
Probability
Problem
Procedure
Process
Processing
Project
Prop-
Prose
Prosodic
PubMed
QARLA
QAST
Question Answering
Question_Answering
Question_Answering_System
Question_Answering_system
Questions
RITEL
ROUGE
RTN
Radio
Random
Raw
Recall
Recently
Recognition
Recovery
Relations
Reordering_Model
Representation
Research
Rich
Robust
SGML
SRA's
SRI
SRL
START
SVO,
SYSTRAN
Search
Section
Segmental
Selective
Semantic
Semantic_Analysis
Semantic_analysis
Semantics
Semitic
Sense
Sense Disambiguation
Sense_Disambiguation
Sentence
Several
Shared
Shared_Task
Similarity
Single
Solving
Spanish
Speech
Speech_Act
Speech_Recognition
Speech_recognition_systems
Spoken
Spoken_Language
Spoken_Language_System
States
Statistical
Statistical_Machine_Translation
Statistical_machine_translation_systems
Story
Strategies
Structure
Structures
Study
Style
Supertag
Switchboard
Syntactic
Syntactic_Information
System
Systems
TCT
TREC-3
TREC-4,
Tagged
Tagging
Task
Task-
Term
Terminology
Testbed
Text
Text Summarization
Text_Analysis
Text_Categorization
Texts
Textual
The
Their
Theory
TiGer
Tiger
Time
To
Tool
Topiary
Topic-
Training
Transition
Translation
Translation System
Translation_System
Treatment
Tree
Tree-bank
TreeBank
Tree_Adjoining_Grammar
Ttecursive
Tuna
Type-
UPenn
Understanding
United
Unsupervised
Used
Using
Utterance
VAQA
Verbs
Verification
Viterbi
Vocabulary
WMT2006
WSD
WSJ
Wall_Street_Journal
With
Word
Word Segmentation
Word Sense Disambiguation
WordNet,
WordNet-based_models
Word_Alignment
Word_Sense_Disambiguation
Words
Workshop
World_Knowledge
Written
XML
XSLT-based
[2,
a
abilities
able
about
above
abstract
abstracts
accent
accordance
according
account
accuracy
accurate
achieve
achieved
achieves
achieving
acoustic
acquire
acquired
acquisition
across
actions
active learning
actual
adapted
added
addressed
addresses
adopted
advanced
advanced-level
advances
advantage
advantages
adverbs
affinity
against
agents
agglutinative
agreement
aimed
aiming
aims
al.,
algorithm
algorithm,
algorithms
algorithms,
aliases
aligning
alignment
alignment_models
alignments
all
allow
allowing
allows
almost
alone
along
also
alternating
alternations
alternative
alternatives
altogether
always
amalgamating
ambiguities
ambiguity
ambiguity,
ambiguous
ameliorates
among
amount
amounts
an
analogies
analyse
analyses,
analysis
analytics
analyze
analyzed
analyzer
analyzer,
analyzers
anaphora
anaphora_resolution
anaphoric
anchor texts
anchor_texts
and
annotated
annotation
annotator
answering
any
anytime
appear
applicability
applicable
application
applications
applied
applies
apply
applying
appreciation
approach
approaches
approaches:
appropriateness,
approximately
arbitrary
arc
architecture
architecture,
architectures
archiving
are
area
argues
argument structure
around
art
article
as
aspects
assessment
assign
assigning
assignment
assignment,
associated
at
attachment
attempt
attempts
attention
attributable
attribute
audio
augmented-LR
automate
automatic
automatic_evaluation
automatic_speech_recognition
automatically
availability
available
average
axioms
backbone
bag-of-words
bank
base
based
baseline
bases
basic
basis
be
because
become
been
behavior
behavioral
behaviors
being
below
benefit
benefits
best
best-first
better
between
bi-
biased
biases
bigram
bilingual
bills
binary
biological
biomedical
bipartite
bitext
blackboards
boost
both
bottleneck
bottom-up
boundaries
boundary
branch
brief
broadcast_news
brought
build
built
bundles
bus
but
by
called
came
can
can't
candidates
cannot
capable
capacity
capture
carried
case
case-based
case-study
cases
categorial
categories
categorization
causal
cause
central
certain
chain
challenge
challenges
challenging
chance
change
changes
character
characteristics
characters
chemistry
child
child-directed
choice
chosen
chunking
chunks
citation
citizen-to-administration
class
class-
class-based_models,
classes
classical
classification
classification,
classification_model
classifications
classifier
classifier,
classifiers
classify
classifying
clausal
closed
clustering
clusters
co-occur
co-occurred
co-occurrence
coherence
coherent
cohesion
cohesive
collecting
collection
collections
collocation
collocations
combination
combinations
combinatory
combine
combined
combines
combining
common
communication
comparable
comparatively
compared
comparing
comparison
competence
competitive
compilation
complete
completion
complex
complexity
component
components
components,
composed
composing
compositionality
compression
comprise
comprises
comprising
computation
computational
computational_linguistics
computationally
compute
computer
computers
computes
computing
concatenation
concept
concept-to-speech
concepts
conceptualization,
concern
concerned
concerning
concerns
conditional_probabilities
conditional_random_field
conditional_random_field-based
conditional_random_fields
confidence
configurations
configure
confirmation
connects
consider
considerable
consideration
considered
considers
consist
consistency
consisting
consists
constantly
constituent
constituents
constrain
constraint
constraint-based
constraint-logic
constraints
constraints,
construct
constructed
constructing
construction
constructions
contain
containing
contains
content
content_words
context
context,
context-dependent
context-free
context-independent
contexts
contextual
contextual_features
contextual_information
continuous
contribute
contribution
contributions
control
conversation
conversational
conversations
conversion
convert
coordinate
coordinated
coordination
core
coreference resolution
coreference_resolution
coreference_resolution_system
coreferential
corpora
corpora,
corpus
corpus-based
corpus-based_approach
corpus-oriented
correct
correcting
correctly
correlation
correspond
correspondence
correspondences
corresponding
cost
cost-based
could
counts
coupled
coupling
cover
coverage
create
created
creating
creation
criteria
critical
cross-document
cross-domain
cross-validation
crucial
cue
cues
current
currently
cycle
data
data,
data-driven
database
databases
datasets
date
deal
dealing
deals
deception
decide
decision
decision-making
decision_tree
decision_trees
decisions
declarative
declaratively
declines
decoder
decoding
decrease
dedicated
defaults
definite
definitions
degradation
degrees
demonstrate
demonstrated
depend
dependencies
dependency
dependency structure
dependency-based_model
dependency_relations
dependency_structures
dependency_tree
dependent
depends
deprived
derived
deriving
describe
described
describes
describing
description
descriptions
descriptors
design
designed
detailed
detect
detection
determined
determining
deterministic
develop
developed
developed,
developing
development
device
devices
dialog
dialog-related
dialog_system
dialogs
dialogue
dialogue act
dialogue_act
dialogue_acts
dialogue_system
dialogue_systems
dialogue_systems,
dialogues
dictionaries
dictionary
dictionary,
dictionary-based,
dictionary-based_method
dictionary-based_systems
differences
different
differentiating
differs
difficult
difficulties
difficulty
dimensions
directly
disambiguate
disambiguated
disambiguating
disambiguation
disappears
discontinuous
discourse
discourse_analysis
discourse_structure
discourses
discovers
discriminative
discuss
discussed
discusses
discussing
discussion
disjunctive
distinction,
distinctions
distinguish
distribution
distributions
diverse
diversities
diversity
document
document_classification
documentation
documents
documents,
does
domain
domains
dominated
done
double
draft
draw
duration
durations
during
dynamic
dynamic_programming
dynamic_programming_algorithm
dynamic_programming_algorithms
each
earlier
effect
effective
effectively
effectiveness
effects
efficiency
efficient
effort
efforts
either
electronic
elevated
elliptical
embodies
embodying
emerging
empirical
employ
employed
employs
emptied
encode
encoded
encoding
encouraging
end
end-to-end
end-user
engine
enhance
enhances
enhancing
ensemble
ensures
entails
entire
entities
entity
entity types
entries
entropy
environment
equations
equivalent
erroneous
erroneous-correct
error
error_rate
errors
especially
essential
established
estimate
estimated
estimating
estimation
et
evaluate
evaluated
evaluating
evaluation
evaluation,
evaluation_methods
evaluation_metric
evaluation_metrics
evaluation_result
evaluations
even
event
events
ever-increasing
evidence
examine
examined
example
examples
except
exceptions,
exclusively
exercises
exhibit
exhibited
exist
existing
expansion
expected
experiences
experiment
experimental
experimented
experiments
explanation
exploit
exploited
exploiting
exploits
explore
explosion
exponential
express
expressions
extend
extension
extensions
extensive
extent
extract
extractable
extracted
extracting
extraction
extraction system
extraction_method
extraction_system
extraction_systems
extractor
facilitate
facilitates
fact
factorial
factors
failure
family
far
fast,
faster,
feasible
feature set,
feature_selection,
feature_values
features
feedback
few
field-based
fields
figures
filling
find
fine-grained
finely
first
fitted
fixed
flexible
flexibly
focus
focused
focuses
following
follows,
for
for,
forecasts
form
formal
formalism
formalisms
formalization
format
formations
forms
formulate
found
foundation
four
fragments
frames
framework
free
free word order languages
frequencies
frequency
frequently
from
full
full-scale
fully
function
functional
functionality
fundamental
further
fusion
future
gain
gains
gaps,
gathered
gave
gazetteer,
gazetteers
gene
general
generality
generalization
generally
generate
generated
generates
generating
generation
generation_system
generative_model
generative_models
generator
genre
gestures
get
give
given
gives
global
glossed
goals
gold_standard
gold_standards
good
goodness
grammar
grammar induction
grammars
grammatical
grammatical functions
grammaticalP08-2056.24
graph
grapheme-to-phoneme
graphics
graphs
gratis
great
grec
greedy
group
grouping
grow
growing
growing,
guide
guided
guidelines
hand
hand-corrected
handled
handling
hands-on
handwritten
haptic
has
have
having
headings,
headlines
help
helpful
helps
hence
heuristic
hidden
high
high quality
high-precision
high-quality
higher
highest
highly
homogeneity
homophone
hours
hours'
how
however,
huge
human
human language
human-computer
human-human
human-produced
human_languages
hundred
hybrid
hypothesis
ideia
identification
identified
identifiers
identifies
identify
identifying
idiom
idiomatic
idioms
idioms,
immediately
impact
implement
implementation
implementations,
implemented
implementing
implies
important
important,
impose
improve
improved
improvement
improvement,
improvements
improves
improving
in
in,
in-vocabulary
include
included
includes
including
inconsistencies
incorporate
incorporation
incorrect
incorrectly
increase
increases
increasing
incremental
indeed
indefinite
independent
index
indexed
indexer,
indexing
indicate
indicated
indicating
individual
induced
inducing
induction
inferencing
inflectionally
influence
informal
information
information extraction
information retrieval
information structure
information,
information_extraction
information_extraction_system
information_gain
information_retrieval
information_retrieval_systems
information_sources
information_structure
information_structures
infrastructure
initiatives
input
inside
insights
instances
instead
instruction
integral
integrated
integrating
integration
intelligent
inter-
inter-linked
interaction
interactions
interactive
interdisciplinary
interest
interface
interfaces
interjudge
interlinearized
intermediate
internal
interpretation
interpretations
interpreting
into
intonation
intra-annotator
introduce
introduced
introduces
introduction
inventory
investigate
investigated
investigates
investigation
investigations
involve
involves
is
issue
issues
it
item
items
its
joint
jointly
journal
judgments
juncture
k
kernel_methods
know
knowledge
knowledge-base
knowledge-based
knowledge_base
knowledge_bases
knowledge_source
knows
label
labeled
labeling
labelling
labels,
lack
language
language-independent
language-oriented
language;
language_model
language_model-based
language_modeling
language_models
language_pairs
language_processing
language_processing_system
language_production
language_system
language_technology
language_understanding,
languages
large
large-scale
largeL08-1189.5
largely
larger
last
latent
latest
latter
lattice
layers
lead
leads
learned
learner
learning
learning_algorithm
learning_approach
learning_method
leaves
led
legal
lemma
lemmas
lemmatization,
lemmatizer
length
lengthy
less
letters
level
levels
leverage
lexi-calized
lexical
lexical,
lexical_choice
lexical_entries
lexical_entry
lexical_features
lexical_information
lexical_items
lexical_resources
lexicalist
lexicography
lexicon
lexicon-based
lexicons
libraries
library
libre,
life
life+s)
light
likely
limitations
limited
limits
linear
linear-chain
linear_models
linguistic
linguistic features
linguistic resource
linguistic,
linguistic_analyses
linguistic_analysis
linguistic_features
linguistic_structure
linguistically
linguistically-annotated
linguistics
linguists
linking
list
listening
lists
live+s
lives
local
logic
logical
long
look
looking
lot
low
low-level
lower
machine
machine translation systems
machine-tractable
machine_learning
machine_translation
machine_translation_system
machine_translation_system,
machine_translation_systems
macro
made
main
mainly
major
make
makes
manages
manual
manually
manuals
many
many-to-many
map
mapping
mark-up
matched
matrix
maximal
maximization
maximum entropy
may
meaning
meaning_representations
means
measure
measures
mechanism
mechanisms
medical
medium-sized
medline
megabytes
member
memory
memory-based
merging
message
method
methodological
methodologies,
methodology
methods
methods,
metonymie
metric
metrics
metrics,
million
million-word
minimize
minor
minority
miscellaneous
misinterpreted
mismatch
mixed-initiative
mixing
model
model,
model-based
model-theoretic
model_parameters
modeling
models
moderately-broad-coverage
modern
modification
modifiers
modular
module
modules
monolingual
mood
more
morphological
morphological_analysis
morphological_features
morphology
most
motivated
much
multi-document
multi-document_summarization
multi-field
multi-level
multi-lingual
multi-modal
multichannel
multiclass
multidimensional
multilayered
multilingual
multimedia
multimodal
multiple
multiword_expression
must
n-gram
n-gram_models
named
namely
names
narrative
natural
natural language
natural language processing
natural_language
natural_language_generation_system
natural_language_interface
natural_language_processing
natural_language_processing_systems
natural_language_sentences
natural_language_systems
natural_languages
naturally
nature
needs
neglected
net
networks
neural_networks
neutral
new
new,
news
newspaper
nlg
nlp
node
nodes
non-linguistic
non-local
non-referential
non-speech
nonmonotonic
nonmonotonicity
normal
not
notation
note
noun phrase
noun_phrases
nouns
novel
novelty
nowadays
number
nursing
object
objective
objectives:
obtain
obtained
obtaining
obtains
occur
occurred
occurred,
occurrence
occurring
occurringC92-1041.15
of
offer
often
oj
on
on-going
once
one
one-to-one
ones
ongoing
online
only
ontological
ontologies
ontology-centric
open
open,
operation
operations,
opinion
optimal
optimization
or
oral
order
order-sensitive
ordering
orderings
ordinary
organizations
organized
organizing
oriental
oriented
original
originate
origins
orthographic
orthography,
other
other,
our
out
out-of-domain
outline
outlines
outperform
outperforms
output
outputs
outrivals
over
overall
overview
page
pages
pair
paired
pairs
pait-ol'-E91-1004.31
paper
paper,
papers
paradigm
paragraph
parallel
parallel_corpora
parallel_corpus
parallel_texts
parameter
parameters
paraphrasing
parentheticals
parse
parse_trees
parsed
parser
parsers
parses
parsing
part
part-of-speech
part_of_speech_tag
partial
partially
participated
particles
particular
particularly
partitioning
parts
parts-of-speech
path
paths
pattern
pattern-matching
patterns
penalty
per
perform
performance
performance_improvement
performed
performing
performs
permutation
personal
phenomena
phenomenon
phone
phoneme
phonemes
phonetic
phonological
phonologicalP98-2171.36
phrase
phrase-based_model
phrase_structure_trees,
phrases
picture
pipeline
pipelined
pipelines
pitch
plan-based_model
platform
play
plays
port
portable
positional
possibilities
possible
post-evaluation_results
post-processing
post-processor
posts,
power,
powerful
practical
practice
pre-processing
precise
precisely
precision
precompilation
predicate-argument_structures
predicate_argument_structure
predict
predicted
prediction
predictions
predicts
preferences
preliminary
prepositional_phrases
prepositions
preprocessing
prerequisite
present
presentation
presented,
presents
presents,
presupposed
previous
previously
primarily
primary
principally
principle
principled
principles
probabilistic
probabilistic models
probabilistic_model
probabilistic_models
probabilities
probability
problem
problem,
problems
problems,
procedure
procedures
proceeds
process
process,
processed
processes
processing
processor
produce
producing
profiles
profligate
program
programming
programs
progress
project
promising
promising,
pronominal
pronoun
pronouns
pronunciations
proofs
proper_names
properties
properties,
property
property-labels
proposal
propose
proposed
proposes
propositions
prose
prosodic
prosodie
prosody
prototype
prov-ably
prove
provide
provided
provides
psycholinguistic
publicly
published
pure
purposes
purposes,
qualities
quality
quantifiers,
query
query expansion
query-oriented
query_expansion
querying
question
quite
radically
range
ranging
rank
ranking
rarely
rate
rates
raw
re-calculated
read
readings
real
real-time
real-word
realisation
realizations
realize
recall
recent
recently
recognition
recognition-based
recognition-based_approach
recognize
recognized
recognizer
reconciled
recorded
recorded,
recordings
records
records,
reduces
reduction
reestimation
reference
references
referential
referring
refinement
refining
reflect
regarding
regards
regular
regularities
regularity
regularizing
reimplement
relate
related
relations
relationship
relationships
relative
relatively
relevant
reliable
reliably
relies
rely
relying
remaining
rendering
reordering_models
repairing
repeatable
repeatedly
repetition
replaced
report
reported
reporter-specific
reports
repositories
represent
representation
representations
representations,
represented
representing
require
required
requirement
requires
requiring
reranking
research
research_project,
resolution
resolve
resolves
resorted
resource
resources
respect
respective
restricted
restriction
result
resulted
resulting
results
retain
retrieval
retrieved
reused
reverse
reversible
review
reviews
revision
revisits
rewriting
rhetorical
rhetorically
rich
richness
right
risk
robust
robustness
role
rooted
rote
route
rule
rule-based
rule-based,
rule-based_method
rule-based_model
rules
rules,
run
running
same
sample
samples
scenarios
schema
schemas
schemata
scheme
schemes
science
scientific
scientific_literature
scope
score
search
search_algorithm
searching
section
seed
seem
segment
segmental
segments
select
selected
selection
self-training
semantic
semantic analysis
semantic interpretation
semantic role
semantic_analysis
semantic_classes
semantic_features
semantic_information
semantic_informations
semantic_interpretation
semantic_interpretations
semantic_properties
semantic_relation
semantic_relations
semantic_representation
semantic_representations
semantic_structure
semantically
semantically-related
semantics
semi-automatic
sense
sense disambiguation
senses
sensitive
sensitivity
sentence
sentence-aligned
sentence-external
sentence-internal
sentences
separate,
sequence
sequences
sequential
serve
set
set,
sets
setup
seven
several
shallow
shareable
shared-task
shifted
shortest
should
show
showed
shows
signal_processing
significance
significant
significantly
similar
similarity
simple
simpler,
simplified
simulated
single
situate
situations
six-times
size
sized
sizes
sliding-window
slightly
small
smoothed
so
soft
software
solely
solid
solutions
solving
some
sophisticated
source
source language
source-side
source_sentence
sources
space
spatial
spatially
speaker-dependent
speaking
special-purpose
specialised
specific
specifically
specification
specifications
specificity
speech
speech recognition
speech,
speech_corpus
speech_processing
speech_recognition
speech_recognition_system
speech_synthesis
speech_translation
speech_understanding_system
speech_understanding_systems
speed
speeding
speedup
spoken
spoken-language
spontaneous
spontaneous_speech
stack
stage
stage,
stages
stages:
standard
standardized
standards
state
state-of-the-art
statement
stateof-the-art
statistical
statistical_machine_translation
statistical_methods
statistical_model
statistical_models
statistical_translation_models
statistically
statistics
status,
step
stochastic
storage
stories
strategies
strategy
stream
strength
string
structural
structurally
structure
structure,
structures
structuring
studies
study
study,
stylistic
stylistics
sub-tasks
subcategorization
subfield
subjective
subjectively
subjects
sublanguage,
submissions
submitted
subroutine
subsequent
subsets
substantial
substantially
substring
substructures
success
successfully
successive
such
suffer
suffixes
suitable
suite
suited
summaries
summarization
summarizes
summary
supertag
supertagging,
supertags
supervised
support
support_vector_machine
support_vector_machines
supported
supports
suprasegmental
surface
surprisingly
syllable-to-character
synchronous
syntactic
syntactic categories
syntactic,
syntactic_analysis
syntactic_categories
syntactic_features
syntactic_information
syntactic_representation
syntactic_structure
syntactic_structures
syntactical
syntax
syntax-free
synthesis
synthesized
synthesizer
system
system,
system_architecture
systematic
systems
systems'
systems,
sytem
tag
tagged
tagger
tagging
tags
take
taken
takes
taking
target
target language
target_languages
targets
task
task-oriented
tasks
taxonomies
taxonomy
technical
technique
technique,
techniques
techniques,
technologies
technology
telephone
television
template
templates,
temporal
temporal_relations
temporally
term
term-based
terms
terms,
test
test set
test set,
test_set
tested
testing
tests
text
text generation
text-based
text-to-speech
text_analysis
text_classification
text_processing
text_retrieval
text_structure
texts
texts,
textual
textual,
than
that
that,
the
theW05-0617.18
their
them
then
theorem
theoretical
theory
there
these
these,
they
thirty
this
those
three
thresholds
through
thus
tightly
time
time,
time-synchronous
to
today's
together
token
tokenization
tokenization,
too
tool
tools
tools,
top
top-down
topic
topics
topology
toponyms
total
touch
towards
track
traditional
traditionally
train
trained
training
training_corpus
transcribed
transcription
transcriptions
transcripts
transfer
transferi-oriented
transformation
transformation-based
transformations
transforming
translated
translating
translation
translation system
translation_system
translation_system,
translation_systems
translations
transparent,
treating
treatment
treatments
tree
tree-bank
tree_structures
trees
trivial
tuned
tutoring
two
two-level
two-stage
type
typed
types
typically
typology
un-supervised
unambiguously
unanalyzed
uncertainty
under
underlying
underspecified
understanding
understated
understood
unexpected
unification
unified
uniform
unigram
unit
unknown
unknown_words
unlabeled
unlabelled
unlikely
unlimited
unscoped
unstructured
unsupervised
untagged
up
upon
use
used
useful
usefulness
user
user-friendly
uses
using
usually
utility
utilize
utilizes
utilizing
utterance
utterances
valence
valid
values
variable
variables
variants
variation
variation,
variations
variety
various
vary
vector
vector-based_models
vector_space_model
verb
verb_classes
verbal
verbs
verbs,
verification
version
versions
very
via
video
view
viewed
vocabulary
volume
voted
voting
was
wasted
way
way,
ways
ways,
wc
we
weak
weather
web
web document
web_documents
web_page
web_pages
weblog
weigh
weight
weighted
weights
well
well-formed
well-known
were
when
where
which
while
whole
whose
wide-coverage
widely
wiki-based_systems
will
windows
with
within
without
word
word alignment
word models,
word segmentation
word sense
word sense disambiguation
word-alignment
word-association
word-lattice
word-reordering
word-sense_disambiguation
word_alignment
word_error_rate
word_segmentation
word_sense_disambiguation
wordforms
words
words,
work
works
world
world knowledge
would
written
xml
yield
yielded
yields
zero
