pragmatics_processing,
robust_explanation_system
language_acquisition
kind
lexical,_syntactic,_semantic,_and_structural_information
recall,
exact_match_accuracy
sentence-level_and_text-level_anaphora
allowing
comes
phonological_system
dynamic_programming
tend
Source_and_Target_languages
Japanese_natural_language_processing_studies
utilizes
MeSH
AS-closed,
graph
subpredicates
Node-based_inference
(called
ambiguity
full_parsing
unambiguous_structures
emoticons
EBMT
events
takes
addressee_identification
semantics
answer_expressions
results
transliteration/backtransliteration_experiments
errors
primitive_Optimality_Theory_(OTP),
part_of_speech_information
improve
tests
implicit
known_deterministic_parser
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
Translations
stochastic,_graph-based_method
Prague_Dependency_Treebank
stages
relying
reference_sets
filled
relations
shallow_linguistic_features
on
define
Japanese_unknown_words
software
display_of_graphical_information
tagging
stemming_model
hierarchical_lexicon
explanation_generation
never
limits
unsupervised_learning
WordNet
translation_memory_system
lexical_weighting
direct
TIPSTER_Architecture_specification
habituality
cannot
requiring
English_Wikipedia,
conventionally
HDAGs
unsegmented_Arabic_corpus
experiments:
probabilistic_spectral_mapping
definite_clause_grammars
makes
independently trained models
presented,
ARPA_large-vocabulary_CSR_corpora
unique
machine-readable_dictionaries_(MRD's)
containing
flexible_parser
demonstrative_forms_and_functions
linguistic_processing
named entities
extracted_fields
contextual_similarity
names
with
speech_recognition
newspaper texts
structured_natural_language_data
Paramax_spoken_language_understanding_system
word_string
reduplication
unsupervised_learning_approach
model_of_grammatical_processing
vocabulary),
goal
text,
relevance
temporal_adverbials
classifier
human_plausible_reasoning
wordbreaks
translation_data
inference_types
base_parser,
QA_system
WSD_programs
classification_method
text
natural_languages
conceptual
detect
adapted
expensive
speech_processing
multiple_complementation_patterns
temporal_anaphora_phenomena
's
essays
ways
syntax,
out
reference
customized
test
initially
temporal_relations
needed
lexical_translations
word-sense_disambiguation_algorithm
KL-ONE
consider
discourse_processing
generator
incorporated
finding
write
challenges
event_map
summary_generation
decision_list
probabilistic_synchronous_dependency_insertion_grammar
sentential_paraphrases
interfaces
decision-tree_approach
whose
generative_model,
gain
Bayesian_learning
vector_space_model
Bayesian_semi-supervised_Chinese_word_segmentation_model
log(d)_overheads
make
loss_functions
LFG
scoring
little
multi-component_architecture
particular
stereotyped_text_structure
natural_language
serves
human_transcriptions
system
annotation_scheme
dialogue_interaction
(and
CFG_rules
Collins_(2000)_reranker
target speaker
MBR_decoding
HK-open,
grammatical_gender
declarative_languages
dialogue
formalism
automatic_extraction
state-of-the-art_coherence_model
knowledge-based_mechanisms
expected
create
speaker
text_processing
at
strength_of_potential_antecedence
parsed_corpus
Comparator_software
word-senses
augmented_Friedman_-_Warren_algorithm
decision_tree_based_approach
(konpyuutaa)
according
Italian and English verb subcategorization frames (SCFs)
target_document
linguistic_domain
monolingual_and_bilingual_information
deals
transition_graphs
OCR
traditional_knowledge-based_techniques
small-scale
node_structures
scf types
deductive_approach
TiMBL,
dictionaries_of_word_forms
bilingual_dictionaries
word-lemma_based_feature_function_models
tools
argued
bit-vector_operations
Czech
LTAG
bootstrap
TAGs
translation_quality
Boolean_conditions
conventional_statistical_methods
feature-based_word_grammar
tutorial_dialogue
conditioning variables
classifier_assignment
deadline
polynomial_time
learners
unification-based_linguistic_descriptions
verbal_interactions
models
log-linear_(maximum-entropy)_models
what
syntactic_behavior
algorithm_for_translation_lexicon_acquisition_(SABLE),
IntEx_system
Jiang
result
syntactic_coverage
spoken_language_technology
word_error_rate_(WER)
contain
non-terminal_symbol
constructs
corpus-based_method
MT_system
efficiently
spelling_correction
Comparator
syntactico-semantic_(tectogrammatical)_annotation
case-based_MT_(CBMT)
requirements
metaphors
predictably
advances
target
referents
certainty_conditions
spoken_language_corpus
machine_translation_system
performance
on-line_encyclopedias_and_dictionaries
more
log-linear_combination
complex_sentences
approaches
digital_learning
cross-entropy
surface_English
dynamic_language_model_combination
linguistic_objects
abduction
(using
ported
dependency_structure
documents_with_signal_content
categorization_task,
computational_theory
formalising
mainly
methods
collected
instead
compression_ratio
analyses
data_retrieval
joint_model
phrase_structure_grammar
identify
Coedition
superior
speaker-independent_(SI)_training
RCL_parsers
called
1983)
were
outperform
sharing
data_representation_choice
word_clusters
allows
effectively
training_speakers
format
relevant
20k
role
found
system's_output
duration_model
projection_of_structures
clues
considered
grammars
synonym relation
met
objects
citing
fundamentally
35.0%
decision-tree_classifier
runs
control_structure
offers
parse
segmentation_standards
vast
novel
dedicated
abstractions
song_lyrics
same
summarization
Wizard_of_Oz_technique
log-linear_block_bigram_model
description
graph_transformations
domain-specific_(in-domain)_word_alignment
learning_algorithm
clustering_methods
Korean-to-Japanese_dictionary
represented
open-domain_question_answering
after
MT_systems
written
parallel_structures
unification-based_grammatical_frameworks
part
psycholinguistic_literature
coherence_assessment
n-gram_statistics
Noun Classifier Associations (NCA)
indeed
text_processors
associative_similarity
Log-linear_models
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
English-Japanese,
bilingual_material
languages
morphological_and_syntactic_information
incremental_probabilistic_parser
visualization_method,
analysis
speech_understanding
respect
language
(e.g.
derived
polysemy
delimiters
word-dependent_substitution_costs
discourse_copying_algorithm
corpus_text
arbitrary
SVMs
interrogatives
parser
40
speech_recognition_hypotheses_(SRH)
Horn_clauses
reduced
compounds
surface_forms
predicting_top-level_boundaries,
hidden_variables
problem,
body
technique
data
disambiguation_algorithms
exploratory_corpus_analysis
high-accuracy_word-level_alignment_models
often
evaluated
collecting
discourse_context
Penn_Treebank_Corpus
syntax
monolingual_parallel_corpora
information_redundancy
recent
training_techniques
best-reported
F-measures
levels
version
capability
constraining
fine-grained_grammatical_categories
relative_error_rate_reduction
syntactic_disambiguation
real-valued_features
even
special
and
finite-state_approximation
structured
P-CFG
discourse_task
structured_data
underspecified_semantic_representation_(USR)
defeat_rules
automatic_metrics
(Bikel,
particularly
draws
incorporating
paraphrase_classification_accuracy
spelling-checkers
intentional_structure
generative_history-based_latent_variable_model
genre
Proposition_Bank_data
HBG
own
valid
chunking_results
recognizer
handling
intractability
itself
provides
firmly
semantic_caseframe_instantiation
grammaticality
word-lemma_model
utterance
ranking_learning_problem
human_transcription
Slavic language
units
discourse_structure
linguistic_theory
different
time_exponential_on_the_size_of_the_grammar
ungrammatical_input
superordinate_substitution
translation
question-answer_pairs
certification
order
into
CMU
various
electronic_discussions
abstracts
MBR_decoders
decision_tree
ambiguity_representations
genetic_search
state-of-the-art_performance
thesaurus_construction
(Karttunen,
ECA
German_text_corpora
quantifying_noun_groups
categories
readily
automatically
modification_probabilities
legal_terminology
smoothing
rely
required
over
lack
planning-based_architecture
blocks
explicitly
robustness_problems
decision_tree_architecture
different-quality_references
ASR
fast,
translations
parts of speech
referring_expressions
dialogue_system
discusses
exhibit
training_method
Nigam
temporary_belief
WSD_task
algorithm
linguistic_phenomena
task_representation
conjunction
ellipsis
automatic_language_identification
formal_language
cooperative_responses
first
heuristic_learning
deal
unification-based_grammar
dependency-based_grammar_model
check
performance_improvement
evaluation
world
may
despite
alphabets
Arabic-English
bit-vector-based_CKY-style_parser
treebank
dependency_parsing
LCS_representations
individual
English-Chinese_bitexts
single-strategy_parsers
domain-independent
antecedence_recovery
text-to-speech_form
test_set
grammatical_formalisms
magnitude
achieves
email-threads
type
constituent_parts
s-VSM_model
words,
knowledge
converge
Named_Entity_(NE)_tagging
generalized_metaphor_mappings
category
semi-supervised_methods
unsupervised_training
dialog_motivators
speeches
English_sentence_structure
combine
LEXSYS
integrates
CAS
language_tutoring_application
electronic_newsgroup_discussions
generalized_metaphor
phrase
semantic constraints
ill-formed_input
SVM
machine_learning_approach
SUN4
basic
predictive_performance
official_rankings
Japanese_patent_claim_sentences
capitalization
verb_semantics
taggers
dependency_tree
alignment
HMM_training
track
abstraction
Information_Bottleneck
stochastic_output_selection
correctness
lexicons
functional_structure
language_learning_model
discourse
advantages
weighted_finite-state_device
domain_knowledge
relied
English-Chinese_parallel_corpora
resource
Turkish_dependency_treebank
computational_model
theories
multilingually_aligned_wordnets
directly
CFG_parsers
recognition_technology
frequency_counts
must
dialog_schemata
focussed
candidate_parses
hierarchies
contributes
speaker_adaptation_(SA)
treated
abstract
corpus
spatial_attributes
automatic_evaluations
implementation
backwards_transliterations
variable
modular_architecture
cooccurrence_patterns
1983;
coherent_text
modeling
general
co-occurrence_similarities
viz.
comparison
query_optimisation
(
Korean
Message_Understanding_Conferences
[ANA]
multiple_and_nested_interactions
so
word_vectors
segmentation
approach
rule-based_systems
general-purpose_NLP_components
inescapable
biomedical_text
accuracies
Turkish_word_structures
preceeding
require
requires
exploit
shared_derivation_forest
NLP_tasks
pruning_criteria
parallel_data
BLEU
shift-reduce_dependency_parsers
ATIS_(Air_Travel_Information_System)_domain
well-written_discourse
syntactic_analysis_system
expected_(grammatical)_sentences
segment_order-sensitive_methods
domain_independent_model
maximization
allow
meet
domain-independent_capabilities
us
significantly
Grosz-Sidner-style_focus_model
logical_well-formedness_conditions
automatic_Q/A
fourteen
by
consists
revision_component
achieved
achieve
for
SMT_research_community
genre-specific_regularities
frames
terminology_structuring
labeled_directed_graph
extraction_system
information_extraction_techniques
well
maximum_likelihood_method
semantic
logical_formulas
hardware_designs
8000-word
selected
Arabic_word_segmentation_system
exploits
indirectly
common
similar_context_features
Japanese_parsers
representation_tree
word_significance
Topic_Detection_and_Tracking_tasks
probabilistic_context-free_grammars
addressed
sides
parsed
hard_problems
high-quality_data
functions
acquire
from
LFG_semantics
supervised_and_unsupervised_methods
new
semantic_verb_classes
account
consisting
deduced
uses
unification-based_grammar_formalism
IE-enhanced_text_browsers
topic
existence
obtained
support_vector_machine
search engine
macro-average_F1_performance
starting
Chat-80
author
extensively
n-ary_relations
traditional_distributional_word-distance_measures
in
feature_weighting_and_selection_function
Graphical_User_Interface_(GUI)_functions
complete
defeasibility
structural_information
temporal_expressions
introduced
automatic_estimation_method
entirely_data-driven_model_selection_procedure
construct
lexical_similarity
derivations
conceptual_system
of
labelled_bracket_F-score
namely
O(n6)_time
application
statistical_alignment_models
Japanese_text
extended_domain_of_locality_(EDOL)
knowledge-based_generation_systems
Unification_Categorial_Grammar_(UCG)
comma_checker
information_flow
character_and_word_error_rate
rankings
Arabic_word_segmenter
generative_model
PoS-tag_feature_function
constitute
ccg_supertagging
feature_structure_unification
sentence_plan
syntax_directed_approach
forecasts
Wall_Street_Journal_articles
natural_language_applications
lexical_coverage
parse-trees
adopt
SRI_toolkit
content_words
priming
multi-strategy_approach
sense_priors
graphical_model
following
automaton
yields
statistical_method
understanding
compactly
Chinese_language,
HMM-based_chunk_tagger,
word's
GUIs
subtrees
113K
textual
semantic_expressibility
semantic_role_labeling,
resource-frugal_approach
series
enhance
Arabic
done
etc.,
cognitive_psychology
local_structure
encyclopedia,
fully-connected_first-order_statistical_class_grammar
relatively
meanings
reduce
idiosyncracies
representation
its
source_and_target_language_sentences
appears
grs
feature-based_relation_extraction
practical
000
classifier_word
extraction
introduce
higher
dependency_relation_paths
predicting
natural_language_processing_systems
knowledge_engineering
translation_paths
arbitrarily
occur
79.1%
oral_communication
syntactic_cues
Mimo_formalism
synonymous expressions
computational_lexicon
syntactic_structure_features
synthesizes
semantic_criterion
critical_discussion
logical_model
dialogue_translation_system
aids
spoken_language_understanding_system
field_structured_extraction_tasks,
forward_pass,
histogram
compositional_syntax_rules
compared
large-vocabulary_CSR,
translates
paper
developed,
data_representation
superset_of_L
via
retrieve
natural_sublanguages
semantically_related_words
lexicologists
fewer
language_modeling_tasks
portability
Polymorphemic_stems
mathematical_expressions
passed
Korean_phonological_knowledge_base_system
boosting_approach
indicators
2.284
devised
declarative
class-oriented_framework
PAKTUS
easy
software_library
captured
flexibilities
trainable_components
viewed
constraint
subset_of_logic
training
virtual_reality_3D_scene_modeling_software
intelligent_mobile_agents
optimum_iteration_number
declarative_formalism
pattern
carry
limited
word-based_alignments
word_alignment
performing
syntax_proper
overall
rule-based_translation_systems
efficiency
information_extraction_system
recordings
gained
efficient
computational_problems
syntactic_ambiguity_resolution
evaluate
marks
generalizable_semantic_principles
all
VSM_model
Plume's_approach_to_parsing
Basque
Syllogistic_reasoning_with_dispositions
integrate
Spelling-checkers
coarse-level_clustering
produced
cooccurrence_statistics
web
proportion_problem
Human-Machine_Communication
computational_complexity
expletive_occurrences
named_entity_(NE)_recognition_(NER)_system
task-specific_domain_knowledge
architectural_modules
query_terms
kernel_functions
multilingual_input
semantically_annotated_corpus
argumentation_system
would
variant
defeasible_reasoning
statistical_methods
excluded
multisentential and multi-paragraph explanations
accuracy
language_processing_systems
segment
suffix_array-based_data_structure
ungrammatical_structures,
noun
then
databases
weather
exponential
beyond
transfer_phase
defined
specifications
generated
incrementally
distinguish
hidden Markov models (HMM),
decoding_strategy
Languages
arbitrary,
parsing_strategies
context-free_parsing
automatic_evaluation_measures
explanation_system
IR,
maximum_entropy_word_alignment_algorithm
time_O(|G||w|3-e)
domain_independent_features
lower
co-occurrence_distribution
retrieval
system_output
stack
knowledge-based_and_random_selection_procedures
sentences
overt_case_markers
agglutinating_free_word_order_language
research_articles
present
systemic_grammar
word_tokens
word_sense_disambiguation
than
writing
Information_Extraction
pushdown_automaton
question_phrases
abstract_flat_syntactic_representations,_LFG_f-structures,
judicious
6
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
English-Japanese_machine_translation,
manually_sense-tagged_data
global_meaning
CTL
Situation_Theory
French_tenses
word-sense_ambiguity
French
explore
single-snippet_answers
proposition
natural_language_generation_community
natural_language_processing,
mapping_score
character_types
candidate
IR
probabilistic_context-free_grammar
semantic_analyzer
communicative_signals
statistical_analysis
hierarchical_(or_other_types_of)_relations
processing
Automatic_Speech_Recognition_technology
sentence-level_semantic_equivalence_classification
house,
Japanese_language_dictionary
automatic_abstracting_systems,
parsing_method
scope_ambiguity
training_corpus
nominals
element
phrase_translations
able
training_examples
user-specified
Sentence_boundary_detection
grammar
interpret
permits
performed
hypothesize
70%_precision
employing
MT,
formal_intersections_of_FSAs
two-phase_shift-reduce_dependency_parser
ILIMP
Topic_signatures
source_interval_projections
morphological_analysis_problem
strong
English-French_document_pairs
user_model
information_source
where
M
semantic_distance
senses
translation lexicons
non-contiguous_phrases
information
JAVELIN
proper_names
phrase-based_models
formal
enriching
training_data
applying
bilingual_parallel_corpus
put
Kong
language_pairs
parsing-based_NE_rules
captures
bilingual_corpora
computer_text_generation_system
partial_theories
problem
derived_strings
range_concatenation_languages_[RCL]
lexical_and_syntactical_variation
word-to-word_alignments
extracts
qualitative_spatial_constraints
out-of-domain_corpus
reversible
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
human-machine_interactions
class_of_languages
Japanese
permit
answer
estimations
configurable
interface
extraction_tool
specialized_parsing_techniques
bag-of-words_methods
sentence_retrieval_problem,
source of data
MWEs_database
CSR
inevitable
areas
conditional_loglinear_models
preference
Presentor
tagger
SI_corpus
ranking_algorithm
discriminative_log-linear_models
Korean_and_English_language_pairs
component
pronoun_"it"
Dutch
PK-closed,
transcribing
training_and_testing_factors
verb-noun_collocation_dictionary_for_Polish
test_corpus
addition
numerous
probability_estimation
automatic_alignments
Named_Entity_task
symbolic knowledge
statistical_models
capture
much
clusters
focus
references
multiple
information_retrieval_techniques
statistical_machine_translation
Machine_Translation_(MT)_systems
77%
root_word_lexicon
predominant_senses
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
126,610
oriented
about
full_scale_two-level_morphological_description
means
appear
HMM_with_Gaussian_mixture_observation_densities
words
training_(reference)_speaker
semantic_information
parsing_algorithm
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
unknown_word
semantic-oriented_NLP_applications
helping
Task-based_evaluation
new_event_detection
HTML_documents
small
attentional_state
connectionist_(neural)_network
crossed_serial_dependencies
framework
revealed
Verbmobil_task
analyst
confidence_measures
abstract_moves
Node-based_inference_rules
DARPA_Spoken_Language_Systems_(SLS)_program
string_similarity
statistical_techniques
text_generation
GLOSSER
concepts
song_lyric_document
machine translation (MT) systems
lexically-induced_relations
Penn_discourse_annotation
syntax-based_constraint
phrase_boundary_heuristics
creation
intense
input
event_structure
formulate
temporal_logic_CTL
culling
Minimum_Bayes-Risk_(MBR)_decoding
decoding
Generalized_Alignment
Expectation-Maximization_(EM)_algorithm
inheritance
set
spoken_dialogue
word-based_collocational_properties
Q/A
clustering_and_filtering_processes
improves
comparative
information_extraction_tasks
Acoustic_modeling
AS-open,
applied
resolve
phone_n-gram_model
it,
four
constructed
text_corpus
Chinese_newspapers
segment_boundaries
speech_and_text_image_processing
paraphrasing
express
mapped
stems
fuzzy_quantifiers
Term_similarities
RAREAS
consistency_problem
denotational_semantics
textual_representation
binary_relational_calculus_notation
handle
statistical_alignment_techniques
formal_definition
email_conversation
phrase-based_statistical_machine_translation_method,
equivalences,
TL
text_browser
comprising
domain_entities
shallow_mapping
sentence_co-occurrences
underspecified representations
necessary
free-content
practice,
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
normal
ranking
restricted_vocabulary
focus_of_attention
source_language
generation
possible,
provide
finite-state_methods
computational_semantic_analyses
evaluation_measures
describes
trajectory
difficult
whether
demonstrated
cooccurrence
Chinese_punctuation_marks
determination
these
–
operates
associative_relationships_between_verb_phrases
generators
multi-tagging_approach
deviates
automatically,
ambiguities
linear_logic
Hong
PCFG-LA
select
context-free_phrase-structure_grammar
extract
error-correction_rules
illustrated
benefit
closely
fundamental
verb_final_language
domain-specific_translation_lexicons
referential_information
outputs
semantic_composition
subcategorization_dictionary
pieces
similar
randomly
Markov_model
any
model_design
domains:
automatic_segmentation
field_structured_text
resulting
maximum-entropy_model
CFG filter
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
inflected_forms
morphological_component
Gaussian_mixture
subcategorization_classes
suggests
tree-bank
[Zernik88],
essential
topic_information
vagueness
positive_feature_vectors
multilingual_TIPSTER_user_interfaces
shared_lexical_information
annotating_scheme
parallel_concordances
Xerox_PARC
be
increased
describing
160
WordNet-based_measures,
syntactic_analysis
four-participants_face-to-face_meetings
bearing
advantage
weaknesses,
prototype_system
hypothesis
Japanese_sentence_analyses
rank
discourse_understanding_process
localized_phrase-based_prediction_model
ranks
based
produces
remains
when
scratch
easy-to-implement
common_text_processing_modules
Chinese_text_corpora
meaning-entailing_substitutability
appropriate
et
stored
recognition
CSG
automated_interpretation
graphic_interpretation_system
spoken_multiparty_dialogue
commonsense_reasoning
word_sense_disambiguation_(WSD)_systems
AI_problem_solving_techniques
texts
but
dependency_relations
seed_sentences
needs
speech_and_text-image_recognition
existing_grammar
SCFs
HPSG_natural_language_system
machine_translation_output
paraphrase_class
MeSH_relations
Conceptual_Dependency_Theory
155
methodology
consist
substitutions
skips
reliable
one
word_senses
arguments
amounts
calculus
user-directed_summaries
modified
sense_resolution
construction-specific_approach
intuitive
pharmaceutical news archive
lower_bound_estimation
embodied
source_language_text
developing
manner
complicated
model_checking
replete
Statistical_Machine_Translation_(SMT)
IE_paradigm
anaphora
relationship
experimental
expectations,
language_processing_tasks
discourse segment,
ambiguous
tasks
though
theoretical_linguistic_investigations
method_to_automatically_acquire_paraphrases
discovered
NP-complete
analytical_components
questions
pooling
phrasal_patterns
combination_methods
mismatch_resolution_scheme
standalone_system
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
high
user_knowledge_modeling_architecture
induced
Korean-to-English_and_a_Japanese-to-English_dictionary
claimed
parser_for_non-configurational_languages
Large-scale_natural_language_generation
translation_performance
characterize
distance
theory_of_attention,_intention,_and_aggregation_of_utterances
show
linguistic_structure
components
decision_trees
predicative_information
non-configurational_languages
linguistic_parser/generator
n-best_speech/language_integration_architecture
descriptions
probabilistic_finite_automata
supervised_learning
keywords
Intra-sentential_quality
vectors_representing_morpho-syntactic_properties
techniques
satisfactorily
VME_bus
agglutinative_language
quantified_sentences,
unsupervised_learning_algorithm
machine_translation_outputs
embodied_conversational_agent
principle-based_theory
minor
performs
story
unigram
argument_frames
translation_accuracy
unification-based_parsing
human_cognition
discourse_segmentation
word_n-grams
NP
(P05-1076.10
robust
manually_segmented_corpus
student
operate
aligned_bilingual_corpus
textual_corpora
topical_blog_post_retrieval
their
cohesive text
semantic network
attribute_sequences
procedural
previous
sequential_models
automatic_discovery_of_text
entities
upon
thematic_grid_tagging,
phrase-based_unigram_model
two
outperforms
pronominalization,
unsupervised_automatic_acquisition
subset
distance values
dimensionalized_space
distributional_approximation
domains
average
noun_phrase_chunks
Cooperative_Model
2491
lexico-syntactic_knowledge
coherence
dynamic_combiner
applications
Wall_Street_Journal_treebank
case-based_reasoning
pivot
overcome
formalisms
NL_evaluations
disambiguation_tool
word-aligned_corpora
100,000
grammar_formalisms
beam-search_decoder
operational_foreign_language_tutoring
chart-based_phrase_structure_parsing
machine
place
PK-open,
Memo-functions
well_calibrated_probabilities,
PropBank
multidimensional_chart_parser
SVM_learning
presented
which
industry_watch
terms,
Name List,
grammatical_relations
-speaking
computational
encodes
pronoun_resolution
as
grammar_checker
generate)
algorithms
rating
address
keep
translation_lexicons
size
transformation_model
guide
phrase translations
educational_tool,
running
WordNet,
free_indexation
source_dependency_parse
being
Chinese_punctuation_marks,
support
confidence
architecture
statistical_parser
feedback
natural_language_generation
probability-based_scoring_function
reduplications
along
correlate
part-of-speech_tagging,
members
NLP_system
log-linear_models
subcategorization_frame_(SCF)
varied
context-free_chart_parsing
part_of_speech_(pos)_tagging
nominal_compounds
language_model
STRAND
conversation_transcripts
user_modeling
grammar_coverage_problems
enumeration
laboratory_study
text_applications
discovering_parallel_sentences
because
inherent
inflection
interpretation
English text
concrete_noun
acquired
phonetic_recognition
listener
IBM_translation_models
unadulterated
subcategorization_cues
general_domains
bilingual_dictionary_coverage
data_representations
Conrath
generate
natural language interfaces
newspaper text,
cooperative
Longman_Dictionary_of_Contemporary_English
natural_language_interfaces
recognizing
sounding
linguistic_structures
agenda-based_scheduling_parser
evaluating
Intel_i860_chip
lexicalized_grammar
expressed
CRF
predictions
binary_relations
ambiguity_packing_and_stochastic_disambiguation_techniques
CCLINC_Korean-to-English_translation_system
topics
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
simple
blog_posts
regarded
groupings
medium-length
80.5%
relative clauses
Kullback-Leibler_distance,
properties
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
predicate_calculus_notation
identifying
language_(L0)
designed
predictive_questioning
level
strongly
RINA,
BMM_algorithm
probabilistic context-free grammars
known
KPSG
numbers
observed
classifiers
unsupervised_algorithm
words_with_multiple_meanings
crossing_liaisons
accurate
against
ASR_output
patterns
method_of_analyzing_metaphors
statistical_approaches,
evaluation_metrics
assigning
latent_variable_model
written_and_spoken_language
mappings
polarity-tagged_corpus
probabilistic_context-free_grammar_(PCFG)
AI_text_generation
describe
principled
salience
pronoun_il
modular
Natural_Language_Processing_(NLP)_system
English
question-focused_sentence_retrieval
embedded
our
cognito-pragmatic
n-gram_transliteration_model_(n-gram_TM),
originally
word_significance_(weights)
voice_interactive_system
segments
automatically_acquired_parallel_corpus
direction-giving_task
summary
integration
advertisements
machine_translation_task
metric
features
dictionary-based_word_vectors
resolution_component
usually
suffix_analysis
robustness
survey
good
interlingua
onto
sentence_analysis
pair
chunks_of_words
pronominal_anaphora_resolution_module
examples
utterance_classification
share
top-down_derivation
unsupervised_methods
polarization
Czech-English_statistical_machine_translation_system
attentional_structure_in_discourse
indexing
statistical_translation_model
Chinese_words
other
every
two-step_clustering_process
like
biological_entities
motivated
tree_adjoining_grammar
feature-based relation extraction
~0.25%
have
valuable
good,
it
formalization
domain-specific_semantic_information
conjuncts
standard
nouns
IE_module
MWEs
alignment_errors
Penn_Treebank_data
convolution_kernel
audio_and_scanned_image_data
raw_text
generalized_translation_knowledge
integral
obtain
rate
bare_slice_disambiguation
there
tenses
bibliographic
used
further
language_functionalities
module
Penn_WSJ
has
phone-string_classifier
also
who
training_material
automatic
published
irrelevant
large-scale
military_and_civilian_systems
block_reordering
introduction
learned
Generalized_Quantifier_approach
collection_of_dialog_motivators
domain-specific_word_alignment
(in
lend
resemble
noun_WSD_problems
quality
sentences,
incremental_description_refinement
word_order
improvement
contains
program,
assignments
logic,
rather
syntax-based_statistical_machine_translation_system
pos_tag_ambiguity
transliteration
deterministic_grammar
small,_domain-specific_corpus
Combinatory_Categorial_Grammar_(CCG)_lexicon
inflow
Construct_Algebra
tractable
Bulgarian,
baseline_system
lexical category ambiguity
implicitly
(German-English,
machine_learning_techniques
HBG_model
natural_language_interpretation
could
corresponding
spontaneous_speech
such
reduced_IL_formulae
dialog_model
grammatical_number
corpus-based_approach
MT
provided
improvements
email_communication
Tree_Adjoining_Grammars
conceptual_operations
89.75%
variety
resolving
morphological_analyzer
dialog_manager,
presence
we
context-free_grammars
ordinary
feature_functions
text_classification_problems
behavioral_patterns
mutual_information
attentional_focus
ability
statistical_machine_translation_(SMT)
described
should
independently
linear-chain_conditional_random_field_(CRF)
combining
indices
shown
segmented_strings
access
character-_and_word-segmented_data
way
placement
disjunctions
hierarchical_relations
second_language_and_cognitive_skill_acquisition
theory
semantic_interpretation
Japanese_text_processing
large_corpora
English,_Arabic_and_Spanish_lexicons
empirical
reference_model
discontinuous_constituents
undisambiguated
EM_algorithm
InfoMagnets
does
unification-based_grammar_parsing
linguistic_representation
connectionist_component
hubs
personal_computers
paraphrase
several
entity-based_representation
DRT
Dictionary_construction,
that
tagging_strategies
Path-based_inference_rules
topic_signatures
word_segmentation_problem
departure
structure
formulas
feature_vectors
cross-lingual_comparisons
verb_form_meanings,
word_sense_disambiguation_(WSD)
prominence
program
in-domain_corpus
EUROPARL_corpus
comparable,_non-parallel_corpora
taxonomic_similarity
translation_knowledge
OT
Prolog
text-level_anaphora
incorporates
patchy
will
estimate
few
competitive
parallel_corpus
improving
KL-ONE_style_representation
multi-strategy_and_multi-source_approach_to_question_answering
human_understanding_of_natural_language
parsing_process
Japanese_Dictionary_Task_in_SENSEVAL2
fuzzy_syllogism
been
logic
made
problematic
experimental_evaluation
vocabulary
additional
SRHs
error_correction
naming_conventions
correspond
proof procedure
packed
CoNLL_2008_shared_task
currently
significance
robust_generator
chunking
computational_methods
alleviate
TRDR_score
linguistic_PoS_tagger_and_chunker
entailment_relations
machine_transliteration/backtransliteration
interactions
system_response
temporal_connective
12.5%
structure_of_communicative_context
number
human language learners,
either
retrieval_effectiveness
language-independent_system
semantic_role_labeling
error
Southern_Min_Chinese
parse_reduction
87.5%
building
core
JINTACCS_messages
Dialogue_strategies
zero pronouns
representation_scheme
well_calibrated_probabilities
<
through
analyses_for_large_treebank_grammars
treat
hard decisions
sense-tagged_training_data
synchronous dependency parser
transformed
improved
equivalent
meta-inference_types
ad
accuracy_rate
machine-readable_resources
lexical_approaches
graceful
maintains
--
deep_processing
MUC-6 and MUC-7 English NE tasks
priors
lexical_items
collocations
constructions
Isomorphic Grammars
newswire_texts
American Sign Language (ASL) animation
together
paraphrases
distinct
PCFG-LA model
the
spoken_language_understanding
concept
tune
Systemic_grammar
interactive_problem_solving
Information_extraction_techniques
word-trigram_recognition
conversation_analysis
language processing pipeline
LR-parser
pipelined_NLG_architecture,
processes
million
compositional_interpretation
disambiguate
statistical_and_constraint-based_disambiguation
natural_language_processing
similarity
specific_heuristics
exceeds
dictionaries
news_articles
discourse_connectives
linguistic_expressiveness
textual_corpus
word_examples
unified
WSD_models
lexical_substitutions
towards
new_sublanguage
linguistic rules
deaf
scripts
enough
language_modeling
MSR-open
offer
acquisition_of_word-semantic_information
content-independent_formalism
compete
vectors
German_pronouns
lexical_affinity
TAP-XL_Automated_Analyst's_Assistant
DARPA_Resource_Management_corpus
word_segmentation
most
Mimo,
genres
management_of_uncertainty
tree-to-tree_translation
adjacent
punctuation
gaps
model
probabilistic_finite_automaton
analysis_mechanism
underpinning,
annotation
al.
positive_and_negative_definition_examples
constructing
alignment_adaptation_approach
large-vocabulary_speech_recognition
machine_translation_pipeline
depending
grammatically_correct_input
Praguian_dependency-based_approach
APT
class
implemented
edges
determined
Minimum_Bayes-Risk_framework
parse trees
part-of-speech_annotation
word-sense_disambiguation_systems,
sentence_extraction
multiple_parsing_strategies,
error_correction_mechanisms
memory-based_learning_chunker
deterministic_finite_automaton
editor
simple_clausal_structures
unless
multimodal_parsing_and_understanding
dynamic_programming_(DP)
analyze
induced_model
larger
interpolation_methods,
rules
portion
dictionary_word_sense_definitions
thus
repository
manual_feature_selection
term_aggregation_system
parallel_corpora
traditional_deterministic_parsers
summations
smaller
intelligibility
sense
MT_output
original
(for
Child_Language_Data_Exchange_System_(CHILDES)
NLP
triple
macro-average_F1
success,
acquiring_adjectival_subcategorization_frames
large_Czech_MWE_database
recently
Semantic_theories
filter
verb_forms
fake
verbal_and_nonverbal_grounding_acts
robust---an
labeled_data
instance
XTAG
board
adaptive_learning_procedure
linguistic_annotation
human
still
best
topical report,
per
reestimation_formulas
task-oriented_dialogs
finite-state_models
natural_language_understanding
operational_semantics
character
evidence
Japanese_sentence_structure
demonstrative_expressions
approximation_error
WWER
Machine_Translation
Smadja,1993)
KDS
natural_language_interface
moment
available
syntactic_analyzer,
leading
answer_candidates
answer/question_terms
parse_tree
hidden-variable assignments:
centering approach
scruffy_texts
recognition_of_extra-grammatical_input
distribution
compositional_approaches,
identification_of_non-local_depenencies
sets
tie
English/Chinese_and_English/Japanese_language_pairs
move-tagged_abstracts
entirely
training_and_test_data
CF_grammars
syntactically_motivated_relations
F-measure
document-oriented_applications
aims
7.5%
parse_forest
classification-based_representation_techniques
wildcards
log-linear and linear interpolation,
HK-closed,
suitable
mobile_military_command_and_control
annotate
language_independent_modules
passives,
method
process
MT_evaluation_techniques
reflect
dependencies
are
biases
marine
node-based_inference
SSTC
multilingual_speech_and_language_applications
rule-based_heuristics
Koskenniemi,
human_judgment
impacts
probabilistic_model
thesaurus
SLS_systems
IBM_models
printed_text
computationally
development
frequency_classes
referential_elements
top_human-ranked_sentence_plan
edit_distance
natural_language_environment
spoken_language
neat_texts
function_words
including
verbs
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
marked
feature_structure-directed_generation,
scientific
cue_phrases
human_data
derived_string
transfer_component
GPSG
lexical_hierarchy
core_modules
do
determining
users
context
a
usual
phrases
adaptation
reasoning_with_dispositions
natural_language_processing_(NLP)_systems
dialog_management_system
alternative_markers
Bikel's_parser
analogies
DoPS_system
inference
tag
POS_learning
evaluation_measure
determiners
Dutch_Senseval-2_test_data
voice_input
cognitively_well-motivated_interfaces
pronoun
selecting
trained
rhetorical_patterns
Combination_methods
Metagrammatical_formalisms
lemma-based_model
important
bigram_back-off_language_models
basis
context-sensitive,_phrase_structure_grammar
evaluation_of_Natural_Language_systems
explicit
CriterionSM_Online_Essay_Evaluation_Service
semantics_directed_approach
verb
textual_credibility_indicators
multilingual,_multimedia_data
useful
CFG_parsing
occurring
adequate
each
respectively
straightforward
morpheme_sequence
build
includes
user_interface_styles_or_conventions
permitted
-
unlexicalized_parser
SMT_models
facilitate
powerful
vocabularies
2004)
character_bigrams
effectiveness
word_sense_definitions
answering_agents
integrating
referential_properties_of_noun_phrases
spoken_dialogue_system
purpose
presuppositional_nature
labels
spatial_descriptions
strengths
Czech_WordNet
layout
language_identification
restricted_subset
linguistic_and_non-linguistic_knowledge
minimizes
Chine_language
semantically_rich,_large-scale_knowledge_bases
segment-based_approach
highly_inflective_languages
model_theoretic_interpretation
roots_words
real-world entities
vital
morphology
handles
97%
strategies,
significant
TV_shows
best-path,_bottom-up,_deterministic_parser
protocol_analysis
Japanese-English_translation,
unequal
logical_form_language
problems
research
attain
lexical_and_syntactic_features
scenario_templates
newspaper_corpus
declarative and imperative utterances,
constraint_system
formal_analysis
speech-based_Information_Retrieval_(IR)
machine_translation
manually_segmented_Arabic_corpus
control
candidates
searched
gene_and_protein_interactions
concept-concept_matrix
trend
sequences
sentiment_vector_space_model_(s-VSM)
Chinese_text
semantic_relations
highly
unsupervised learning
entity-oriented_parser
unsegmented_corpus
morphological_analysis
interactive_question-answering_(Q/A)_system
i/l:::'=--~--
given
utilizing
is
discourse_relations
practically_unsupervised_learning_method
Spoken_Language_Systems_(SLS)
non-English_(Arabic)_stemmer
grammar_sensu_stricto
block_selection_criteria
added
generic
supports
did
post-processing
associated
likelihood
amount
efficient,
interaction
distributional_hypothesis
derivational_history
ungrammatical input
live_closed_captions
word
unit
enhances
word_graph
predicate-argument_structures
consequences
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
answer_resolution_algorithm
tree
substrings
comprehensive
textual_domain,
Temporal_Expression_Anchoror_(TEA),
data_objects
relative_frequency_of_occurrence
KL-Conc,
statistics
tailoring
children
sublanguage,
large-scale_knowledge_base
ccg_parsing
corpus_data
coordinations
fragments
unpleasant
domain
semantic_equivalence
"glue_language"
RCL_parser
translation_lexicon
translation_relation,
involve
concept-distance_measures
lexicon
speech
many
manual_transcription
dictionary
flexible_parsing
text-to-speech_conversion_system
agglutinative_languages
written_English
generative_probabilistic_model
coherent
argument_structures
deterministic_parsers
target_corpus
flexible,
Augmented_Transition_Network
Head_Grammars
Hidden_Markov_Model
collection_of_relations_and_operations
extracting_subcategorization_frames
characters-based_Chinese_collocation_system
non-literal_aspects_of_communication
dialogue_systems
MORphological_PArser_MORPA
ranking_problems
surface_realizations
involves
1.6
discursive_usage
naturally
Boolean_matrix_multiplication_(BMM)
Arabic_information_retrieval
missing_words
plays
possible
task-specific_language_development
run
hardness
idiosyncrasies
domain_specific_terms
bottom-up_pattern-matching_parser
pronouns
auxiliary
speech_processing,
subordinate_clause
semantic_constraints
providing
included
HDAG_Kernel
yield
English_questions
regular_expressions
studied
"conventional"_context-free_morphological_grammar
MSR- closed
clauses
Procedural_Systemic_Grammar
event_terms
tracks
implements
expression
lexicalised
term_extraction
Nagao,1993;
bilingual_dependency_relations
structural_and_lexical_dependencies
wide
automated_evaluation_techniques,
using
interpretation_and_generation_of_natural_language
MT_evaluation
f-structures
potential
unsupervised_learning_method
dependency_structures
'
previously
traditional
shallow_techniques
relative
speech_synthesis_systems
less
augmented
resolves
A_deterministic_parser
elementary_structures
an
subcategorization_acquisition
viewpoint
faced
another
compositionality
among
task
system_performance
continuous_density_HMM
identification_of_paraphrases
extracted_field
while
syntactic_information
linguistic information,
ensemble_learning_approach
chunking_performance
conceptually
contexts
example
word-based_models
natural_language_text
train
syntactic_categories
MT-based_paraphrasing_technique
richer
aware
conditional_log-linear_model,
grammatical_sentences
work
regular_languages
learn
CCR_formalism
sentence_plans
28,449
linguistic_introspection
related
extensive
ranking_rules
Japanese_verb_phrases
word_forms
created
labeled
feature_selection_methods
intentions
morphological_constructions
proper
simplify
dialogue_corpora
seeds
recognition_network
trainable_sentence_planner
produce
"black-box"_methodology
translation_candidates
utilized
information workers
elaborated
entailment_acquisition
expanded
compact
disjunctive_feature_structures
blackboard-like_architecture
measure
circuit_specifications
decision_tree_learning
making
monolingual dependency parse
time
unseen_data
precision
lexical_database
relation extraction
interlingual_approach
substantial
effective
purposes
hoc
transliteration_process
training_resources
laws
better
entropy
EM-algorithm
weights
attractive
unknown_words
lexicalized_structures
memory-based_system
restrictive_statements
nominal_constituents
text_mining_method
drawn
limited-domain_spoken-language_task
97.24%
estimated
free_word_order
multi-strategy_framework
derived_words
answer_extraction
knowledge_sources
credibility_indicators
LM
linguistically
speech_data
some
word_clustering
young
only
translation_framework
error_rate
epistemological_level
whole
right-side dependencies
Japanese_character_strings
independent_classifiers
semantically_unmarked_term
linguistic_information
Words
solution
SI recognition,
Word_Sketch_Engine,
question/answer_pairs
classified
complex
Chinese_word_sense_disambiguation_model
volume
utterances
(from
limitations
statistical_profile
text_model
SCFs_distributions
restricted_natural_language
between
real
input_word
participated
subcategorization_frames
German
statistical_information
usefully
1
helpful
use
text collections
types
computational_linguistics
parsing
baseline
ambiguous wordform,
token_classification_task,
context-free_phrase_structure_rules
PER
LMs
coarse-grained_concepts,
test_corpora
projecting
translation_hypotheses
derivation
current
critical
hand-crafted_template-based_or_rule-based_approaches
rule-based_learning_algorithm,
presumed
linguistic_concepts
agree
working
Thai_key_prediction
anaphoric_component
attributes
co-occurrence_patterns
Discourse_Representation_Theory
English,
showing
extracted
dialogue_acquisition_and_tracking_algorithm
rank,
traditional_MT_architectural_designs
ambiguity_resolution
discourse_constraint
lattice-based_approach
NP-_and_non-NP-antecedents
retrieval_performance
specified
achieving
definitions
hybrid_generator,
compare
structure-sharing_of_graphs
search
space
analysed
fits
agreement
statistical_model
Polish
speed
probabilistic_translation_models
shows
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
distributional_word_feature_vectors
useful_terms
heuristic_rules
topic_signature
aid
characterized
choose
text_understanding
Natural_Language_Processing_(NLP)_applications
large
statistical_parameters
Machine_transliteration/back-transliteration
apartment
parsing_data
lexical_methods
supported
constituent_structure_trees
discourse-level construct
expectation-maximization_(EM)_based_word-clustering_algorithm,
personal_names,
lemma-based_approach
SMT
word-based_system
instance,
both
bootstrapping_approach
cepstrum-based_features
worse
general_linguistic_knowledge
spoken_corpora
precision_rate
augment
POS tags in English,
affix_removal
was
WH-questions
proposed
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
they
differ
generation_problem
convey
need
existing
natural_language_system
word_error_rate
semantic_domain_models
exotic,
sometimes
commonly
ideograms
new_domain
saturation
greatly
become
typed_feature_structures
during
represent
computed
very
discourses
syntactic_descriptions
transcription_errors
opposed
begin
distributed_message-passing_infrastructure
Turkish
polynomial_time_solution
depend
not
morpho-syntactic_and_semantic_characteristics
completeness
semantic_representation
structured_databases
graphics_displays
lexical_conceptual_structure_(LCS)_representations
context-free_languages
seem
probabilities
LSA-based_and_the_cooccurrence-based_word_vectors
coordinate_phrases
continuous_speech_recognition_(CSR)_techniques
certain
automatic_evaluation
dramatically
approximation
text_processing_software
Chinese_text_input
quantification_over_events
representations
NL
test_language
within
FDA
connectivity
LT_(LF)
phrase_chunking
extended
comparable
parsing_technique
up
parse_trees
answers
trees
machine_translation_(MT)_evaluation
final
surface_representation
distributional_concept-distance_measures
category_labels
anaphora_references
TAG
ungrammatical segmentations
Japanese_script
Graph_unification
SL
supervised_training_data
biomedical_and_linguistic_ontologies
generation_system
inferred
output
German_corpus
unannotated_text
probabilistic_Horn_clauses
types_of_knowledge
Definite_Clause_Grammar_techniques
gold-standard_parse_trees
benchmark_system
ICICLE_system
programming_language
Plume
prosodic
expert_systems
non-terminals
correlation_measure
grammatical_frameworks
JAVELIN_system
prior_knowledge
path_values
ambiguous_word
paraphrase_examples
0(n)_time
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
Path-based_inference
database_query_application
~
unlexicalized_PCFG_parser
averaging
help
EDOL
documents
typicality
transfer_approach
translation_images
23,000
expectations
feature_structures
direct_orthographical_mapping_(DOM)
parse_forest_representation
linguistic_resources
multi-pathway_MT_architecture_design
them
5%
carried
inferential component
hierarchically-structured_terminology
superordinate -hyponym relation,
ellipsis_resolution
combined
to
this
token-based_models
paraphrasing_method
range_concatenation_grammar_[RCG]_formalism
conceptual_level
fuzzy_quantifier
alternative
relational_database
analytical_inverses
mixture
or
Korean-English_translation
modules
much-studied
threading_algorithm
frequency_profiles
summing
adding
retrieval_approach
user
abductive_inference
parse_record
hierarchy
directionality
weight
sparsity_of_the_feature_space
Web
systems
apply
full_NPs
meaning
database
Chinese_word_segmenter
procedures
decision-making
spoken_dialogue_systems
corpora
combines
question-answering_NL_systems
nature
articles
polysemous_word
statistical_learning_mechanisms
)
can
Taiwan_Child_Language_Corpus
spectral_clustering_based_approach
statistical_MT_performance
rule-invocation_strategies
HPSG
CFG_parser
(Biber,1993;
unification
terms
unrestricted_texts
in-domain_word_alignment
written_texts
tool
interconnected
queries
finite
heuristic_principles
find
associative_relationship
antonymous_adjectives
"one-time_look_up"_method
input_dataset
left_corner_parsing_algorithm
gives
dialog_systems
formatted_weather_data
widely
context_free_languages
threads
under
pairs
event
nodes
Recognition_of_proper_nouns
influence
built
incorporate
syntactic_structure_information
times
asymmetric,_or_directional,_relations
generates
severely
scfs
decision_strategies
how
represents
syntactic_and_semantic_dependencies
lexical_unknown,
definition_sentences
general_and_domain_corpora
tagged
largely
preceding_words
uniform_processing
broad_coverage_lexicon
KL-ONE-like_knowledge_representation_systems
gave
corpus-based sample
word_pairs
equivalence
evaluation_method
adopts
semantic_annotation
internal_and_contextual_information
syntactic_priming
citations,
discriminative_training_criterion
text-plan_input
parser_MDCC
around
developed
Similarity-driven_Transfer_System_(SimTran),
discourse_level
exactly
TIPSTER_applications
formulated
Lexical-Functional_Grammars_(LFG)
construction
single
distributions
model_parameters
domain_dependence
discourse-relevant_purposes
latent_variable
honorifics
Lucy
take
hypotheses_graph
kinds
target_vocabulary
statistical_machine_translation_(MT)
HMM_and_Max-ent_models
primarily
strictly_syntactic_cross-serial_agreement
reasonably
sentence
segmentation bakeoff
described,
