much-studied
motivated
predicative_information
definite_clause_grammars
human_understanding_of_natural_language
syntactic_analysis
referential_properties_of_noun_phrases
MeSH_relations
hierarchical_(or_other_types_of)_relations
spoken_multiparty_dialogue
MSR- closed
pairs
SMT_research_community
weaknesses,
IR,
suitable
categorization_task,
lexical_methods
carry
portability
5%
induced_model
alternative
160
supervised_learning
CRF
phrase-based_statistical_machine_translation_method,
manual_transcription
way
express
basic
(Biber,1993;
typicality
worse
general
allows
protocol_analysis
case-based_MT_(CBMT)
pipelined_NLG_architecture,
lexicalised
biological_entities
tree
deadline
ellipsis
reduced_IL_formulae
usefully
named_entity_(NE)_recognition_(NER)_system
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
includes
labeled_data
taxonomic_similarity
during
features
visualization_method,
parser
natural_sublanguages
IR
et
determined
research_articles
electronic_discussions
incremental_probabilistic_parser
dialogue
methods
decision_tree
baseline_system
more
MT_evaluation_techniques
enhances
Bayesian_learning
natural_language_generation_community
improving
HTML_documents
expected
scenario_templates
etc.,
training_material
character_types
MT-based_paraphrasing_technique
Intra-sentential_quality
second_language_and_cognitive_skill_acquisition
precision_rate
word_alignment
n-ary_relations
units
NLP_system
individual
non-terminal_symbol
parse-trees
MWEs_database
handles
Korean-to-English_and_a_Japanese-to-English_dictionary
category
classifiers
spoken_corpora
introduction
following
captures
rhetorical_patterns
user_knowledge_modeling_architecture
finding
description
addressed
VSM_model
free-content
single-snippet_answers
CoNLL_2008_shared_task
grammar_sensu_stricto
spoken_language_technology
phrases
dictionary
elementary_structures
multi-strategy_framework
existence
log(d)_overheads
relevance
NP-complete
character-_and_word-segmented_data
dependency-based_grammar_model
board
projecting
critical_discussion
reestimation_formulas
domain-specific_(in-domain)_word_alignment
easy-to-implement
Japanese_unknown_words
stems
natural_language_environment
robust---an
require
argumentation_system
error_correction
their
overcome
convolution_kernel
tenses
syntactico-semantic_(tectogrammatical)_annotation
attentional_structure_in_discourse
explicit
well_calibrated_probabilities
transfer_phase
smoothing
WordNet-based_measures,
achieved
extensively
practical
corpus_data
tune
transliteration_process
consists
statistical_techniques
richer
unique
antecedence_recovery
extracted
referential_information
development
bigram_back-off_language_models
achieving
syntax-based_constraint
unification-based_grammar_formalism
prior_knowledge
demonstrative_forms_and_functions
answer
labeled_directed_graph
printed_text
placement
show
support
observed
interfaces
text_classification_problems
surface_English
system_response
semantic_information
lexical_conceptual_structure_(LCS)_representations
PCFG-LA
correlate
predominant_senses
words_with_multiple_meanings
Gaussian_mixture
transliteration
rating
retrieval_approach
likelihood
integral
tagging_strategies
DRT
evaluating
phrase-based_models
combination_methods
named entities
training_and_testing_factors
existing
Web
single-strategy_parsers
Nagao,1993;
semantic
support_vector_machine
sounding
Thai_key_prediction
formalisms
traditional_distributional_word-distance_measures
morpho-syntactic_and_semantic_characteristics
meanings
frequency_counts
wildcards
computational_theory
tagging
recently
answers
full_NPs
unsupervised_learning_approach
ILIMP
trainable_components
cohesive text
hypothesize
components
forecasts
co-occurrence_similarities
APT
dimensionalized_space
Lucy
terms
culling
rely
inference_types
RCL_parsers
method_to_automatically_acquire_paraphrases
viewpoint
word-based_collocational_properties
disambiguation_algorithms
Polymorphemic_stems
research
domain_independent_features
abstractions
words
Recognition_of_proper_nouns
problem,
automatic_abstracting_systems,
structured_data
containing
lexical_and_syntactic_features
CAS
linguistic_PoS_tagger_and_chunker
find
semantic_annotation
morphological_analyzer
method_of_analyzing_metaphors
syntax_directed_approach
computationally
qualitative_spatial_constraints
behavioral_patterns
solution
resource-frugal_approach
by
subset
deterministic_finite_automaton
ungrammatical segmentations
domain_specific_terms
bearing
little
phrase
challenges
usual
incrementally
citing
circuit_specifications
centering approach
MBR_decoders
extracted_field
candidate
translations
nature
linguistic_and_non-linguistic_knowledge
converge
parse_forest
exploits
PK-closed,
feature_selection_methods
training_examples
left_corner_parsing_algorithm
formatted_weather_data
must
independently
LFG
currently
Cooperative_Model
context-free_grammars
f-structures
should
lexical_translations
language_identification
rule-invocation_strategies
linguistic_representation
extended_domain_of_locality_(EDOL)
word_string
finite-state_methods
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
test_corpus
LM
probabilistic_finite_automaton
language_tutoring_application
question-focused_sentence_retrieval
additional
speech_recognition
capitalization
statistical_model
replete
word_senses
presumed
proper
large-scale_knowledge_base
less
QA_system
relied
context-sensitive,_phrase_structure_grammar
Japanese
define
decision-tree_classifier
check
finite-state_models
classifier_assignment
disjunctions
semantic_representation
acquired
newswire_texts
role
amount
Chinese_word_sense_disambiguation_model
Coedition
good,
spoken_language
pronoun_il
meta-inference_types
studied
Korean-English_translation
developing
multi-strategy_approach
M
training_and_test_data
temporal_connective
full_parsing
vector_space_model
textual_corpus
logical_well-formedness_conditions
format
automatic_evaluation_measures
RAREAS
extracts
1.6
packed
subordinate_clause
high
linguistic_concepts
textual_domain,
gene_and_protein_interactions
live_closed_captions
Southern_Min_Chinese
SMT_models
evaluation_measures
HMM-based_chunk_tagger,
answer_extraction
nominal_compounds
TAGs
presented
word_error_rate_(WER)
building
Japanese_character_strings
raw_text
97%
parsing
probabilistic_context-free_grammar
human_transcriptions
unsupervised_algorithm
identifying
inflected_forms
priors
NL
inflow
declarative and imperative utterances,
statistical_machine_translation_(SMT)
cue_phrases
mappings
Machine_Translation
stochastic,_graph-based_method
Basque
ill-formed_input
Log-linear_models
scoring
28,449
syntactically_motivated_relations
applying
Slavic language
logical_form_language
module
target
kernel_functions
(for
context-free_phrase-structure_grammar
robust_explanation_system
20k
determining
heuristic_learning
ambiguities
ambiguous
underspecified representations
reduced
enumeration
feature_weighting_and_selection_function
distributional_hypothesis
display_of_graphical_information
al.
error_rate
done
adopt
guide
advantage
wide
virtual_reality_3D_scene_modeling_software
decision_strategies
word_vectors
feature_structure-directed_generation,
shows
decision-tree_approach
monolingual dependency parse
knowledge-based_and_random_selection_procedures
all
word-based_system
Temporal_Expression_Anchoror_(TEA),
topic_signature
discourse-level construct
Penn_discourse_annotation
grammaticality
verbs
space
-
in-domain_corpus
Minimum_Bayes-Risk_framework
goal
help
own
EUROPARL_corpus
multiple_and_nested_interactions
subtrees
hubs
two-step_clustering_process
unsegmented_corpus
domain-specific_word_alignment
been
us
unification-based_linguistic_descriptions
AI_text_generation
event_terms
introduce
correctness
referential_elements
spatial_descriptions
domain
Word_Sketch_Engine,
access
word_significance
ported
benefit
s-VSM_model
method
limited-domain_spoken-language_task
temporary_belief
formal_definition
problematic
functions
passed
text_mining_method
about
never
ability
credibility_indicators
WordNet,
probability_estimation
only
even
system
baseline
designed
bilingual_dictionary_coverage
000
saturation
smaller
vocabulary
English-Chinese_parallel_corpora
anaphora_references
structured
revision_component
constraint_system
speaker_adaptation_(SA)
Information_extraction_techniques
thesaurus_construction
fake
exhibit
author
function_words
indices
part-of-speech_tagging,
operational_foreign_language_tutoring
natural_language_processing_systems
transition_graphs
marks
human_transcription
tagger
spoken_language_understanding
necessary
essential
Spoken_Language_Systems_(SLS)
derived
place
35.0%
Topic_Detection_and_Tracking_tasks
intentions
different-quality_references
semantic_role_labeling,
predicting
grs
parallel_data
speed
same
architectural_modules
POS tags in English,
MWEs
improved
natural_language_system
attribute_sequences
graphics_displays
Intel_i860_chip
model_theoretic_interpretation
basis
discourse_relations
Polish
Praguian_dependency-based_approach
modular_architecture
Words
significance
Construct_Algebra
arbitrarily
TRDR_score
hardness
word-sense_disambiguation_systems,
maximum-entropy_model
makes
analyze
context-free_phrase_structure_rules
accuracy_rate
Japanese_sentence_analyses
local_structure
extracted_fields
alleviate
small
text_model
estimations
descriptions
WSD_task
applied
text_generation
answer_resolution_algorithm
educational_tool,
translation_relation,
naming_conventions
young
conditional_loglinear_models
configurable
symbolic knowledge
interlingua
ARPA_large-vocabulary_CSR_corpora
grammar_coverage_problems
final
lexicalized_grammar
voice_interactive_system
relative clauses
bilingual_corpora
types
demonstrative_expressions
developed
user-specified
general_domains
token-based_models
adopts
result
particularly
(German-English,
undisambiguated
email_conversation
further
80.5%
unpleasant
IBM_translation_models
conceptual_system
robust_generator
knowledge-based_mechanisms
discourse_context
version
training_techniques
MT_system
depending
communicative_signals
recordings
WSD_models
new_event_detection
useful_terms
search engine
directionality
any
lexicalized_structures
right-side dependencies
information
dialog_motivators
recall,
syntactic_coverage
discourses
predictive_performance
resulting
evaluation
Chat-80
word_forms
randomly
selecting
CSR
positive_feature_vectors
system's_output
searched
models
semantic_verb_classes
compression_ratio
human-machine_interactions
subpredicates
syntactic_behavior
language_modeling_tasks
distributed_message-passing_infrastructure
general-purpose_NLP_components
possible
O(n6)_time
deviates
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
rate
machine_translation_task
ellipsis_resolution
unified
departure
enriching
upon
ad
lexical,_syntactic,_semantic,_and_structural_information
explanation_generation
Acoustic_modeling
depend
integrate
built
abductive_inference
involves
IE_module
among
resemble
strongly
transcription_errors
robustness
referring_expressions
Information_Bottleneck
word_pairs
polysemous_word
categories
concrete_noun
event
derivation
morphological_and_syntactic_information
mobile_military_command_and_control
handling
Combination_methods
global_meaning
translation_framework
bottom-up_pattern-matching_parser
text_understanding
hierarchical_relations
parsing_strategies
it
aware
aligned_bilingual_corpus
few
biomedical_and_linguistic_ontologies
incorporated
Xerox_PARC
retrieve
while
theoretical_linguistic_investigations
output
direct_orthographical_mapping_(DOM)
theories
stages
morphological_component
training_corpus
probabilistic_context-free_grammar_(PCFG)
recognition_of_extra-grammatical_input
sometimes
domain-independent_capabilities
Path-based_inference
substantial
sentence_analysis
formulas
Japanese_sentence_structure
multisentential and multi-paragraph explanations
disjunctive_feature_structures
punctuation
recognizing
stack
manually_segmented_corpus
DoPS_system
emoticons
carried
dialogue_acquisition_and_tracking_algorithm
IBM_models
represented
this
entailment_relations
useful
hypotheses_graph
semantically_unmarked_term
entity-oriented_parser
labelled_bracket_F-score
crossing_liaisons
automatically_acquired_parallel_corpus
the
relative_error_rate_reduction
maintains
real-valued_features
new_domain
whole
strategies,
exceeds
dynamic_programming
HMM_and_Max-ent_models
87.5%
manual_feature_selection
techniques
(konpyuutaa)
sentence_plan
genetic_search
efficient,
model_checking
automaton
retrieval_performance
strengths
HBG_model
knowledge-based_generation_systems
semantic_analyzer
inferred
reasonably
out
natural_language_interface
best
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
captured
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
continuous_density_HMM
model
KL-ONE
predictions
SSTC
Memo-functions
quantifying_noun_groups
occur
novel
ambiguity
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
query_optimisation
JINTACCS_messages
lexicon
syntactic_disambiguation
Mimo,
body
synthesizes
TAP-XL_Automated_Analyst's_Assistant
repository
whose
HPSG_natural_language_system
difficult
phrase_chunking
core_modules
parse_trees
computed
decoding_strategy
dedicated
IE-enhanced_text_browsers
approach
weather
terminology_structuring
ASR_output
corresponding
machine
standard
segment_boundaries
discourse-relevant_purposes
information workers
vectors_representing_morpho-syntactic_properties
generators
Translations
gave
articles
important
extraction_system
subcategorization_frames
flexible_parser
email_communication
latent_variable
dialogue_corpora
summary_generation
known_deterministic_parser
LR-parser
critical
into
often
superset_of_L
quality
dialog_model
addition
weight
LCS_representations
proposition
created
finite-state_approximation
increased
deals
conditional_log-linear_model,
spectral_clustering_based_approach
speech_synthesis_systems
accuracy
WSD_programs
was
model_design
word-aligned_corpora
Hong
developed,
or
blocks
training_method
CTL
common_text_processing_modules
automatic_evaluation
Czech_WordNet
semantic_caseframe_instantiation
volume
Comparator
properties
automatic_Q/A
scf types
task_representation
general_and_domain_corpora
syntactic_categories
entropy
sequences
syntactic_descriptions
translation_quality
language_pairs
Japanese_text_processing
user_modeling
intelligibility
NLP
predicate-argument_structures
Japanese_verb_phrases
coherence
LFG_semantics
pronoun_"it"
tutorial_dialogue
recognizer
SRHs
core
bibliographic
connectionist_component
around
Generalized_Alignment
principled
generation_problem
machine_translation
deal
spoken_dialogue_systems
human_judgment
strictly_syntactic_cross-serial_agreement
12.5%
defeasibility
distributions
NP
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
new
procedural
candidate_parses
English-Chinese_bitexts
semantic_composition
consistency_problem
paraphrase_classification_accuracy
move-tagged_abstracts
semantic_interpretation
Jiang
source of data
F-measures
automatic_language_identification
unadulterated
word-sense_disambiguation_algorithm
appear
claimed
test_corpora
discourse
phonetic_recognition
Verbmobil_task
PK-open,
phone-string_classifier
treat
parsed
we
evaluation_metrics
rule-based_systems
experimental_evaluation
convey
similar_context_features
grammatically_correct_input
automatic_extraction
labels
semantic-oriented_NLP_applications
GLOSSER
rule-based_translation_systems
complete
text_processors
generic
unless
sentential_paraphrases
biases
discusses
effectiveness
induced
problems
sentences
collecting
limitations
conversation_transcripts
feature-based_relation_extraction
efficiency
gold-standard_parse_trees
generalized_metaphor
shift-reduce_dependency_parsers
account
levels
theory
comma_checker
word_significance_(weights)
state-of-the-art_performance
formal_intersections_of_FSAs
MORphological_PArser_MORPA
block_selection_criteria
time_O(|G||w|3-e)
analysis
correlation_measure
topic
discourse_processing
SL
polarization
surface_representation
extract
German
robustness_problems
instance
news_articles
highly
natural_language_understanding
CSG
human language learners,
transfer_component
context_free_languages
log-linear_models
Chinese_word_segmenter
hard decisions
hierarchical_lexicon
voice_input
weights
speech_and_text-image_recognition
semantics
lexical_affinity
graph
contextual_similarity
genre
sides
domains:
presence
input_word
lexical_similarity
augmented
trained
understanding
LTAG
information_extraction_techniques
ranking_algorithm
2004)
hand-crafted_template-based_or_rule-based_approaches
learning_algorithm
fundamentally
do
serves
human_data
syntactic_cues
ATIS_(Air_Travel_Information_System)_domain
multi-tagging_approach
target speaker
ranking_learning_problem
operational_semantics
fourteen
software
alphabets
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
lexicologists
French
exotic,
resolution_component
machine_translation_output
English_Wikipedia,
exponential
abstracts
linguistic_domain
126,610
Isomorphic Grammars
treebank
combine
at
summations
on
event_map
Taiwan_Child_Language_Corpus
added
internal_and_contextual_information
summarization
patterns
topics
sentences,
supervised_training_data
ambiguity_representations
CF_grammars
significantly
permit
unsegmented_Arabic_corpus
describes
KL-ONE_style_representation
lexical_substitutions
edges
skips
contributes
treated
nominals
automatically
average
parsing_data
(e.g.
cognitive_psychology
integrating
blog_posts
various
linguistic_objects
single
synonym relation
being
relations
top-down_derivation
acquisition_of_word-semantic_information
probability-based_scoring_function
token_classification_task,
user
problem
combined
co-occurrence_patterns
runs
bootstrapping_approach
extracting_subcategorization_frames
HDAGs
alignment
EM_algorithm
practically_unsupervised_learning_method
class
coarse-grained_concepts,
certainty_conditions
represents
alternative_markers
parsing_method
forward_pass,
stored
habituality
per
sentence_retrieval_problem,
Penn_Treebank_data
quantified_sentences,
error
Arabic
chunking_performance
produced
0(n)_time
dialogue_system
tag
textual
personal_computers
examples
extraction_tool
real-world entities
variant
Japanese_language_dictionary
agenda-based_scheduling_parser
from
compare
web
Dutch_Senseval-2_test_data
performs
computational_complexity
decision_trees
derivations
predictive_questioning
1983;
work
questions
polarity-tagged_corpus
in-domain_word_alignment
task-specific_language_development
spoken_language_understanding_system
Procedural_Systemic_Grammar
feature_vectors
hidden Markov models (HMM),
Italian and English verb subcategorization frames (SCFs)
representations
relying
discovering_parallel_sentences
larger
97.24%
sublanguage,
noun
primitive_Optimality_Theory_(OTP),
verb_semantics
)
intentional_structure
topical report,
against
unsupervised_automatic_acquisition
significant
results
another
language_model
permitted
blackboard-like_architecture
aids
speech_data
song_lyric_document
transformed
lack
shared_derivation_forest
RINA,
8000-word
domains
intense
spoken_dialogue
citations,
members
case-based_reasoning
translation_lexicon
text,
ECA
towards
seeds
customized
data_objects
agreement
beyond
limited
word_sense_disambiguation
statistical_parser
SVM
written_texts
dictionaries
performance
large
EM-algorithm
syntactic_priming
anaphoric_component
impacts
specifications
Boolean_matrix_multiplication_(BMM)
SCFs_distributions
path_values
use
choose
hierarchically-structured_terminology
HMM_with_Gaussian_mixture_observation_densities
information_source
proof procedure
control_structure
recognition_technology
localized_phrase-based_prediction_model
agglutinating_free_word_order_language
produces
found
ensemble_learning_approach
155
SVM_learning
MT,
how
comprising
reversible
primarily
English-Japanese_machine_translation,
test_language
word_tokens
robust
met
contain
linguistic_phenomena
operate
viz.
intelligent_mobile_agents
HPSG
deaf
events
translation_performance
reduplications
argued
equivalent
2491
relation extraction
LMs
hardware_designs
embedded
Japanese-English_translation,
dynamic_combiner
phrase_boundary_heuristics
gained
hidden-variable assignments:
where
coarse-level_clustering
linguistic_introspection
temporal_adverbials
language_processing_tasks
semantically_annotated_corpus
draws
polysemy
satisfactorily
constructing
probabilistic context-free grammars
approximation
may
BLEU
verbal_interactions
keywords
varied
joint_model
well
grammar_checker
lexically-induced_relations
functional_structure
decision_tree_architecture
generative_probabilistic_model
SI recognition,
statistical_learning_mechanisms
natural_language_processing
military_and_civilian_systems
Nigam
spoken_language_corpus
word_clusters
facilitate
translates
translation_lexicons
salience
chart-based_phrase_structure_parsing
language_modeling
kind
word_sense_disambiguation_(WSD)_systems
domain-independent
spelling-checkers
training_data
paraphrasing_method
memory-based_system
but
InfoMagnets
substitutions
a
intractability
English-French_document_pairs
predicate_calculus_notation
CMU
errors
paraphrase
words,
describe
structure-sharing_of_graphs
grammatical_number
part-of-speech_annotation
representation_scheme
SI_corpus
morphology
missing_words
cross-lingual_comparisons
WWER
subcategorization_acquisition
size
capability
creation
dictionary_word_sense_definitions
idiosyncrasies
language_learning_model
EBMT
maximum_likelihood_method
tool
CriterionSM_Online_Essay_Evaluation_Service
definitions
discourse_understanding_process
via
small-scale
simple_clausal_structures
subcategorization_frame_(SCF)
unknown_word
TV_shows
much
frames
entailment_acquisition
question-answering_NL_systems
showing
learned
multilingual_TIPSTER_user_interfaces
mathematical_expressions
available
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
probabilities
parallel_corpora
textual_representation
bit-vector-based_CKY-style_parser
sequential_models
phrase_structure_grammar
evaluate
conceptual_level
technique
sense
Graphical_User_Interface_(GUI)_functions
software_library
cepstrum-based_features
semantic_distance
text_processing
machine_translation_(MT)_evaluation
answering_agents
unambiguous_structures
distinct
surface_forms
interactions
NL_evaluations
an
corpus
cooccurrence_statistics
thematic_grid_tagging,
required
complex
recognition_network
syntax-based_statistical_machine_translation_system
most
distance values
unsupervised_training
tracks
very
machine_learning_techniques
MT
TIPSTER_applications
closely
expanded
feature_functions
lexical_approaches
run
existing_grammar
trainable_sentence_planner
unseen_data
distinguish
data_representations
well-written_discourse
implemented
computational_model
standalone_system
verb_forms
yields
German_corpus
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
original
dialog_schemata
time
in
text-plan_input
conventionally
good
translation
full_scale_two-level_morphological_description
Presentor
morphological_analysis
grammatical_sentences
focussed
log-linear and linear interpolation,
temporal_logic_CTL
"black-box"_methodology
construct
inevitable
Named_Entity_task
references
"one-time_look_up"_method
thus
lattice-based_approach
acquiring_adjectival_subcategorization_frames
Term_similarities
formulated
Topic_signatures
needs
HK-open,
structure_of_communicative_context
error-correction_rules
both
reflect
itself
leading
segment-based_approach
training
speech_processing
component
offers
word's
segmented_strings
abstraction
backwards_transliterations
parse_record
hoc
shallow_linguistic_features
syntactic_structure_features
verb-noun_collocation_dictionary_for_Polish
Source_and_Target_languages
Arabic-English
translation_hypotheses
over
unannotated_text
ASR
decision_tree_based_approach
2.284
anaphora
TiMBL,
question/answer_pairs
pronoun_resolution
decoding
(
needed
analytical_components
content_words
element
decision-making
cooccurrence
free_indexation
IE_paradigm
generated
paraphrases
Kong
parsing_technique
parsing_algorithm
natural_language_text
scientific
statistical_parameters
amounts
multimodal_parsing_and_understanding
AI_problem_solving_techniques
apartment
natural_language
Named_Entity_(NE)_tagging
principle-based_theory
purposes
assigning
performance_improvement
estimate
deductive_approach
class-oriented_framework
Smadja,1993)
disambiguate
antonymous_adjectives
take
embodied_conversational_agent
(and
scfs
discourse_level
node-based_inference
parsing_process
target_document
higher
cognitively_well-motivated_interfaces
consist
event_structure
language_independent_modules
layout
evaluation_of_Natural_Language_systems
English-Japanese,
high-accuracy_word-level_alignment_models
takes
translation_images
intuitive
roots_words
interpretation_and_generation_of_natural_language
superior
WordNet
(called
called
fundamental
attributes
latent_variable_model
user_model
alignment_errors
compositionality
semantic_role_labeling
lexical_items
speaker-independent_(SI)_training
Japanese_text
segmentation_standards
collection_of_dialog_motivators
multiple
dependency_relations
syntactic_analysis_system
parse_reduction
dialog_management_system
manually_segmented_Arabic_corpus
specified
A_deterministic_parser
Mimo_formalism
grammatical_relations
restricted_subset
provide
grammatical_gender
operates
model_parameters
automatic_segmentation
knowledge
translation_memory_system
linguistic_structures
write
related
70%_precision
feature-based_word_grammar
traditional_knowledge-based_techniques
empirical
text_processing_software
machine translation (MT) systems
dependency_relation_paths
restrictive_statements
statistical_approaches,
sense-tagged_training_data
i/l:::'=--~--
according
MT_systems
reference_model
dependency_parsing
AS-open,
reasoning_with_dispositions
types_of_knowledge
would
logical_model
Chinese_text
lexical_unknown,
MT_output
construction
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
speech_and_text_image_processing
interpolation_methods,
for
unrestricted_texts
declarative
abstract
verb
characterize
Information_Extraction
directly
unsupervised_learning_algorithm
reference
confidence_measures
probabilistic_model
Similarity-driven_Transfer_System_(SimTran),
similarity
Turkish
automatic
because
OT
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
conversation_analysis
affix_removal
cannot
minimizes
discourse_connectives
taggers
surface_realizations
derived_strings
noun_WSD_problems
compounds
associative_relationships_between_verb_phrases
million
suffix_array-based_data_structure
several
expectations,
Bulgarian,
argument_structures
classifier_word
order
[Zernik88],
Machine_Translation_(MT)_systems
small,_domain-specific_corpus
bootstrap
utterance_classification
decision_tree_learning
medium-length
probabilistic_Horn_clauses
inferential component
parse
graphical_model
word-dependent_substitution_costs
similar
included
to
Markov_model
scripts
meaning-entailing_substitutability
naturally
test_set
did
CFG_parsers
email-threads
explanation_system
success,
annotation_scheme
become
language_acquisition
stemming_model
inheritance
relationship
abstract_flat_syntactic_representations,_LFG_f-structures,
achieve
house,
KPSG
linear_logic
German_pronouns
mutual_information
translation lexicons
entity-based_representation
English,_Arabic_and_Spanish_lexicons
comparison
IntEx_system
requirements
Machine_transliteration/back-transliteration
construction-specific_approach
Plume's_approach_to_parsing
Japanese_script
translation_paths
Grosz-Sidner-style_focus_model
user-directed_summaries
(using
word_order
Bikel's_parser
source_dependency_parse
text_corpus
automated_interpretation
HK-closed,
employing
Name List,
grammars
AS-closed,
enough
generalizable_semantic_principles
spatial_attributes
common
Generalized_Quantifier_approach
using
Longman_Dictionary_of_Contemporary_English
arbitrary
spontaneous_speech
defeat_rules
speech_processing,
suffix_analysis
variable
unit
MSR-open
unsupervised_learning_method
n-best_speech/language_integration_architecture
characters-based_Chinese_collocation_system
stochastic_output_selection
Wizard_of_Oz_technique
formalism
data
systemic_grammar
~0.25%
syntactic_analyzer,
measure
word_n-grams
Large-scale_natural_language_generation
database
unification-based_grammatical_frameworks
working
newspaper texts
word_clustering
special
query_terms
polynomial_time
are
probabilistic_spectral_mapping
constituent_structure_trees
algorithms
augmented_Friedman_-_Warren_algorithm
threads
multi-component_architecture
marine
logical_formulas
nouns
PCFG-LA model
who
semantic_domain_models
statistical_translation_model
determiners
written
writing
(Karttunen,
triple
error_correction_mechanisms
deep_processing
numerous
large_corpora
implements
program
verb_final_language
create
system_performance
usually
ambiguity_packing_and_stochastic_disambiguation_techniques
system_output
unlexicalized_parser
resolving
conventional_statistical_methods
unsupervised learning
segmentation bakeoff
training_speakers
accuracies
ideograms
expensive
discourse_constraint
FDA
constructed
expectation-maximization_(EM)_based_word-clustering_algorithm,
distributional_concept-distance_measures
not
four
conjunction
laboratory_study
coherence_assessment
evaluation_measure
rule-based_heuristics
hierarchy
Minimum_Bayes-Risk_(MBR)_decoding
pooling
text_browser
pronominalization,
semantically_rich,_large-scale_knowledge_bases
contains
trees
utterances
textual_corpora
derivational_history
binary_relations
linguistic rules
information_flow
hierarchies
search
Noun Classifier Associations (NCA)
typed_feature_structures
other
need
tools
Boolean_conditions
paraphrase_class
parallel_corpus
strong
collected
supports
maximum_entropy_word_alignment_algorithm
each
current
content-independent_formalism
linguistic_resources
improvements
manually_sense-tagged_data
Discourse_Representation_Theory
limits
begin
published
compositional_approaches,
children
constructs
verb_form_meanings,
dynamic_language_model_combination
exploit
process
parsing-based_NE_rules
predicting_top-level_boundaries,
macro-average_F1
Wall_Street_Journal_articles
log-linear_(maximum-entropy)_models
approximation_error
category_labels
when
natural_language_applications
viewed
summary
generate)
clusters
JAVELIN
essays
metric
explicitly
formalising
elaborated
coordinations
algorithm_for_translation_lexicon_acquisition_(SABLE),
practice,
than
English_sentence_structure
describing
listener
syntax
comparative
written_English
semantic network
some
discourse_task
domain-specific_semantic_information
users
semantic_equivalence
arbitrary,
computational_methods
machine_translation_pipeline
annotating_scheme
threading_algorithm
speaker
build
information_retrieval_techniques
statistical_machine_translation
projection_of_structures
agglutinative_languages
source_language
influence
processes
running
priming
monolingual_parallel_corpora
phrase translations
"glue_language"
structured_databases
training_resources
indeed
syntactic_and_semantic_dependencies
respectively
passives,
polynomial_time_solution
highly_inflective_languages
transformation_model
instead
were
Korean_phonological_knowledge_base_system
79.1%
scruffy_texts
declarative_languages
number
"conventional"_context-free_morphological_grammar
judicious
possible,
that
conditioning variables
survey
question_phrases
constitute
sense_priors
memory-based_learning_chunker
tie
vital
discriminative_log-linear_models
discourse_copying_algorithm
framework
computational_lexicon
prototype_system
SVMs
reduplication
machine_learning_approach
class_of_languages
sentence-level_and_text-level_anaphora
relative
hidden_variables
multidimensional_chart_parser
word-sense_ambiguity
dependency_tree
PropBank
will
vagueness
classification_method
ungrammatical_input
senses
terms,
modules
topic_information
electronic_newsgroup_discussions
character_and_word_error_rate
normal
unification
heuristic_principles
documents_with_signal_content
BMM_algorithm
general_linguistic_knowledge
selected
morpheme_sequence
names
excluded
implementation
multilingual_input
heuristic_rules
open-domain_question_answering
labeled
context-free_chart_parsing
within
(P05-1076.10
tagged
namely
candidates
word-trigram_recognition
XTAG
through
information_extraction_tasks
easy
benchmark_system
our
statistical_alignment_models
kinds
performed
entities
though
target_corpus
interaction
texts
automatic_estimation_method
proportion_problem
Penn_WSJ
answer_expressions
fuzzy_quantifiers
American Sign Language (ASL) animation
chunking_results
Expectation-Maximization_(EM)_algorithm
subcategorization_classes
improve
meaning
attentional_focus
irrelevant
competitive
better
achieves
lexical_and_syntactical_variation
resource
Comparator_software
conceptually
first
linguistic_information
feedback
consequences
preceeding
proper_names
biomedical_text
allow
superordinate_substitution
encyclopedia,
lexical_hierarchy
shallow_techniques
natural_language_interpretation
magnitude
dialog_systems
chunks_of_words
generate
they
classification-based_representation_techniques
based
generalized_translation_knowledge
fragments
so
track
parallel_structures
automated_evaluation_techniques,
phrase-based_unigram_model
correspond
parse_tree
lexical_coverage
learners
trend
Horn_clauses
--
dictionary-based_word_vectors
sets
question-answer_pairs
non-English_(Arabic)_stemmer
simplify
natural_language_processing_(NLP)_systems
DARPA_Resource_Management_corpus
speech_recognition_hypotheses_(SRH)
feature_structure_unification
statistical_method
log-linear_combination
moment
incorporating
certain
augment
together
statistical_profile
regular_expressions
Czech
test
comes
inherent
valuable
effectively
morphological_constructions
noun_phrase_chunks
definition_sentences
term_aggregation_system
prosodic
deterministic_parsers
denotational_semantics
Chinese_punctuation_marks,
modified
dialogue_systems
structural_and_lexical_dependencies
40
finite
Dutch
compactly
field_structured_text
P-CFG
sentence-level_semantic_equivalence_classification
lexical_weighting
segmentation
marked
user_interface_styles_or_conventions
starting
incorporate
character_bigrams
Wall_Street_Journal_treebank
grammar
adequate
generalized_metaphor_mappings
obtain
compositional_syntax_rules
outperforms
previously
ways
data_representation
weighted_finite-state_device
binary_relational_calculus_notation
root_word_lexicon
consisting
natural language interfaces
generator
Chinese_punctuation_marks
task
domain-specific_translation_lexicons
editor
multilingual_speech_and_language_applications
Syllogistic_reasoning_with_dispositions
allowing
OCR
SUN4
generative_model
structural_information
fully-connected_first-order_statistical_class_grammar
lemma-based_model
rank
along
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
machine-readable_dictionaries_(MRD's)
knowledge_engineering
Plume
aims
range_concatenation_languages_[RCL]
representation_tree
potential
management_of_uncertainty
incremental_description_refinement
unsupervised_methods
compact
dependencies
adaptive_learning_procedure
share
sharing
computational_problems
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
statistical_models
lexicons
alignment_adaptation_approach
Koskenniemi,
able
analyses
does
Augmented_Transition_Network
constraining
graphic_interpretation_system
underspecified_semantic_representation_(USR)
wordbreaks
discourse segment,
ambiguous_word
independent_classifiers
bare_slice_disambiguation
independently trained models
presuppositional_nature
Arabic_word_segmentation_system
Prolog
automatic_discovery_of_text
cognito-pragmatic
language_(L0)
clustering_methods
planning-based_architecture
direction-giving_task
fuzzy_quantifier
–
song_lyrics
hybrid_generator,
context
Head_Grammars
laws
expert_systems
seed_sentences
Definite_Clause_Grammar_techniques
discourse_structure
vectors
bit-vector_operations
given
lexico-syntactic_knowledge
accurate
tailoring
Tree_Adjoining_Grammars
(in
word_error_rate
loss_functions
probabilistic_synchronous_dependency_insertion_grammar
capture
traditional_deterministic_parsers
Semantic_theories
Japanese_parsers
tests
described,
strength_of_potential_antecedence
dramatically
LSA-based_and_the_cooccurrence-based_word_vectors
attentional_state
ungrammatical_structures,
pronoun
information_redundancy
textual_credibility_indicators
could
world
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
unification-based_grammar_parsing
coordinate_phrases
of
proposed
contexts
Metagrammatical_formalisms
its
drawn
either
parsed_corpus
distance
sentence
comparable,_non-parallel_corpora
put
Collins_(2000)_reranker
pos_tag_ambiguity
legal_terminology
lend
combining
phone_n-gram_model
mismatch_resolution_scheme
maximization
pieces
experimental
onto
select
TAG
structure
story
English_questions
Conrath
natural_language_processing,
interpretation
analogies
phonological_system
SMT
classifier
transliteration/backtransliteration_experiments
portion
real
parse_forest_representation
presented,
defined
dependency_structure
positive_and_negative_definition_examples
Turkish_word_structures
statistical_machine_translation_(MT)
machine_translation_outputs
auxiliary
sparsity_of_the_feature_space
epistemological_level
113K
GPSG
nominal_constituents
severely
task-specific_domain_knowledge
generation_system
level
monolingual_and_bilingual_information
analytical_inverses
efficiently
data_retrieval
variety
Chine_language
focus
flexible_parsing
nodes
flexibilities
adjacent
certification
SCFs
CFG_parsing
indicators
syntax,
CFG_rules
databases
CCLINC_Korean-to-English_translation_system
dynamic_programming_(DP)
edit_distance
one
commonsense_reasoning
instance,
node_structures
semantics_directed_approach
bilingual_dependency_relations
quantification_over_events
temporal_anaphora_phenomena
constructions
patchy
formal
utilizing
resolves
input_dataset
free_word_order
relevant
defeasible_reasoning
semantic_criterion
advantages
analysis_mechanism
efficient
frequency_classes
lexical category ambiguity
confidence
deterministic_grammar
language processing pipeline
entirely
range_concatenation_grammar_[RCG]_formalism
89.75%
hypothesis
psycholinguistic_literature
machine-readable_resources
bilingual_material
student
revealed
constraint
audio_and_scanned_image_data
natural_language_interfaces
utilized
logic
word_graph
syntactic_structure_information
part_of_speech_information
uses
string_similarity
relational_database
calculus
series
methodology
tree_adjoining_grammar
high-quality_data
after
bag-of-words_methods
completeness
illustrated
between
obtained
up
database_query_application
word_segmentation_problem
synonymous expressions
architecture
word_sense_disambiguation_(WSD)
TL
grammar_formalisms
phrase_translations
parts of speech
neat_texts
is
prominence
restricted_vocabulary
queries
KDS
abduction
objects
provided
example
superordinate -hyponym relation,
scratch
substrings
under
Human-Machine_Communication
resolve
expected_(grammatical)_sentences
Arabic_word_segmenter
yield
VME_bus
commonly
formal_language
Penn_Treebank_Corpus
whether
official_rankings
bilingual_dictionaries
LEXSYS
Chinese_newspapers
annotation
language_processing_systems
PoS-tag_feature_function
cooperative_responses
encodes
topical_blog_post_retrieval
Korean-to-Japanese_dictionary
lower_bound_estimation
non-contiguous_phrases
enhance
statistical_analysis
classified
and
still
boosting_approach
Path-based_inference_rules
supervised_and_unsupervised_methods
1983)
uniform_processing
n-gram_transliteration_model_(n-gram_TM),
discovered
RCL_parser
MUC-6 and MUC-7 English NE tasks
recent
preference
gaps
term_extraction
integrates
context-free_parsing
newspaper text,
means
exploratory_corpus_analysis
tasks
which
vast
Spelling-checkers
retrieval
implicitly
generates
handle
comprehensive
apply
part_of_speech_(pos)_tagging
modeling
improves
documents
like
averaging
corpus-based sample
identification_of_paraphrases
best-path,_bottom-up,_deterministic_parser
well_calibrated_probabilities,
evaluation_method
Combinatory_Categorial_Grammar_(CCG)_lexicon
address
semantically_related_words
extraction
document-oriented_applications
Korean_and_English_language_pairs
answer/question_terms
associative_relationship
direct
continuous_speech_recognition_(CSR)_techniques
idiosyncracies
supported
pair
as
French_tenses
part
out-of-domain_corpus
computational_semantic_analyses
segment
distributional_approximation
n-gram_statistics
on-line_encyclopedias_and_dictionaries
temporal_expressions
demonstrated
semantic_relations
mapped
attractive
make
field_structured_extraction_tasks,
Node-based_inference_rules
Hidden_Markov_Model
ccg_parsing
dialog_manager,
keep
seem
extended
regular_languages
text-level_anaphora
involve
synchronous dependency parser
specific_heuristics
dialogue_translation_system
base_parser,
automatic_metrics
grammatical_frameworks
compete
-speaking
duration_model
unification-based_parsing
faced
expectations
natural_language_generation
coherent_text
adaptation
Chinese_text_input
MBR_decoding
Graph_unification
expressed
utterance
ccg_supertagging
dependency_structures
syntax_proper
beam-search_decoder
has
what
human_cognition
filled
subcategorization_cues
initially
morphological_analysis_problem
asymmetric,_or_directional,_relations
interrogatives
set
utilizes
English/Chinese_and_English/Japanese_language_pairs
concepts
ranks
introduced
translation_accuracy
lexical_database
derived_string
implicit
modular
CFG_parser
considered
overall
semantic_expressibility
Lexical-Functional_Grammars_(LFG)
processing
Paramax_spoken_language_understanding_system
Japanese_Dictionary_Task_in_SENSEVAL2
discontinuous_constituents
minor
pushdown_automaton
analyses_for_large_treebank_grammars
particular
multilingual,_multimedia_data
syntactic_information
multiple_parsing_strategies,
corpora
Languages
approaches
macro-average_F1_performance
traditional_MT_architectural_designs
word_sense_definitions
language
machine_transliteration/backtransliteration
statistical_methods
structured_natural_language_data
source_interval_projections
interface
linguistic information,
these
exactly
parse trees
CFG filter
EDOL
argument_frames
applications
's
discriminative_training_criterion
tend
outperform
semi-supervised_methods
identification_of_non-local_depenencies
23,000
subset_of_logic
ranking
suggests
straightforward
gives
readily
computational
underpinning,
MeSH
GUIs
gain
acquire
pruning_criteria
HMM_training
represent
offer
linguistic_expressiveness
such
hard_problems
agree
domain_dependence
feature_structures
despite
multilingually_aligned_wordnets
SRI_toolkit
word-based_alignments
knowledge_sources
semantic_constraints
mapping_score
KL-ONE-like_knowledge_representation_systems
referents
context-free_languages
modification_probabilities
co-occurrence_distribution
TIPSTER_Architecture_specification
complex_sentences
appropriate
segments
source_and_target_language_sentences
groupings
decision_list
probabilistic_translation_models
interlingual_approach
block_reordering
word_segmentation
interpret
transcribing
answer_candidates
many
Situation_Theory
distributional_word_feature_vectors
'
state-of-the-art_coherence_model
largely
adapted
Natural_Language_Processing_(NLP)_system
sentence_plans
[ANA]
data_representation_choice
annotate
assignments
Japanese_natural_language_processing_studies
multiple_complementation_patterns
expression
Chinese_words
exact_match_accuracy
clustering_and_filtering_processes
task-oriented_dialogs
log-linear_block_bigram_model
vocabulary),
mainly
large-vocabulary_speech_recognition
paraphrasing
sentence_co-occurrences
multi-strategy_and_multi-source_approach_to_question_answering
dictionaries_of_word_forms
word_examples
text-to-speech_conversion_system
paraphrase_examples
ungrammatical input
experiments:
there
areas
large-vocabulary_CSR,
phrasal_patterns
parallel_concordances
complicated
chunking
zero pronouns
model_of_grammatical_processing
rules
English text
Dialogue_strategies
corpus_text
inference
WH-questions
pharmaceutical news archive
Systemic_grammar
ranking_problems
regarded
statistical_alignment_techniques
advertisements
domain_entities
discourse_segmentation
Node-based_inference
effective
pronominal_anaphora_resolution_module
F-measure
machine_translation_system
also
participated
program,
detect
honorifics
Chinese_language,
CCR_formalism
word
providing
corpus-based_approach
syntactic_ambiguity_resolution
top_human-ranked_sentence_plan
speech_understanding
KL-Conc,
fine-grained_grammatical_categories
HBG
compositional_interpretation
automatically,
programming_language
translation_candidates
100,000
reliable
computer_text_generation_system
fewer
optimum_iteration_number
shallow_mapping
outputs
parser_for_non-configurational_languages
collection_of_relations_and_operations
unknown_words
text-to-speech_form
identify
addressee_identification
different
meet
written_and_spoken_language
associated
NP-_and_non-NP-antecedents
connectivity
purpose
times
advances
formal_analysis
determination
comparable
genre-specific_regularities
formulate
speech
tree-bank
two-phase_shift-reduce_dependency_parser
interactive_question-answering_(Q/A)_system
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
appears
tree-to-tree_translation
disambiguation_tool
personal_names,
MT_evaluation
cross-entropy
unsupervised_learning
information_extraction_system
linear-chain_conditional_random_field_(CRF)
improvement
Czech-English_statistical_machine_translation_system
pattern
oral_communication
compared
performing
greatly
ranking_rules
Kullback-Leibler_distance,
helpful
explore
application
originally
theory_of_attention,_intention,_and_aggregation_of_utterances
reference_sets
embodied
abstract_moves
fits
DARPA_Spoken_Language_Systems_(SLS)_program
speeches
be
interactive_problem_solving
translation_knowledge
conjuncts
1
translation_data
two
produce
7.5%
predictably
extensive
evaluated
them
target_vocabulary
sentence_extraction
grammatical_formalisms
feature-based relation extraction
77%
generative_model,
human
requires
non-configurational_languages
recognition
natural_languages
generation
digital_learning
graph_transformations
concept-concept_matrix
ambiguity_resolution
remains
Arabic_information_retrieval
best-reported
every
input
metaphors
analyst
language_functionalities
four-participants_face-to-face_meetings
overt_case_markers
SLS_systems
making
trajectory
pronouns
occurring
can
post-processing
provides
source_language_text
cooccurrence_patterns
tractable
linguistic_annotation
domain_independent_model
relative_frequency_of_occurrence
paper
lemma-based_approach
concept-distance_measures
coherent
indexing
Automatic_Speech_Recognition_technology
newspaper_corpus
logic,
shown
sentiment_vector_space_model_(s-VSM)
subcategorization_dictionary
bilingual_parallel_corpus
spelling_correction
text_applications
concept
expletive_occurrences
vocabularies
non-literal_aspects_of_communication
manner
plays
retrieval_effectiveness
requiring
learn
temporal_relations
Sentence_boundary_detection
cooperative
differ
word-to-word_alignments
ambiguous wordform,
partial_theories
linguistic_theory
large_Czech_MWE_database
word-lemma_model
oriented
spoken_dialogue_system
opposed
rank,
Korean
<
statistical_and_constraint-based_disambiguation
previous
topic_signatures
(from
statistics
unequal
specialized_parsing_techniques
reduce
STRAND
delimiters
statistical_MT_performance
collocations
combines
then
training_(reference)_speaker
segment_order-sensitive_methods
used
firmly
Q/A
characterized
adding
lower
scope_ambiguity
with
arguments
deduced
analysed
procedures
equivalence
word-senses
devised
text collections
histogram
probabilistic_finite_automata
transfer_approach
computational_linguistics
generative_history-based_latent_variable_model
relatively
made
Prague_Dependency_Treebank
human_plausible_reasoning
graceful
character
it,
Turkish_dependency_treebank
declarative_formalism
POS_learning
ICICLE_system
multi-pathway_MT_architecture_design
stereotyped_text_structure
including
Child_Language_Data_Exchange_System_(CHILDES)
unlexicalized_PCFG_parser
permits
linguistically
verbal_and_nonverbal_grounding_acts
precision
~
constituent_parts
linguistic_parser/generator
incorporates
Conceptual_Dependency_Theory
speech-based_Information_Retrieval_(IR)
Statistical_Machine_Translation_(SMT)
helping
unification-based_grammar
frequency_profiles
broad_coverage_lexicon
derived_words
entirely_data-driven_model_selection_procedure
dialogue_interaction
LT_(LF)
Chinese_text_corpora
sense_resolution
ordinary
PER
flexible,
English,
pragmatics_processing,
simple
statistical_information
inflection
HDAG_Kernel
present
described
genres
linguistic_processing
restricted_natural_language
NLP_tasks
type
systems
widely
distribution
algorithm
control
associative_similarity
train
industry_watch
Natural_Language_Processing_(NLP)_applications
large-scale
powerful
summing
integration
thesaurus
known
respect
time_exponential_on_the_size_of_the_grammar
new_sublanguage
crossed_serial_dependencies
corpus-based_method
unigram
parser_MDCC
attain
(Bikel,
valid
evidence
Proposition_Bank_data
Message_Understanding_Conferences
automatic_alignments
agglutinative_language
rankings
non-terminals
rather
focus_of_attention
indirectly
word-based_models
discursive_usage
preceding_words
conceptual
probabilistic_context-free_grammars
traditional
Unification_Categorial_Grammar_(UCG)
language-independent_system
formalization
rule-based_learning_algorithm,
numbers
semantic constraints
mixture
Task-based_evaluation
Dictionary_construction,
conceptual_operations
pivot
shared_lexical_information
domain_knowledge
interconnected
fuzzy_syllogism
languages
representation
inescapable
Japanese_patent_claim_sentences
clues
fast,
6
PAKTUS
JAVELIN_system
equivalences,
English
clauses
filter
automatic_evaluations
word-lemma_based_feature_function_models
have
estimated
German_text_corpora
Bayesian_semi-supervised_Chinese_word_segmentation_model
aid
text
linguistic_structure
consider
connectionist_(neural)_network
