""
""CatVar""
""I05-3016.13
%
',
's
(
(1)
(89.1%
(96%)
(CEA)
(CMs)
(DATR)
(GTPC)
(I'KTN)
(IV)
(LFG),
(LSA),
(ME)
(MRDs)
(MT)
(MWE)
(NEE)
(NLP),
(P98-2175.24
(Portuguese)
(SIDGrid)
(both
(e.g.
(e.g.,
(of
(uniform
(whose
)
/baseNP
0.6%
1
10
10%
10,000
100%
100-
1000
117,000
1200
126
15,000
18.5%
2
2002
2004
28.29%
3
30
35,000
39,000
4
40,000
450
50
500,000
56.88%
62%
7
71.16%
71.81%
77-80%
78.43
80%
84%
99%
=
A
AI
Accuracy
Accurate
Achilles,
Acquiring
Acquisition
AdaBoost
Adaptation
Advanced
Aided
Algorithm
Algorithms
Alias
Alignment
Amharic
An
Analyses
Analysis
Analyzer
Anaphora_resolution
And
Application
Applied
Approach
Arabic
Arabic-
Architecture
As
Association
Augmenting
Automatic
Automatic_Evaluation
BLEU,
Bank
Based
Bayesian
Between
Bilingual
Biomedical
Brants
British
Brown_Corpus
Brown_corpus
By
CELEX
CRF_models
Case-
Case_Study
Categorial_Grammar
Categorization
Character
Chinese
Chinese word segmentation
Chinese_Word_Segmentation
Church's
Classification
Classifier
Co-occurrence
Cohesion
Collection
Collocation
Combinations
Combinatory
Combining
Communicator
Comparable
Component
Composing
Computational
Computing
Conceptual
Conditional
Configurable
Constraints
Context
Conversational
Conversion
Coreference_Resolution
Corpora
Corpus
Correction
Coverage
Czech
DARPA
DATE
DUC
Data
Database
Decoding
Description
Design
Developing
Dialogue
Dictionary
Direct
Disambiguation
Discourse
Document
Documents
Domain
Duration
Dutch
Earley-type
Efficient
English
English-
English-to-
Enhancement
Entity
Entropy
Environment
Error_Analysis
European
Evaluation
Events
Experiments
Expression
Extensions
Extracting
Extraction
F-measure)
Feature
Features
Fields
First,
Fl
Focus
For
Fragments
Framework
French
French-W08-0327.9
French-to-C88-1031.25
Frequency
From
Functional
Fundamental
GENIA
Gale
Gazdar
Generation
Generic
German
Given
Global
Grammar
Graph-W06-0205.3
Graph-based_Approach
Guidelines
HPSG
Headline
Hiero-like
High-quality
Homogeneity
Homophone
HowNet
Human-Human
HybridTrim
I
IBl
ITG
Identification
Improving
In
Including
Independent
Indexing
Indirect
Inference
Information
Information Retrieval
Information_Extraction
Information_Retrieval
Information_Retrieval_systems
Information_extraction
Infrastructure
Input
Integration
Inter-linked
Interaction
Interactive
Interpretation
Italian
Japanese
Jelinek
June-2000
Keyword
KnowNet
Knowledge
Knowledge_Base
Knowledge_Representation
Knowledge_Sources
Korean
Korean-C02-1086.19
LCS-based_approach
LINGSTAT
LVCs
Language-
Large-W04-2003.4
Latent_Semantic_Analysis
Latent_semantic_analysis
Learning
Learning Approach
Letter-to-N07-1047.3
Lexical
Lexical-
Lexical_Chains
Lexical_knowledge
Lexicon
Library
Linguistic_Analysis
Linguistic_Theory
List
Logical
Lowest-
MT_systems
MUC
MUC-3
MUC-4
MUC-6
MWE
Machine
Machine-
Machine_Learning_Approach
Machine_Translation
Machine_Translation_System
Malt-W08-2128.15
Management
Mandarin
Mapping
Markov_Model
Markov_models
Maximum Entropy
Maximum_Entropy
Maximum_Entropy_Model
Measure
Measures
Mechanisms
Meta-Annotators
Method
MoBiDic)
Model
Modeling
Models
Modern
Mongolian
Morphology
Multi-
Multilingual
Multimodal
Multiple-
NER
NL
NLG
NLP
NLP System
NLP system
NLP_Applications
NLP_applications
NLP_system
Name
Named
National
Natural Language
Natural Language Processing
Natural_Language
Natural_Language_Generation
Natural_Language_Processing_systems
Network
News
Newspaper
Novel
OCR-Error
October-2001
Of
Of-
On
OntoSelect
Ontology
Optimised
Orientation
Oriented
PAKTUS
PCFG
PENN
PERQ's
POPEL
POS_tagging
PTGC
Palpable
Parse
Parser
Parsing
Parsing_Algorithm
Part-
Partial
Penn
Penn Treebank
Penn_Treebank-trained
Performance
Personal
Phonetic
Phrase
Pipelined
PoS,
PoS_tags
Portuguese
Pragmatic
Predicate-C04-1204.3
Princeton's
Probabilistic
Probabilistic_Model
Probability
Problem
Procedure
Process
Processing
Project
Prop-
Prose
Prosodic
PubMed
Question Answering
Question_Answering
Question_Answering_System
Question_Answering_system
Questions
RITEL
ROUGE
RTN
Random
Raw
Recall
Recently
Recognition
Recovery
Relations
Reordering_Model
Representation
Research
Rich
Robust
SRA's
SRI
START
SVO,
SYSTRAN
Search
Section
Segmental
Selective
Semantic
Semantic_Analysis
Semantic_analysis
Semantics
Sense
Sense Disambiguation
Sense_Disambiguation
Sentence
Several
Shared
Shared_Task
Similarity
Single
Solving
Spanish
Speech
Speech_Act
Speech_Recognition
Speech_recognition_systems
Spoken
Spoken_Language
Spoken_Language_System
Statistical
Statistical_Machine_Translation
Statistical_machine_translation_systems
Story
Strategies
Structure
Structures
Study
Style
Supertag
Switchboard
Syntactic
Syntactic_Information
System
Systems
TCT
TREC-3
TREC-4,
Tagged
Tagging
Task-
Term
Terminology
Testbed
Text
Text Summarization
Text_Analysis
Text_Categorization
Texts
Textual
The
Their
Theory
TiGer
Time
To
Tool
Topiary
Topic-
Training
Transition
Translation
Translation System
Translation_System
Treatment
Tree
TreeBank
Ttecursive
Tuna
Type-
UPenn
Understanding
Unsupervised
Used
Using
Utterance
VAQA
Verbs
Verification
Viterbi
Vocabulary
WMT2006
WSD
WSJ
Wall_Street_Journal
With
Word
Word Segmentation
Word Sense Disambiguation
WordNet,
WordNet-based_models
Word_Alignment
Word_Sense_Disambiguation
Words
Workshop
World_Knowledge
Written
XML
XSLT-based
a
abilities
able
about
above
abstract
abstracts
accent
accordance
according
account
accuracy
accurate
achieve
achieved
achieves
achieving
acoustic
acquire
acquired
acquisition
across
actions
active learning
actual
adapted
added
addressed
addresses
adopted
advanced
advanced-level
advantage
advantages
adverbs
against
agents
agglutinative
agreement
aimed
al.,
algorithm
algorithm,
algorithms
algorithms,
aliases
aligning
alignment
alignment_models
alignments
all
allow
allowing
allows
almost
alone
also
alternating
alternations
alternative
alternatives
altogether
always
amalgamating
ambiguities
ambiguity
ambiguous
amounts
an
analogies
analyses,
analysis
analytics
analyze
analyzed
analyzer
analyzer,
analyzers
anaphora
anaphora_resolution
anaphoric
anchor texts
anchor_texts
and
annotated
annotation
annotator
any
anytime
appear
applicability
applicable
application
applications
applied
applies
apply
applying
appreciation
approach
approaches
approaches:
appropriateness,
approximately
arc
architecture
architecture,
architectures
archiving
are
area
argues
argument structure
article
as
aspects
assign
assignment,
at
attachment
attempt
attempts
attention
attributable
attribute
audio
augmented-LR
automate
automatic
automatic_evaluation
automatic_speech_recognition
automatically
available
average
bag-of-words
base
based
bases
basic
basis
be
because
become
been
behavior
behavioral
behaviors
being
below
benefits
best
best-first
better
between
bi-
biased
biases
bigram
bilingual
binary
biological
biomedical
bipartite
bitext
blackboards
both
bottleneck
bottom-up
boundaries
branch
brief
build
built
bundles
bus
but
by
called
came
can
can't
candidates
capable
capacity
capture
carried
case
case-based
case-study
cases
categorial
categories
categorization
causal
cause
central
certain
chain
challenge
challenges
challenging
chance
change
changes
character
characteristics
characters
chemistry
choice
chosen
chunking
chunks
citation
citizen-to-administration
class
class-
class-based_models,
classes
classical
classification
classification,
classification_model
classifications
classifier
classifier,
classifiers
classify
classifying
clausal
closed
clustering
clusters
coherence
coherent
collecting
collection
collections
collocation
collocations
combination
combinations
combinatory
combine
combined
combines
combining
common
communication
comparable
compared
comparing
comparison
competitive
compilation
complete
completion
complex
complexity
component
components
components,
composed
composing
compositionality
compression
comprises
computation
computational
computational_linguistics
computationally
compute
computer
computers
computing
concatenation
concept
concept-to-speech
concepts
conceptualization,
concern
concerned
concerns
conditional_probabilities
conditional_random_field
conditional_random_field-based
conditional_random_fields
confidence
configurations
configure
confirmation
connects
consider
considered
considers
consist
consistency
consisting
consists
constantly
constituent
constituents
constrain
constraint
constraint-based
constraint-logic
constraints
constraints,
construct
constructed
construction
constructions
contain
contains
content
content_words
context
context,
context-dependent
context-independent
contexts
contextual
contextual_features
contextual_information
continuous
contribute
contribution
contributions
control
conversation
conversational
conversations
conversion
convert
coordinate
coordinated
coordination
core
coreference resolution
coreference_resolution
coreference_resolution_system
corpora
corpora,
corpus
corpus-based
corpus-oriented
correct
correcting
correctly
correlation
correspond
correspondence
correspondences
corresponding
cost
cost-based
could
counts
coupling
coverage
create
created
creating
creation
criteria
critical
cross-document
cross-domain
crucial
cues
current
currently
cycle
data
data,
data-driven
database
databases
datasets
deal
dealing
deals
deception
decide
decision
decision-making
decisions
declarative
declaratively
declines
decoding
decrease
dedicated
defaults
definite
degrees
demonstrate
demonstrated
depend
dependencies
dependency
dependency structure
dependency-based_model
dependency_relations
dependency_structures
dependency_tree
dependent
depends
deprived
derived
deriving
describe
described
describes
describing
description
descriptions
descriptors
design
designed
detailed
detect
detection
determined
determining
deterministic
developed
developed,
developing
development
devices
dialog
dialog-related
dialog_system
dialogs
dialogue
dialogue act
dialogue_act
dialogue_acts
dialogue_system
dialogue_systems
dialogue_systems,
dialogues
dictionaries
dictionary
dictionary,
dictionary-based,
dictionary-based_method
dictionary-based_systems
differences
different
differentiating
differs
difficult
difficulties
difficulty
dimensions
disambiguate
disambiguation
disappears
discourse
discourse_analysis
discourse_structure
discourses
discovers
discriminative
discuss
discussed
discusses
discussing
discussion
disjunctive
distinction,
distinctions
distinguish
distribution
distributions
diverse
document
documentation
documents
documents,
does
domain
domains
done
double
draft
draw
duration
durations
during
dynamic
dynamic_programming
dynamic_programming_algorithms
each
earlier
effect
effective
effectively
effectiveness
effects
efficiency
efficient
effort
efforts
electronic
elevated
elliptical
embodies
embodying
empirical
employ
employed
employs
emptied
encode
encoded
encoding
end
engine
enhances
enhancing
ensemble
entails
entire
entities
entity
entity types
entries
environment
equations
equivalent
erroneous
erroneous-correct
error
error_rate
errors
especially
essential
established
estimate
estimated
estimating
estimation
et
evaluate
evaluated
evaluating
evaluation
evaluation_methods
evaluation_metric
evaluation_result
even
event
events
ever-increasing
evidence
examine
examined
example
examples
except
exceptions,
exclusively
exercises
exhibit
exhibited
exist
existing
expansion
expected
experiment
experimental
experimented
experiments
exploited
exploiting
exploits
explosion
exponential
express
expressions
extension
extensions
extensive
extent
extractable
extracted
extracting
extraction
extraction system
extraction_system
extraction_systems
extractor
facilitate
facilitates
fact
factorial
factors
failure
fast,
faster,
feasible
feature set,
feature_selection,
features
feedback
few
field-based
fields
figures
find
fine-grained
finely
first
fixed
flexible
flexibly
focus
focused
focuses
following
follows,
for
for,
forecasts
form
formal
formalism
formalisms
formations
forms
foundation
four
fragments
frames
framework
frequencies
frequency
frequently
from
full
fully
function
functional
functionality
fundamental
further
fusion
gain
gaps,
gathered
gave
gene
general
generality
generalization
generally
generate
generated
generates
generating
generation
generation_system
generative_models
generator
genre
gestures
get
give
given
gives
global
goals
gold_standard
gold_standards
good
goodness
grammar
grammar induction
grammars
grammatical
graph
grapheme-to-phoneme
graphics
graphs
gratis
great
greedy
group
grouping
growing
growing,
guide
guided
guidelines
hand
handled
handling
hands-on
handwritten
haptic
has
have
having
headings,
headlines
hence
hidden
high
high quality
high-precision
high-quality
higher
highest
highly
homogeneity
homophone
hours'
how
however,
huge
human language
human-computer
human-human
human-produced
human_languages
hundred
hybrid
hypothesis
identification
identified
identifies
identify
identifying
idiom
idiomatic
idioms
impact
implementation
implementations,
implemented
implementing
important
important,
improve
improved
improvement
improvement,
improvements
improves
improving
in
in,
in-vocabulary
include
included
includes
including
incorporate
incorporation
incorrectly
increase
increases
increasing
incremental
indefinite
independent
indexing
indicated
indicating
individual
induced
inducing
induction
inferencing
inflectionally
influence
information
information extraction
information retrieval
information structure
information,
information_extraction_system
information_gain
information_retrieval
information_sources
information_structure
information_structures
infrastructure
initiatives
input
insights
instances
instead
instruction
integral
integrated
integrating
integration
intelligent
inter-
inter-linked
interaction
interactions
interactive
interdisciplinary
interface
interfaces
interjudge
intermediate
internal
interpretation
interpretations
interpreting
into
intonation
intra-annotator
introduce
introduced
introduces
introduction
inventory
investigate
investigated
investigates
investigation
investigations
involve
involves
is
issues
it
item
items
its
joint
jointly
journal
judgments
kernel_methods
know
knowledge
knowledge-base
knowledge-based
knowledge_base
knowledge_bases
knowledge_source
knows
labeled
labelling
labels,
lack
language
language-independent
language-oriented
language;
language_model
language_model-based
language_modeling
language_models
language_pairs
language_processing
language_processing_system
languages
large
large-scale
largeL08-1189.5
largely
larger
last
latent
latest
latter
lattice
layers
lead
leads
learned
learner
learning
learning_algorithm
learning_approach
learning_method
leaves
led
lemmas
lemmatization,
lemmatizer
length
lengthy
less
letters
level
levels
leverage
lexi-calized
lexical
lexical,
lexical_choice
lexical_entries
lexical_entry
lexical_features
lexical_information
lexical_items
lexical_resources
lexicalist
lexicography
lexicon
lexicon-based
library
libre,
life
life+s)
light
likely
limitations
limited
limits
linear
linear-chain
linear_models
linguistic
linguistic features
linguistic resource
linguistic,
linguistic_analyses
linguistically
linguistics
linguists
linking
list
listening
lists
live+s
lives
local
logic
logical
long
looking
low-level
machine
machine translation systems
machine-tractable
machine_learning
machine_translation
machine_translation_system
machine_translation_systems
macro
made
main
mainly
major
make
makes
manages
manual
manually
manuals
many-to-many
map
mapping
mark-up
matched
maximization
maximum entropy
may
meaning
means
measure
measures
mechanism
mechanisms
medical
medline
megabytes
memory
memory-based
merging
message
method
methodological
methodologies,
methodology
methods
methods,
metonymie
metrics
million
million-word
minimize
minor
miscellaneous
misinterpreted
mixed-initiative
model
model,
model-based
model-theoretic
model_parameters
modeling
models
moderately-broad-coverage
modern
modifiers
modular
module
modules
monolingual
mood
more
morphological
morphological_analysis
morphological_features
morphology
most
motivated
much
multi-document
multi-document_summarization
multi-field
multi-level
multi-lingual
multi-modal
multichannel
multiclass
multidimensional
multilayered
multilingual
multimedia
multimodal
multiple
multiword_expression
must
n-gram
n-gram_models
named
namely
names
narrative
natural
natural language
natural language processing
natural_language
natural_language_generation_system
natural_language_interface
natural_language_processing
natural_language_systems
nature
needs
net
networks
neutral
new
news
newspaper
nlg
nlp
node
nodes
non-speech
normal
not
notation
note
noun phrase
noun_phrases
nouns
novel
nowadays
number
nursing
object
objective
objectives:
obtain
obtained
obtaining
obtains
occur
occurred
occurred,
occurrence
occurring
of
often
oj
on
on-going
one
one-to-one
ones
ongoing
online
only
ontological
ontologies
ontology-centric
open
open,
operation
operations,
or
oral
order
order-sensitive
ordering
ordinary
organizations
organized
organizing
oriented
original
originate
orthographic
orthography,
other
other,
our
out
out-of-domain
outline
outlines
outperform
outperforms
output
outputs
outrivals
over
overall
overview
page
pages
pair
paired
pairs
pait-ol'-E91-1004.31
paper
paper,
papers
paradigm
paragraph
parallel
parallel_corpora
parallel_corpus
parallel_texts
parameter
parameters
paraphrasing
parentheticals
parse
parse_trees
parsed
parser
parsers
parses
parsing
part
part-of-speech
part_of_speech_tag
partial
partially
participated
particular
particularly
partitioning
path
pattern
patterns
per
perform
performance
performance_improvement
performed
performing
performs
personal
phenomena
phoneme
phonemes
phonetic
phonological
phonologicalP98-2171.36
phrase
phrase-based_model
phrase_structure_trees,
phrases
picture
pipeline
pipelines
pitch
plan-based_model
platform
play
plays
portable
positional
possibilities
possible
post-evaluation_results
post-processor
posts,
power,
powerful
practical
practice
pre-processing
precise
precisely
precision
predicate_argument_structure
predict
predicted
prediction
predictions
predicts
preferences
preliminary
prepositional_phrases
prepositions
preprocessing
prerequisite
present
presentation
presented,
presents
presupposed
previous
previously
primary
principally
principle
principles
probabilistic
probabilistic models
probabilistic_model
probabilistic_models
probabilities
probability
problem
problem,
problems
problems,
procedure
procedures
proceeds
process
process,
processed
processes
processing
processor
produce
producing
profiles
program
programming
programs
progress
project
promising,
pronominal
pronoun
properties
property-labels
proposal
propose
proposed
proposes
propositions
prose
prosodic
prosodie
prosody
prototype
prov-ably
prove
provide
provided
provides
published
pure
purposes
qualities
quality
query
query expansion
query-oriented
query_expansion
querying
question
quite
radically
range
ranging
ranking
rarely
rate
rates
raw
re-calculated
read
readings
real
real-time
realisation
realizations
realize
recall
recent
recently
recognition
recognition-based
recognition-based_approach
recognize
recognized
recognizer
reconciled
recorded
recorded,
recordings
records
records,
reduces
reduction
reestimation
reference
references
referential
referring
refinement
refining
regarding
regards
regular
regularities
regularity
related
relations
relationship
relationships
relative
relatively
relevant
reliable
reliably
relies
relying
remaining
rendering
reordering_models
repairing
repeatable
repeatedly
replaced
report
reported
reporter-specific
reports
repositories
represent
representation
representations
represented
representing
required
requirement
research
research_project,
resolution
resolve
resolves
resource
resources
respect
restricted
result
resulted
resulting
results
retain
retrieval
retrieved
reverse
review
reviews
revision
revisits
rhetorical
rhetorically
rich
right
risk
robust
robustness
role
rooted
rote
route
rule
rule-based
rule-based,
rule-based_method
rules
rules,
run
running
same
sample
samples
scenarios
schema
schemas
scheme
schemes
science
scientific_literature
scope
score
search
search_algorithm
searching
section
seed
seem
segment
segmental
segments
select
selected
selection
self-training
semantic
semantic analysis
semantic interpretation
semantic_analysis
semantic_classes
semantic_features
semantic_information
semantic_informations
semantic_interpretation
semantic_interpretations
semantic_properties
semantic_relations
semantic_representation
semantic_representations
semantic_structure
semantically
semantically-related
semantics
semi-automatic
sense
sense disambiguation
sensitive
sensitivity
sentence
sentence-aligned
sentence-external
sentence-internal
sentences
separate,
sequence
sequences
sequential
serve
set
set,
sets
seven
several
shallow
shareable
shared-task
shifted
should
show
showed
shows
signal_processing
significance
significant
significantly
similarity
simple
simpler,
simplified
simulated
single
situate
situations
six-times
size
sized
sizes
sliding-window
slightly
small
smoothed
soft
software
solely
solutions
solving
some
source
source language
source-side
source_sentence
sources
space
spatial
spatially
speaker-dependent
speaking
special-purpose
specific
specifically
specification
specifications
specificity
speech
speech recognition
speech,
speech_recognition
speech_synthesis
speech_translation
speech_understanding_system
speed
spoken
spontaneous
spontaneous_speech
stage
stage,
stages
stages:
standard
standardized
standards
state-of-the-art
statement
stateof-the-art
statistical
statistical_machine_translation
statistical_methods
statistical_model
statistical_models
statistically
statistics
status,
step
stochastic
storage
stories
strategies
strategy
stream
strength
string
structural
structurally
structure
structure,
structuring
studies
study
study,
stylistic
stylistics
sub-tasks
subcategorization
subfield
subjective
subjectively
sublanguage,
submissions
submitted
subroutine
subsequent
subsets
substantial
substantially
substring
substructures
success
successfully
successive
such
suffer
suffixes
suitable
suite
suited
summaries
summarization
summarizes
summary
supertag
supertagging,
supertags
supervised
support
support_vector_machine
support_vector_machines
supported
supports
suprasegmental
surface
surprisingly
syllable-to-character
syntactic
syntactic,
syntactic_analysis
syntactic_features
syntactic_information
syntactic_representation
syntactic_structure
syntactical
syntax
syntax-free
synthesis
synthesizer
system
system,
system_architecture
systematic
systems
systems'
systems,
sytem
tag
tagged
tagger
tagging
tags
take
taken
takes
taking
target
target language
target_languages
task
task-oriented
tasks
taxonomy
technical
technique
techniques
techniques,
technologies
technology
telephone
template
temporal
temporal_relations
term
term-based
test
test set,
test_set
tested
testing
tests
text
text generation
text-based
text-to-speech
text_analysis
text_classification
text_processing
text_retrieval
text_structure
texts
texts,
textual
textual,
than
that
that,
the
theW05-0617.18
their
them
then
theorem
theoretical
theory
there
these
these,
this
those
three
thresholds
through
thus
tightly
time
to
today's
token
tokenization
tokenization,
too
tool
tools
tools,
top
top-down
topic
topics
topology
total
touch
towards
traditional
traditionally
train
trained
training
training_corpus
transcribed
transcription
transcriptions
transcripts
transfer
transferi-oriented
transformation
transformation-based
transformations
transforming
translated
translating
translation
translation system
translation_system
translation_system,
translation_systems
translations
transparent,
treating
treatment
treatments
tree
tree-bank
trees
trivial
tuned
tutoring
two
two-level
two-stage
type
typed
types
typically
typology
un-supervised
unambiguously
unanalyzed
under
underlying
underspecified
understanding
understated
understood
unexpected
unification
uniform
unigram
unit
unknown
unknown_words
unlabeled
unlabelled
unlimited
unstructured
unsupervised
untagged
up
upon
use
used
useful
usefulness
user
user-friendly
uses
using
usually
utility
utilizes
utilizing
utterance
utterances
valence
valid
values
variable
variables
variation,
variations
variety
various
vary
vector
vector-based_models
vector_space_model
verb
verb_classes
verbs
verbs,
verification
version
very
via
video
viewed
vocabulary
volume
voting
was
ways
we
weather
web
web document
web_documents
web_page
web_pages
weblog
weigh
weight
weighted
weights
well
well-formed
well-known
were
when
which
whole
whose
wide-coverage
wiki-based_systems
will
with
within
without
word
word models,
word segmentation
word sense
word sense disambiguation
word-alignment
word-association
word-lattice
word-reordering
word-sense_disambiguation
word_alignment
word_segmentation
word_sense_disambiguation
words
words,
work
works
world
world knowledge
would
written
xml
yield
yields
zero
