dictionary-based_word_vectors
newspaper text,
purpose
Japanese_sentence_structure
(Bikel,
discovered
maximization
intuitive
linguistic_structures
unification-based_parsing
explanation_system
Similarity-driven_Transfer_System_(SimTran),
multi-component_architecture
morphological_constructions
SVM_learning
bootstrapping_approach
hoc
GPSG
data_representations
language_identification
MT_systems
Procedural_Systemic_Grammar
underspecified_semantic_representation_(USR)
0(n)_time
information_extraction_tasks
Japanese_patent_claim_sentences
spoken_language_understanding
elaborated
model_checking
input
training_speakers
word-sense_disambiguation_systems,
human
groupings
translation_knowledge
integrating
Presentor
TAGs
system_performance
English_questions
electronic_discussions
Log-linear_models
parsing_technique
formal_language
semantic_verb_classes
commonsense_reasoning
manual_transcription
effectively
unambiguous_structures
Collins_(2000)_reranker
model_design
NL_evaluations
users
widely
technique
conversation_transcripts
IBM_translation_models
useful
class-oriented_framework
al.
Translations
written_texts
likelihood
military_and_civilian_systems
success,
HMM-based_chunk_tagger,
free_word_order
syntactico-semantic_(tectogrammatical)_annotation
performing
ranking_problems
alignment_adaptation_approach
Chine_language
EM_algorithm
benefit
collocations
Korean_and_English_language_pairs
use
word_segmentation
[ANA]
MBR_decoding
arbitrarily
TiMBL,
naturally
79.1%
target_document
clues
translation_quality
heuristic_rules
habituality
language_independent_modules
stages
helping
computational_linguistics
to
~
cross-lingual_comparisons
synthesizes
labeled_directed_graph
like
capability
abstraction
variable
thematic_grid_tagging,
characterized
module
Japanese_Dictionary_Task_in_SENSEVAL2
MSR- closed
exact_match_accuracy
sense_priors
POS_learning
efficient
formal_intersections_of_FSAs
(Biber,1993;
kinds
so
Natural_Language_Processing_(NLP)_system
natural_language
WSD_programs
standalone_system
incremental_probabilistic_parser
represented
probabilistic_finite_automata
generated
Topic_signatures
usually
Longman_Dictionary_of_Contemporary_English
candidates
speech_and_text-image_recognition
polysemy
target
overcome
incorporated
sharing
tie
decision_strategies
alternative_markers
magnitude
user-specified
temporal_expressions
distributions
translation_accuracy
field_structured_text
traditional_knowledge-based_techniques
extracted_field
NP-complete
strengths
common_text_processing_modules
comparative
113K
account
significant
CoNLL_2008_shared_task
times
acquired
averaging
CFG_parsers
calculus
Polish
Nagao,1993;
verb_final_language
Markov_model
via
sentential_paraphrases
combines
relational_database
captures
morphological_and_syntactic_information
20k
volume
decision_tree
recognizing
sentence_plans
phrase-based_unigram_model
robust_explanation_system
express
ordinary
passed
Machine_Translation
lend
four
test_language
make
framework
Minimum_Bayes-Risk_(MBR)_decoding
own
knowledge-based_generation_systems
occurring
restricted_vocabulary
allows
compositional_interpretation
vagueness
grammatical_gender
regular_expressions
case-based_MT_(CBMT)
who
approximation_error
syntax
semantic-oriented_NLP_applications
extended
moment
semantically_related_words
written_and_spoken_language
text_processors
PCFG-LA
temporal_connective
parallel_corpus
natural_language_generation
better
software_library
paraphrasing
denotational_semantics
retrieval_approach
MT,
aligned_bilingual_corpus
compositionality
12.5%
expensive
subcategorization_cues
facilitate
RCL_parsers
linguistic_theory
though
Chinese_text_corpora
spoken_language_technology
global_meaning
)
bigram_back-off_language_models
Koskenniemi,
evaluation_method
part-of-speech_annotation
depend
performance
Hidden_Markov_Model
have
evaluation_metrics
varied
information_flow
describing
RINA,
discovering_parallel_sentences
bottom-up_pattern-matching_parser
human_plausible_reasoning
maintains
WordNet,
biomedical_and_linguistic_ontologies
Isomorphic Grammars
Message_Understanding_Conferences
against
Conrath
arbitrary
PCFG-LA model
knowledge_engineering
semantic network
available
machine_learning_approach
natural_language_processing_(NLP)_systems
continuous_speech_recognition_(CSR)_techniques
block_selection_criteria
context_free_languages
bilingual_parallel_corpus
multilingual,_multimedia_data
support
human language learners,
processes
computationally
speaker_adaptation_(SA)
linguistically
topical report,
final
semantic_equivalence
data_retrieval
systems
cognitive_psychology
KL-Conc,
expression
problematic
Machine_Translation_(MT)_systems
embodied
computational_lexicon
coarse-grained_concepts,
PER
attentional_state
Words
language_learning_model
alignment
nominal_compounds
various
types
conditional_loglinear_models
Boolean_conditions
aware
stereotyped_text_structure
pronominal_anaphora_resolution_module
Penn_WSJ
monolingual_and_bilingual_information
associative_relationship
logical_model
under
departure
adopts
dictionaries_of_word_forms
grammar_sensu_stricto
–
large_corpora
node_structures
Turkish
verbs
derivations
interactive_question-answering_(Q/A)_system
general-purpose_NLP_components
parsing-based_NE_rules
carry
regular_languages
will
feature_selection_methods
bilingual_corpora
compare
23,000
determiners
qualitative_spatial_constraints
distributed_message-passing_infrastructure
much-studied
conceptual
Named_Entity_(NE)_tagging
disambiguation_tool
ranking
communicative_signals
system's_output
industry_watch
automatic_language_identification
(from
restricted_natural_language
concrete_noun
parse_trees
members
reduced_IL_formulae
lexical_methods
error_rate
word_segmentation_problem
event_structure
worse
event_terms
HDAG_Kernel
source_interval_projections
fully-connected_first-order_statistical_class_grammar
well
construct
summary_generation
pivot
part
training_material
crossing_liaisons
circuit_specifications
naming_conventions
second_language_and_cognitive_skill_acquisition
35.0%
Nigam
automatically,
convolution_kernel
flexible_parser
SVM
blocks
discriminative_training_criterion
errors
coherence_assessment
ambiguous
word_alignment
German_pronouns
machine_translation_pipeline
system_output
yield
Japanese_natural_language_processing_studies
Korean-English_translation
independently
associative_similarity
syntactic_structure_information
Czech
classifiers
automatic_discovery_of_text
the
event_map
hypothesis
function_words
source_language_text
depending
firmly
training_and_test_data
create
advantages
tractable
trainable_sentence_planner
backwards_transliterations
80.5%
weather
pooling
target speaker
unique
complex_sentences
generation
Japanese_text
oriented
input_dataset
Topic_Detection_and_Tracking_tasks
best
(for
text_classification_problems
two-step_clustering_process
tracks
polysemous_word
well_calibrated_probabilities
Sentence_boundary_detection
tend
synchronous dependency parser
translation_memory_system
simple
statistical_parameters
machine_learning_techniques
complex
seem
never
semantic_interpretation
Intra-sentential_quality
translation_relation,
reduplication
principle-based_theory
scruffy_texts
speech_synthesis_systems
zero pronouns
defeasibility
among
n-best_speech/language_integration_architecture
terminology_structuring
syntactic_behavior
relevance
specified
each
textual
information workers
describe
TAP-XL_Automated_Analyst's_Assistant
methods
XTAG
management_of_uncertainty
pieces
scoring
French_tenses
consist
pronoun_"it"
KL-ONE_style_representation
results
certain
domain_independent_features
wide
transliteration_process
segment-based_approach
grammatically_correct_input
GLOSSER
audio_and_scanned_image_data
IR,
concept-concept_matrix
consistency_problem
corpus
also
run
non-literal_aspects_of_communication
chart-based_phrase_structure_parsing
statistical_alignment_models
transformation_model
gives
<
converge
heuristic_learning
interpolation_methods,
77%
generation_problem
recognition_network
(e.g.
such
feedback
space
phrase_boundary_heuristics
requirements
inferred
knowledge-based_mechanisms
unlexicalized_PCFG_parser
disjunctions
necessary
small
discourse_understanding_process
significance
HK-closed,
etc.,
Japanese_parsers
morpho-syntactic_and_semantic_characteristics
lexical_coverage
detect
advances
improvements
expert_systems
inflection
explanation_generation
TL
anaphora_references
assignments
news_articles
Temporal_Expression_Anchoror_(TEA),
quantified_sentences,
punctuation
Chinese_word_sense_disambiguation_model
direct_orthographical_mapping_(DOM)
easy
transition_graphs
all
interlingua
simplify
track
SI_corpus
genres
example
observed
reference
natural_languages
grammatical_formalisms
morphological_analysis_problem
pragmatics_processing,
linguistic_domain
CSR
word_clusters
Boolean_matrix_multiplication_(BMM)
textual_representation
about
focussed
attentional_focus
Situation_Theory
SI recognition,
Southern_Min_Chinese
task_representation
context-free_parsing
Wizard_of_Oz_technique
LMs
proportion_problem
specialized_parsing_techniques
ambiguous wordform,
adaptive_learning_procedure
dialogue_acquisition_and_tracking_algorithm
WH-questions
machine translation (MT) systems
Arabic_word_segmentation_system
itself
segmented_strings
full_parsing
be
produced
CriterionSM_Online_Essay_Evaluation_Service
flexible_parsing
sentence_analysis
in
approach
nodes
parsed_corpus
lexicalized_grammar
surface_realizations
lexical_approaches
feature_weighting_and_selection_function
Spoken_Language_Systems_(SLS)
accuracy
connectionist_(neural)_network
showing
multisentential and multi-paragraph explanations
unsupervised learning
voice_input
whose
speech
writing
evaluation
pipelined_NLG_architecture,
English-Japanese,
in-domain_word_alignment
gained
Named_Entity_task
feature_vectors
conditional_log-linear_model,
implemented
Chinese_punctuation_marks,
phonetic_recognition
DoPS_system
Dialogue_strategies
language_modeling_tasks
program
newspaper_corpus
dependency_tree
mobile_military_command_and_control
makes
formulate
minor
derived_string
VME_bus
correlate
log-linear_models
domain-specific_word_alignment
constructing
learners
speech_and_text_image_processing
discourse_constraint
Word_Sketch_Engine,
machine_translation_system
discriminative_log-linear_models
usefully
EM-algorithm
KPSG
allow
advantage
made
shallow_linguistic_features
relevant
encyclopedia,
was
induced
semantics
prosodic
morphological_analyzer
subcategorization_frame_(SCF)
latent_variable
requires
abductive_inference
CAS
expected
Information_Bottleneck
tests
original
rule-based_translation_systems
one
an
translation_lexicons
cepstrum-based_features
phrase
idiosyncrasies
display_of_graphical_information
utilizes
Dutch_Senseval-2_test_data
decoding
generate
lower_bound_estimation
numerous
packed
training_data
categorization_task,
Acoustic_modeling
Prolog
English-Japanese_machine_translation,
vector_space_model
define
placement
relative_frequency_of_occurrence
rule-based_learning_algorithm,
goal
word_graph
unsupervised_learning_algorithm
determination
natural_language_processing_systems
scenario_templates
application
discourse_task
published
differ
information_retrieval_techniques
constituent_parts
fourteen
typed_feature_structures
dialog_schemata
probabilistic_Horn_clauses
commonly
takes
its
formulas
preceding_words
training_and_testing_factors
document-oriented_applications
improvement
manually_sense-tagged_data
rank,
corpus-based_method
WSD_task
questions
human_judgment
error-correction_rules
HTML_documents
natural_language_generation_community
multilingual_speech_and_language_applications
sentence_plan
content_words
statistical_and_constraint-based_disambiguation
analogies
pronoun_il
unification-based_grammatical_frameworks
RCL_parser
sentence_extraction
automatic_evaluations
robustness
priming
studied
model_parameters
n-ary_relations
broad_coverage_lexicon
aims
domains:
resolve
phrase_structure_grammar
bare_slice_disambiguation
LEXSYS
live_closed_captions
Lexical-Functional_Grammars_(LFG)
practical
Information_Extraction
LM
program,
integrate
common
containing
presence
root_word_lexicon
interactive_problem_solving
real
techniques
English
stems
(
word_significance_(weights)
evaluating
ungrammatical input
ASR
parse-trees
expectations,
crossed_serial_dependencies
electronic_newsgroup_discussions
documents_with_signal_content
linear_logic
F-measure
resemble
synonymous expressions
largely
psycholinguistic_literature
error
n-gram_statistics
unsupervised_learning
traditional_deterministic_parsers
temporal_logic_CTL
dialog_model
hard_problems
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
duration_model
or
structural_information
scratch
sentiment_vector_space_model_(s-VSM)
Node-based_inference
structure-sharing_of_graphs
consider
1983;
CFG_parser
including
contain
A_deterministic_parser
comes
aid
"conventional"_context-free_morphological_grammar
machine-readable_resources
strong
lexicalised
word-to-word_alignments
most
domain_knowledge
structured_databases
systemic_grammar
large_Czech_MWE_database
single-snippet_answers
rank
--
speech_processing,
correlation_measure
Semantic_theories
graphics_displays
pos_tag_ambiguity
sentence
representation_tree
frames
augmented_Friedman_-_Warren_algorithm
Grosz-Sidner-style_focus_model
intense
Polymorphemic_stems
Smadja,1993)
compounds
uniform_processing
sequences
human-machine_interactions
included
similarity
word-based_system
unrestricted_texts
declarative
being
WSD_models
suggests
lexical_translations
up
domains
superior
inevitable
Chinese_text
TV_shows
tune
configurable
unigram
CFG filter
substitutions
ellipsis
complicated
efficiency
syntax_directed_approach
time_exponential_on_the_size_of_the_grammar
AS-closed,
Human-Machine_Communication
cognito-pragmatic
lemma-based_model
annotate
introduce
effective
control_structure
generators
proper_names
limited
robust_generator
senses
limitations
spoken_dialogue_system
EBMT
MT-based_paraphrasing_technique
board
syntactic_structure_features
HK-open,
confidence
nouns
automatic_estimation_method
meaning-entailing_substitutability
log-linear_combination
time_O(|G||w|3-e)
rule-based_heuristics
spoken_corpora
terms
test_corpus
adapted
restricted_subset
edit_distance
retrieval
coarse-level_clustering
utterance
Chinese_punctuation_marks
generates
monolingual_parallel_corpora
developing
supervised_and_unsupervised_methods
unification-based_grammar_formalism
induced_model
lexical_similarity
large-vocabulary_CSR,
enhance
generate)
obtain
speech_understanding
passives,
conjuncts
sentence-level_semantic_equivalence_classification
particularly
by
clauses
paraphrase
body
distributional_concept-distance_measures
require
grammatical_sentences
multi-pathway_MT_architecture_design
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
dependency_structure
SRI_toolkit
achieve
repository
resolving
transliteration
German_text_corpora
coherence
constraining
segmentation bakeoff
manual_feature_selection
transcribing
weights
word_error_rate_(WER)
parsing_method
spontaneous_speech
natural_language_interfaces
email_communication
directly
consequences
subcategorization_acquisition
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
order
dependencies
ambiguities
topic
dependency_relations
2004)
MWEs
address
virtual_reality_3D_scene_modeling_software
Node-based_inference_rules
building
89.75%
for
independently trained models
computational_model
help
Comparator_software
characterize
database
Korean-to-Japanese_dictionary
traditional
constituent_structure_trees
chunking_performance
shared_lexical_information
tools
candidate
specific_heuristics
shallow_mapping
reference_sets
often
summing
previously
irrelevant
alleviate
boosting_approach
ad
statistical_learning_mechanisms
generalized_metaphor
domain-specific_(in-domain)_word_alignment
gaps
F-measures
decision-tree_classifier
properties
positive_feature_vectors
taggers
superset_of_L
per
instance
noun_phrase_chunks
"one-time_look_up"_method
agglutinative_language
Czech-English_statistical_machine_translation_system
declarative_languages
text_understanding
grammatical_frameworks
English-Chinese_bitexts
InfoMagnets
need
unknown_word
suffix_analysis
verb_forms
unification
two-phase_shift-reduce_dependency_parser
translation_hypotheses
taxonomic_similarity
efficient,
correspond
medium-length
TIPSTER_applications
according
HBG
superordinate -hyponym relation,
CTL
token_classification_task,
abstract
references
feature_structure-directed_generation,
legal_terminology
speech_processing
linguistic_expressiveness
distribution
spoken_language_corpus
SMT_models
accuracy_rate
appear
deterministic_parsers
revision_component
text,
context-sensitive,_phrase_structure_grammar
share
word-based_alignments
concept
discourse_context
interpretation
ideograms
Coedition
classifier
Minimum_Bayes-Risk_framework
linguistic_resources
left_corner_parsing_algorithm
question-answering_NL_systems
language_(L0)
another
subtrees
fast,
salience
vocabulary
IE_module
training_examples
evaluation_measures
000
readily
translation_data
conventionally
means
primitive_Optimality_Theory_(OTP),
EUROPARL_corpus
non-terminals
standard
information_extraction_techniques
summarization
equivalences,
word_tokens
behavioral_patterns
unsupervised_learning_approach
generative_history-based_latent_variable_model
database_query_application
VSM_model
fuzzy_syllogism
exactly
agenda-based_scheduling_parser
formulated
WWER
hypothesize
equivalence
knowledge-based_and_random_selection_procedures
determining
query_terms
pronoun
discourse
hardware_designs
augment
parse_record
GUIs
characters-based_Chinese_collocation_system
enriching
language_tutoring_application
statistical_analysis
rule-invocation_strategies
-speaking
categories
honorifics
definite_clause_grammars
feature-based relation extraction
syntactically_motivated_relations
any
whole
analysis_mechanism
could
syntax_proper
first
interpret
theories
shows
parsing_strategies
constitute
class_of_languages
needs
log(d)_overheads
translation_paths
deal
hard decisions
character
Tree_Adjoining_Grammars
comprehensive
series
'
tree
pronominalization,
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
phrases
(konpyuutaa)
assigning
training_(reference)_speaker
polarity-tagged_corpus
MeSH
discontinuous_constituents
large-vocabulary_speech_recognition
STRAND
potential
(Karttunen,
character-_and_word-segmented_data
adequate
gain
word-sense_disambiguation_algorithm
cooccurrence
IntEx_system
verb-noun_collocation_dictionary_for_Polish
dialogue
conceptual_system
co-occurrence_patterns
move-tagged_abstracts
predictive_questioning
Graph_unification
decision_tree_architecture
generic
multi-strategy_and_multi-source_approach_to_question_answering
statistical_alignment_techniques
-
reversible
subset_of_logic
Bayesian_learning
machine_translation_(MT)_evaluation
compact
names
context-free_phrase-structure_grammar
parse trees
Chinese_word_segmenter
Proposition_Bank_data
retrieval_performance
relationship
PK-closed,
distance
event
searched
effectiveness
candidate_parses
which
four-participants_face-to-face_meetings
seeds
positive_and_negative_definition_examples
presented
text collections
discourses
valid
preceeding
text_model
discourse_segmentation
syntactic_priming
declarative_formalism
research
BLEU
referents
linguistic_annotation
not
language_model
conventional_statistical_methods
bit-vector-based_CKY-style_parser
frequency_classes
augmented
automatic_evaluation_measures
user-directed_summaries
trajectory
5%
consisting
decision_tree_based_approach
Korean_phonological_knowledge_base_system
Penn_discourse_annotation
language_processing_systems
kind
dedicated
real-valued_features
n-gram_transliteration_model_(n-gram_TM),
existence
this
a
whether
natural_language_environment
syntactic_information
together
machine_translation_task
extraction_tool
revealed
corpora
morpheme_sequence
answer
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
lower
semantic_distance
corpus-based sample
finite-state_approximation
textual_domain,
children
chunks_of_words
entailment_relations
unequal
presented,
instance,
outperform
recognition_of_extra-grammatical_input
improves
parse_tree
SL
question/answer_pairs
handling
vocabularies
exploits
known_deterministic_parser
opposed
segment_order-sensitive_methods
rather
IE-enhanced_text_browsers
numbers
Metagrammatical_formalisms
HMM_with_Gaussian_mixture_observation_densities
quantification_over_events
nature
credibility_indicators
question-focused_sentence_retrieval
unpleasant
does
features
strength_of_potential_antecedence
unit
textual_corpora
word-based_collocational_properties
top-down_derivation
entity-oriented_parser
participated
parse_forest
Statistical_Machine_Translation_(SMT)
word_sense_disambiguation
antonymous_adjectives
laboratory_study
generalized_metaphor_mappings
of
ellipsis_resolution
text-to-speech_form
segment_boundaries
Taiwan_Child_Language_Corpus
lexical_conceptual_structure_(LCS)_representations
type
statistical_machine_translation
AS-open,
Turkish_dependency_treebank
integrates
memory-based_learning_chunker
utilizing
extraction_system
further
probability-based_scoring_function
method_to_automatically_acquire_paraphrases
databases
discourse_processing
meaning
topics
modular_architecture
exponential
hierarchical_relations
Japanese_verb_phrases
variant
selected
HDAGs
acquire
linguistic_information
scientific
forward_pass,
few
alternative
convey
labeled
answers
machine-readable_dictionaries_(MRD's)
new
integral
(German-English,
reliable
inferential component
word_order
extensive
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
multimodal_parsing_and_understanding
linguistic_objects
linguistic_PoS_tagger_and_chunker
test_corpora
deterministic_grammar
research_articles
beam-search_decoder
semantic_expressibility
term_extraction
good
latent_variable_model
sequential_models
NP
making
cue_phrases
morphological_component
training_resources
spoken_multiparty_dialogue
lexicons
HBG_model
frequency_counts
single-strategy_parsers
manually_segmented_corpus
hubs
theoretical_linguistic_investigations
rankings
demonstrative_expressions
Dutch
unseen_data
string_similarity
statistical_profile
Japanese
computational_methods
lack
reestimation_formulas
bilingual_dictionary_coverage
capture
Noun Classifier Associations (NCA)
objects
automatic_segmentation
expectations
graceful
97%
computational
algorithm_for_translation_lexicon_acquisition_(SABLE),
translation
forecasts
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
recordings
normal
question_phrases
concept-distance_measures
deadline
contains
agree
maximum_likelihood_method
hierarchical_lexicon
house,
regarded
survey
derived_words
then
(and
predictive_performance
information_redundancy
motivated
decision-making
co-occurrence_distribution
lexical_weighting
nominal_constituents
knowledge_sources
domain-specific_translation_lexicons
layout
put
interfaces
answer/question_terms
lexical_affinity
LCS_representations
French
automatically
gold-standard_parse_trees
monolingual dependency parse
SVMs
general_domains
enumeration
parse_reduction
automatic_evaluation
analyses
unsupervised_automatic_acquisition
referential_elements
domain_dependence
lexical_substitutions
amount
preference
Hong
plays
dialog_manager,
word-dependent_substitution_costs
abstracts
transliteration/backtransliteration_experiments
parser_for_non-configurational_languages
cooperative
logical_well-formedness_conditions
cohesive text
lexical_unknown,
units
added
87.5%
language-independent_system
bootstrap
procedures
linguistic_processing
126,610
modification_probabilities
Combination_methods
employing
7.5%
inference_types
choose
average
applied
formalisms
show
resolves
them
binary_relations
yields
word_vectors
fuzzy_quantifiers
probability_estimation
referential_properties_of_noun_phrases
young
limits
pronoun_resolution
attribute_sequences
model_of_grammatical_processing
Praguian_dependency-based_approach
clusters
customized
additional
ATIS_(Air_Travel_Information_System)_domain
trainable_components
thesaurus
new_sublanguage
conceptually
user_interface_styles_or_conventions
Lucy
SUN4
challenges
non-contiguous_phrases
interpretation_and_generation_of_natural_language
programming_language
collection_of_dialog_motivators
shown
conversation_analysis
semantic_role_labeling
hierarchy
paper
predominant_senses
temporary_belief
sentences,
100,000
raw_text
Jiang
semantic_annotation
supported
BMM_algorithm
translates
underpinning,
cooccurrence_patterns
originally
intentional_structure
editor
Penn_Treebank_data
parse
maximum_entropy_word_alignment_algorithm
development
hidden_variables
dependency_parsing
co-occurrence_similarities
named entities
speech_data
predicting
training
pushdown_automaton
fake
incrementally
process
abstractions
arguments
stack
interrogatives
Japanese_sentence_analyses
developed
language_functionalities
structured_natural_language_data
expectation-maximization_(EM)_based_word-clustering_algorithm,
SRHs
essential
subset
element
dependency-based_grammar_model
combining
towards
natural language interfaces
words
tagger
word_senses
subcategorization_dictionary
dynamic_combiner
full_scale_two-level_morphological_description
at
sets
from
are
internal_and_contextual_information
temporal_anaphora_phenomena
viz.
verb_form_meanings,
understanding
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
semi-supervised_methods
lattice-based_approach
Memo-functions
search
trained
capitalization
text_mining_method
textual_credibility_indicators
relative_error_rate_reduction
ambiguity
graph_transformations
annotation
respect
principled
scf types
automated_evaluation_techniques,
pairs
developed,
language
out-of-domain_corpus
analyses_for_large_treebank_grammars
derived
structure
statistical_machine_translation_(SMT)
collection_of_relations_and_operations
block_reordering
software
measure
distinct
MSR-open
multiple_complementation_patterns
training_method
superordinate_substitution
demonstrated
components
RAREAS
exceeds
transfer_component
token-based_models
modular
exploit
expanded
IBM_models
language_pairs
useful_terms
formal
i/l:::'=--~--
target_vocabulary
linguistic_introspection
speech-based_Information_Retrieval_(IR)
QA_system
CCLINC_Korean-to-English_translation_system
finite
spelling-checkers
155
natural_language_system
we
search engine
involve
official_rankings
distinguish
PoS-tag_feature_function
ECA
carried
extracted
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
illustrated
estimate
predicting_top-level_boundaries,
graphic_interpretation_system
contributes
speaker-independent_(SI)_training
lexically-induced_relations
lexical_hierarchy
recall,
disambiguation_algorithms
appropriate
proper
more
disambiguate
SMT_research_community
phrase translations
select
web
weighted_finite-state_device
SCFs_distributions
relatively
hybrid_generator,
in-domain_corpus
satisfactorily
natural_language_text
verb
described
discourse_connectives
result
core
underspecified representations
lexical category ambiguity
path_values
formal_analysis
delimiters
symbolic knowledge
rhetorical_patterns
rules
Japanese_character_strings
best-reported
Bulgarian,
has
language_modeling
must
translation_framework
Head_Grammars
Languages
marked
syntactic_disambiguation
linguistic information,
probabilities
keywords
translation_images
feature_structures
M
lexicologists
spatial_attributes
semantically_unmarked_term
linguistic rules
deaf
probabilistic_model
extensively
possible
email_conversation
two
statistical_parser
non-configurational_languages
closely
answer_resolution_algorithm
conditioning variables
agreement
sentence_co-occurrences
descriptions
formalising
Arabic_information_retrieval
song_lyric_document
SLS_systems
viewed
FDA
embedded
serves
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
40
unknown_words
defined
discourse segment,
range_concatenation_grammar_[RCG]_formalism
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
our
robustness_problems
met
source_and_target_language_sentences
claimed
adopt
word_error_rate
labelled_bracket_F-score
Combinatory_Categorial_Grammar_(CCG)_lexicon
special
grammar_coverage_problems
quality
undisambiguated
constructed
drawn
decision_trees
marine
selecting
blog_posts
supervised_training_data
types_of_knowledge
marks
there
adaptation
feature_functions
different
MT_system
relations
begin
Expectation-Maximization_(EM)_algorithm
semantically_annotated_corpus
improved
written_English
argument_frames
genre-specific_regularities
OCR
user_modeling
loss_functions
offers
thesaurus_construction
English_sentence_structure
histogram
evaluation_measure
analytical_components
evaluated
well_calibrated_probabilities,
logic
[Zernik88],
biological_entities
(P05-1076.10
tagging_strategies
WordNet
provided
classified
8000-word
corpus_text
Path-based_inference
limited-domain_spoken-language_task
identification_of_non-local_depenencies
helpful
distributional_approximation
word's
unsupervised_algorithm
text-level_anaphora
can
speech_recognition
sometimes
inheritance
indicators
MT
scope_ambiguity
utilized
statistical_MT_performance
described,
English/Chinese_and_English/Japanese_language_pairs
words_with_multiple_meanings
tag
predictions
machine_translation_output
extracting_subcategorization_frames
context-free_languages
resource-frugal_approach
only
MT_evaluation
's
semantic_constraints
constructs
Kong
using
linear-chain_conditional_random_field_(CRF)
model_theoretic_interpretation
present
elementary_structures
recent
reasonably
needed
allowing
English,_Arabic_and_Spanish_lexicons
similar_context_features
grs
non-English_(Arabic)_stemmer
discourse_structure
bit-vector_operations
exhibit
critical
associated
biomedical_text
phrase_chunking
tree-bank
small,_domain-specific_corpus
word_string
uses
outperforms
format
TRDR_score
formatted_weather_data
hierarchies
benchmark_system
text_processing_software
and
wildcards
macro-average_F1_performance
6
onto
transcription_errors
comparable
automatic_alignments
scfs
related
(using
finite-state_models
directionality
precision_rate
Generalized_Quantifier_approach
statistics
ILIMP
bibliographic
training_corpus
natural_language_understanding
train
areas
texts
ARPA_large-vocabulary_CSR_corpora
level
auxiliary
sentence_retrieval_problem,
valuable
paraphrase_classification_accuracy
segmentation
performs
entities
high-quality_data
structural_and_lexical_dependencies
Intel_i860_chip
attentional_structure_in_discourse
written
statistical_models
Comparator
suitable
meet
translations
localized_phrase-based_prediction_model
vectors_representing_morpho-syntactic_properties
bilingual_dependency_relations
consists
reduplications
currently
parsing
dynamic_programming
faced
morphology
Spelling-checkers
description
unless
Paramax_spoken_language_understanding_system
strongly
equivalent
improving
keep
connectivity
word-based_models
given
generator
word
been
other
subpredicates
general_and_domain_corpora
language_processing_tasks
semantics_directed_approach
Penn_Treebank_Corpus
vast
explicitly
Dictionary_construction,
relative
Web
source of data
generative_model,
predicative_information
ambiguity_resolution
answer_extraction
Arabic-English
domain-specific_semantic_information
graph
parser_MDCC
problems
rely
with
binary_relational_calculus_notation
decision_tree_learning
well-written_discourse
rating
gave
associative_relationships_between_verb_phrases
polynomial_time_solution
robust
semantic_caseframe_instantiation
full_NPs
oral_communication
incremental_description_refinement
Augmented_Transition_Network
queries
when
classifier_word
MORphological_PArser_MORPA
suffix_array-based_data_structure
scripts
that
dialog_systems
operate
entity-based_representation
memory-based_system
contextual_similarity
core_modules
statistical_model
higher
O(n6)_time
advertisements
defeasible_reasoning
difficult
Mimo,
data_objects
ranking_learning_problem
grammars
subcategorization_classes
every
bag-of-words_methods
coherent_text
stochastic,_graph-based_method
number
KDS
along
verb_semantics
syntactic_and_semantic_dependencies
encodes
predicate-argument_structures
provides
"black-box"_methodology
accuracies
place
theory
cross-entropy
hardness
cognitively_well-motivated_interfaces
Chinese_words
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
epistemological_level
machine_transliteration/backtransliteration
focus
connectionist_component
articles
requiring
general_linguistic_knowledge
baseline_system
word-aligned_corpora
word-senses
parsing_data
state-of-the-art_coherence_model
multidimensional_chart_parser
Graphical_User_Interface_(GUI)_functions
automatic_metrics
labeled_data
proposed
TIPSTER_Architecture_specification
speed
surface_English
heuristic_principles
identify
English,
probabilistic context-free grammars
minimizes
may
deduced
user_model
appears
dialogue_translation_system
mutual_information
s-VSM_model
respectively
DRT
Basque
answer_candidates
parser
implementation
obtained
student
hypotheses_graph
LFG
maximum-entropy_model
syntax,
generative_model
word_n-grams
machine_translation_outputs
collecting
some
German_corpus
relation extraction
while
corresponding
category
prominence
Cooperative_Model
task-specific_domain_knowledge
2.284
thus
treated
estimated
enhances
representation_scheme
significantly
phrasal_patterns
polarization
acquiring_adjectival_subcategorization_frames
linguistic_structure
attractive
mapped
enough
portion
logic,
JAVELIN
achieved
traditional_MT_architectural_designs
current
generation_system
deep_processing
efficiently
answer_expressions
coordinations
Generalized_Alignment
abstract_flat_syntactic_representations,_LFG_f-structures,
hidden-variable assignments:
certainty_conditions
robust---an
did
information
tagged
introduction
extended_domain_of_locality_(EDOL)
biases
open-domain_question_answering
training_techniques
either
character_bigrams
educational_tool,
Chat-80
speaker
patterns
applying
word_forms
argument_structures
exotic,
patchy
what
large
new_domain
continuous_density_HMM
represent
comparable,_non-parallel_corpora
antecedence_recovery
achieves
1.6
accurate
MT_output
domain_independent_model
experimental_evaluation
created
spectral_clustering_based_approach
Thai_key_prediction
trees
Discourse_Representation_Theory
hand-crafted_template-based_or_rule-based_approaches
ungrammatical_structures,
syntactic_ambiguity_resolution
they
natural_language_interpretation
dialog_management_system
macro-average_F1
architectural_modules
Name List,
edges
word-lemma_based_feature_function_models
(called
learned
overall
presuppositional_nature
phone-string_classifier
terms,
user
manually_segmented_Arabic_corpus
introduced
email-threads
DARPA_Resource_Management_corpus
involves
subordinate_clause
cooperative_responses
examples
topical_blog_post_retrieval
proposition
intentions
much
how
fundamental
bilingual_dictionaries
IE_paradigm
phrase_translations
semantic_information
conjunction
task-oriented_dialogs
laws
unlexicalized_parser
discusses
resolution_component
semantic_composition
reference_model
translation_performance
Korean-to-English_and_a_Japanese-to-English_dictionary
machine_translation
interlingual_approach
mainly
arbitrary,
noun
model
ported
linguistic_parser/generator
Wall_Street_Journal_articles
test_set
syntactic_descriptions
Machine_transliteration/back-transliteration
mathematical_expressions
semantic_domain_models
parallel_corpora
experimental
classification-based_representation_techniques
world
usual
stemming_model
lexical_and_syntactic_features
chunking
optimum_iteration_number
Task-based_evaluation
similar
highly_inflective_languages
found
general
produce
shift-reduce_dependency_parsers
relative clauses
author
syntactic_coverage
ensemble_learning_approach
surface_forms
English text
little
important
PK-open,
role
derived_strings
topic_signatures
subcategorization_frames
centering approach
query_optimisation
retrieve
architecture
purposes
dramatically
resulting
declarative and imperative utterances,
fundamentally
dynamic_language_model_combination
97.24%
relied
retrieval_effectiveness
formalism
linguistic_concepts
range_concatenation_languages_[RCL]
beyond
parallel_concordances
knowledge
entirely
performance_improvement
newswire_texts
structured
rate
done
lemma-based_approach
inflow
CMU
combined
ranks
saturation
finding
lexical_database
error_correction_mechanisms
system_response
NLP_system
prototype_system
Information_extraction_techniques
vocabulary),
conceptual_level
formalization
human_cognition
hierarchically-structured_terminology
speeches
judicious
digital_learning
pronouns
dependency_structures
linguistic_phenomena
evaluation_of_Natural_Language_systems
predicate_calculus_notation
practice,
problem,
structured_data
statistical_methods
very
idiosyncracies
text_browser
sublanguage,
hidden Markov models (HMM),
agglutinating_free_word_order_language
log-linear_block_bigram_model
input_word
adding
wordbreaks
indeed
utterance_classification
because
threads
1
fine-grained_grammatical_categories
functions
paraphrase_class
remains
ASR_output
specifications
computational_semantic_analyses
identification_of_paraphrases
used
within
their
culling
dictionaries
parts of speech
entirely_data-driven_model_selection_procedure
classification_method
recognition
representation
gene_and_protein_interactions
compositional_approaches,
distributional_hypothesis
produces
large-scale_knowledge_base
word_sense_disambiguation_(WSD)
write
procedural
overt_case_markers
models
English-Chinese_parallel_corpora
following
known
recognition_technology
work
is
DARPA_Spoken_Language_Systems_(SLS)_program
~0.25%
operational_semantics
algorithm
text_generation
indices
domain_entities
extracts
Czech_WordNet
Natural_Language_Processing_(NLP)_applications
stored
still
do
American Sign Language (ASL) animation
planning-based_architecture
neat_texts
impacts
projecting
emoticons
comparison
word_examples
AI_problem_solving_techniques
combine
ungrammatical_input
term_aggregation_system
individual
tutorial_dialogue
Kullback-Leibler_distance,
analysed
become
supports
cooccurrence_statistics
inference
polynomial_time
translation_lexicon
combination_methods
method
manner
high
WordNet-based_measures,
interconnected
devised
permits
dictionary_word_sense_definitions
compared
word_significance
presumed
unified
handles
domain_specific_terms
HMM_training
deals
explore
user_knowledge_modeling_architecture
discourse_copying_algorithm
probabilistic_finite_automaton
able
intelligent_mobile_agents
draws
grammar_formalisms
recognizer
part-of-speech_tagging,
spelling_correction
anaphora
evidence
possible,
context-free_chart_parsing
dimensionalized_space
syntax-based_constraint
syntactic_categories
theory_of_attention,_intention,_and_aggregation_of_utterances
discursive_usage
dependency_relation_paths
learn
f-structures
increased
nominals
ungrammatical segmentations
through
SSTC
pruning_criteria
LT_(LF)
AI_text_generation
spoken_language
anaphoric_component
state-of-the-art_performance
it,
Chinese_language,
human_data
dialogue_interaction
tree_adjoining_grammar
supervised_learning
extracted_fields
during
MWEs_database
occur
asymmetric,_or_directional,_relations
pharmaceutical news archive
Italian and English verb subcategorization frames (SCFs)
language processing pipeline
explicit
reasoning_with_dispositions
creation
KL-ONE-like_knowledge_representation_systems
addressee_identification
incorporates
generalized_translation_knowledge
automatic_extraction
right-side dependencies
simple_clausal_structures
text_corpus
word-lemma_model
Prague_Dependency_Treebank
field_structured_extraction_tasks,
personal_computers
segment
precision
analyst
agglutinative_languages
tagging
automatic_Q/A
filter
feature-based_word_grammar
abduction
unsupervised_methods
construction
parsing_algorithm
non-terminal_symbol
were
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
unannotated_text
influence
NLP
computational_complexity
Japanese_text_processing
running
parsed
multiple_parsing_strategies,
disjunctive_feature_structures
genre
paraphrase_examples
recently
new_event_detection
listener
achieving
category_labels
excluded
metric
on
CF_grammars
Source_and_Target_languages
reduced
statistical_translation_model
entailment_acquisition
Construct_Algebra
size
both
novel
word_sense_definitions
Mimo_formalism
multiple_and_nested_interactions
28,449
case-based_reasoning
restrictive_statements
coherent
competitive
multi-strategy_framework
compactly
Path-based_inference_rules
deductive_approach
abstract_moves
filled
personal_names,
randomly
concepts
domain
on-line_encyclopedias_and_dictionaries
Korean
check
it
Large-scale_natural_language_generation
viewpoint
song_lyrics
intelligibility
context
Plume
variety
paraphrases
German
sparsity_of_the_feature_space
EDOL
noun_WSD_problems
multi-tagging_approach
LFG_semantics
verbal_interactions
intractability
after
approximation
meanings
data_representation_choice
logical_form_language
analyze
should
easy-to-implement
text_processing
output
quantifying_noun_groups
ambiguous_word
affix_removal
error_correction
text_applications
resource
IR
ccg_supertagging
transformed
set
sounding
adjacent
statistical_method
highly
base_parser,
dictionary
called
primarily
sides
utterances
topic_information
top_human-ranked_sentence_plan
Chinese_text_input
natural_language_interface
component
definition_sentences
syntax-based_statistical_machine_translation_system
dialogue_corpora
improve
meta-inference_types
missing_words
large-scale
built
Chinese_newspapers
greatly
derivation
Gaussian_mixture
parallel_data
handle
severely
compete
P-CFG
traditional_distributional_word-distance_measures
sentence-level_and_text-level_anaphora
metaphors
strictly_syntactic_cross-serial_agreement
control
basic
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
voice_interactive_system
LTAG
lexical_items
inherent
documents
160
guide
annotating_scheme
portability
ambiguity_representations
natural_sublanguages
Child_Language_Data_Exchange_System_(CHILDES)
Q/A
proof procedure
interactions
tasks
semantic_representation
lexical_and_syntactical_variation
temporal_relations
human_transcriptions
decision-tree_approach
linguistic_representation
events
determined
learning_algorithm
several
real-world entities
prior_knowledge
transfer_phase
domain-independent
speech_recognition_hypotheses_(SRH)
fragments
fuzzy_quantifier
computational_problems
analytical_inverses
confidence_measures
threading_algorithm
HPSG_natural_language_system
Syllogistic_reasoning_with_dispositions
Conceptual_Dependency_Theory
word-trigram_recognition
analysis
version
semantic
embodied_conversational_agent
shallow_techniques
HPSG
source_language
discourse_level
than
ambiguity_packing_and_stochastic_disambiguation_techniques
data_representation
attain
Recognition_of_proper_nouns
statistical_information
vital
structure_of_communicative_context
word-sense_ambiguity
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
syntactic_analyzer,
mapping_score
weight
expected_(grammatical)_sentences
triple
SMT
MUC-6 and MUC-7 English NE tasks
operates
exploratory_corpus_analysis
English_Wikipedia,
indexing
English-French_document_pairs
human_transcription
Slavic language
log-linear and linear interpolation,
source_dependency_parse
KL-ONE
natural_language_processing
statistical_machine_translation_(MT)
Xerox_PARC
defeat_rules
logical_formulas
way
between
pair
JINTACCS_messages
multi-strategy_approach
blackboard-like_architecture
unification-based_grammar
morphological_analysis
build
compression_ratio
estimations
unadulterated
grammar
critical_discussion
contexts
frequency_profiles
strategies,
apply
semantic_relations
reduce
character_types
ways
particular
spoken_dialogue
predictably
solution
Arabic_word_segmenter
find
would
applications
into
corpus_data
coordinate_phrases
rule-based_systems
unification-based_grammar_parsing
Bayesian_semi-supervised_Chinese_word_segmentation_model
Unification_Categorial_Grammar_(UCG)
constraint
outputs
semantic constraints
incorporate
distance values
flexible,
argued
collected
statistical_techniques
pattern
discourse-level construct
syntactic_analysis_system
vectors
70%_precision
modeling
named_entity_(NE)_recognition_(NER)_system
grammar_checker
many
conceptual_operations
dialogue_systems
alignment_errors
derivational_history
class
demonstrative_forms_and_functions
referential_information
task-specific_language_development
dynamic_programming_(DP)
focus_of_attention
computed
human_understanding_of_natural_language
task
NP-_and_non-NP-antecedents
MT_evaluation_techniques
generative_probabilistic_model
citations,
content-independent_formalism
probabilistic_spectral_mapping
interface
unsegmented_Arabic_corpus
Japanese_language_dictionary
unsupervised_learning_method
clustering_methods
apartment
grammaticality
providing
automatic_abstracting_systems,
probabilistic_context-free_grammar
parallel_structures
high-accuracy_word-level_alignment_models
probabilistic_synchronous_dependency_insertion_grammar
support_vector_machine
POS tags in English,
information_source
joint_model
weaknesses,
namely
target_corpus
larger
TAG
Bikel's_parser
syntactic_cues
"glue_language"
treat
distributional_word_feature_vectors
statistical_approaches,
comprising
smoothing
ability
existing
Horn_clauses
experiments:
tree-to-tree_translation
deviates
dialogue_system
addressed
HMM_and_Max-ent_models
smaller
context-free_grammars
runs
automated_interpretation
empirical
modified
independent_classifiers
us
upon
comma_checker
algorithms
grammatical_relations
construction-specific_approach
stochastic_output_selection
implicitly
spatial_descriptions
bilingual_material
time
lexico-syntactic_knowledge
citing
log-linear_(maximum-entropy)_models
languages
less
feature-based_relation_extraction
expletive_occurrences
test
parse_forest_representation
Wall_Street_Journal_treebank
flexibilities
correctness
CRF
permitted
clustering_and_filtering_processes
NL
includes
inflected_forms
deterministic_finite_automaton
phonological_system
(in
dialog_motivators
despite
node-based_inference
shared_derivation_forest
summations
MBR_decoders
cannot
sense_resolution
relying
around
skips
million
evaluate
methodology
kernel_functions
phone_n-gram_model
amounts
genetic_search
system
interaction
indirectly
seed_sentences
multiple
starting
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
ranking_algorithm
lexicon
existing_grammar
offer
describes
data
automatic
labels
practically_unsupervised_learning_method
CFG_rules
OT
integration
PAKTUS
designed
topic_signature
feature_structure_unification
multilingual_input
summary
extraction
projection_of_structures
translation_candidates
syntactic_analysis
answering_agents
baseline
method_of_analyzing_metaphors
instead
segmentation_standards
unsegmented_corpus
post-processing
powerful
semantic_criterion
take
certification
et
printed_text
machine
paraphrasing_method
verbal_and_nonverbal_grounding_acts
but
compositional_syntax_rules
Definite_Clause_Grammar_techniques
word_sense_disambiguation_(WSD)_systems
aids
replete
captured
based
transfer_approach
best-path,_bottom-up,_deterministic_parser
even
implicit
context-free_phrase_structure_rules
part_of_speech_information
inescapable
unification-based_linguistic_descriptions
finite-state_methods
LSA-based_and_the_cooccurrence-based_word_vectors
completeness
considered
extract
visualization_method,
textual_corpus
discourse_relations
text
treebank
permit
reflect
functional_structure
leading
definitions
language_acquisition
free-content
parsing_process
mixture
part_of_speech_(pos)_tagging
Japanese-English_translation,
2491
MeSH_relations
good,
constructions
graphical_model
probabilistic_translation_models
tool
incorporating
bearing
partial_theories
ranking_rules
represents
surface_representation
as
working
performed
direct
semantically_rich,_large-scale_knowledge_bases
question-answer_pairs
tenses
word_clustering
processing
decoding_strategy
out
essays
word_pairs
corpus-based_approach
Japanese_script
same
substantial
natural_language_processing,
SCFs
automatically_acquired_parallel_corpus
text-to-speech_conversion_system
newspaper texts
substrings
natural_language_applications
1983)
local_structure
Japanese_unknown_words
sense
different-quality_references
where
Plume's_approach_to_parsing
multilingual_TIPSTER_user_interfaces
CFG_parsing
computational_theory
information_extraction_system
Verbmobil_task
acquisition_of_word-semantic_information
linguistic_and_non-linguistic_knowledge
these
referring_expressions
mappings
semantic_analyzer
ICICLE_system
multilingually_aligned_wordnets
representations
previous
attributes
decision_list
CCR_formalism
identifying
sentences
typicality
ccg_parsing
direction-giving_task
straightforward
priors
argumentation_system
mismatch_resolution_scheme
approaches
probabilistic_context-free_grammars
small-scale
Arabic
hierarchical_(or_other_types_of)_relations
Turkish_word_structures
text-plan_input
discourse-relevant_purposes
tailoring
provide
single
generalizable_semantic_principles
temporal_adverbials
APT
chunking_results
probabilistic_context-free_grammar_(PCFG)
PropBank
roots_words
spoken_dialogue_systems
computer_text_generation_system
access
modules
synonym relation
segments
alphabets
unsupervised_training
entropy
grammatical_number
required
fewer
NLP_tasks
semantic_role_labeling,
constraint_system
over
addition
phrase-based_statistical_machine_translation_method,
Automatic_Speech_Recognition_technology
protocol_analysis
domain-independent_capabilities
character_and_word_error_rate
words,
phrase-based_models
trend
Term_similarities
complete
levels
formal_definition
problem
free_indexation
sense-tagged_training_data
automaton
classifier_assignment
operational_foreign_language_tutoring
fits
initially
story
JAVELIN_system
CSG
lexicalized_structures
translation lexicons
expressed
richer
basis
LR-parser
ill-formed_input
Systemic_grammar
implements
annotation_scheme
spoken_language_understanding_system
lexical,_syntactic,_semantic,_and_structural_information
