temporal_relations
analytical_components
~
song_lyrics
underspecified_semantic_representation_(USR)
cross-lingual_comparisons
English
first
integrate
linguistic_phenomena
syntactic_analyzer,
unification
parsing_process
portability
implementation
node_structures
HK-closed,
indeed
corpora
speech-based_Information_Retrieval_(IR)
GLOSSER
alleviate
also
captures
simplify
context-free_languages
general
statistical_translation_model
scfs
properties
semantic constraints
language_processing_tasks
practice,
class_of_languages
EBMT
Koskenniemi,
dialog_schemata
thematic_grid_tagging,
Chinese_text_corpora
retrieval_performance
multi-strategy_and_multi-source_approach_to_question_answering
enough
Bulgarian,
spontaneous_speech
song_lyric_document
grammatical_sentences
automated_interpretation
according
applications
nodes
bootstrapping_approach
strategies,
help
Word_Sketch_Engine,
syntactic_behavior
monolingual dependency parse
machine_translation
statistical_methods
(called
associative_relationships_between_verb_phrases
system_output
compositional_interpretation
small,_domain-specific_corpus
connectionist_component
word-based_models
fast,
claimed
ranking_learning_problem
citing
four
sequences
correspond
we
acquired
predominant_senses
000
EUROPARL_corpus
token_classification_task,
originally
independent_classifiers
delimiters
expert_systems
non-terminal_symbol
vectors_representing_morpho-syntactic_properties
robust---an
discontinuous_constituents
component
feature_structure-directed_generation,
formal
based
fuzzy_quantifier
despite
Smadja,1993)
log(d)_overheads
words,
parse_forest
IntEx_system
speech_recognition
topic_information
right-side dependencies
TIPSTER_Architecture_specification
defeasibility
coarse-grained_concepts,
support_vector_machine
parse_trees
mappings
English_questions
characterize
Child_Language_Data_Exchange_System_(CHILDES)
are
wordbreaks
written_and_spoken_language
predicting
mapped
heuristic_learning
grammatically_correct_input
other
board
real-world entities
triple
subcategorization_dictionary
necessary
discourse_structure
log-linear_models
Head_Grammars
characterized
variant
"one-time_look_up"_method
good,
show
word-based_alignments
from
approach
open-domain_question_answering
model
constraining
positive_feature_vectors
dependency_structures
decision_trees
class
unsupervised_algorithm
word_segmentation
co-occurrence_patterns
surface_forms
extensively
real-valued_features
discusses
blackboard-like_architecture
on-line_encyclopedias_and_dictionaries
respect
statistical_models
alternative
gave
comprehensive
proposed
hard decisions
usually
on
multilingual_input
information_extraction_techniques
automatic_metrics
proposition
deterministic_finite_automaton
integral
automatically_acquired_parallel_corpus
it,
fully-connected_first-order_statistical_class_grammar
restrictive_statements
certification
computational_theory
sentence_analysis
word_alignment
continuous_density_HMM
incremental_probabilistic_parser
ranking_rules
domain-specific_(in-domain)_word_alignment
compact
bilingual_dictionary_coverage
annotating_scheme
Metagrammatical_formalisms
syntax,
parser_MDCC
they
pharmaceutical news archive
expressed
honorifics
Italian and English verb subcategorization frames (SCFs)
compare
could
BMM_algorithm
time
CFG_parsing
user-specified
restricted_natural_language
valuable
noun
MWEs_database
generation_problem
ASR_output
articles
output
semantically_rich,_large-scale_knowledge_bases
dialog_manager,
efficiency
logical_model
Automatic_Speech_Recognition_technology
was
primarily
quantifying_noun_groups
summary_generation
acquire
standalone_system
often
representation_scheme
error_rate
Definite_Clause_Grammar_techniques
relatively
probabilistic_translation_models
transformed
simple_clausal_structures
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
multi-strategy_approach
mobile_military_command_and_control
determining
auxiliary
89.75%
shallow_mapping
randomly
adequate
qualitative_spatial_constraints
patchy
unification-based_grammar_formalism
etc.,
AS-open,
little
morphological_analysis_problem
free_indexation
grs
minor
construction
arguments
HMM-based_chunk_tagger,
Minimum_Bayes-Risk_(MBR)_decoding
typed_feature_structures
lexical_coverage
architecture
collected
Chinese_punctuation_marks
placement
baseline
voice_input
declarative
automatically
lexico-syntactic_knowledge
named_entity_(NE)_recognition_(NER)_system
syntactic_structure_features
87.5%
industry_watch
knowledge-based_generation_systems
purpose
general_domains
quantification_over_events
morpho-syntactic_and_semantic_characteristics
structure-sharing_of_graphs
morphological_analyzer
when
feedback
decision-making
category_labels
questions
high
aware
decision_tree_based_approach
users
traditional_MT_architectural_designs
confidence
which
lexicons
discourse segment,
be
MBR_decoding
discourse-relevant_purposes
German_text_corpora
punctuation
grammatical_relations
Acoustic_modeling
semantic_representation
Slavic language
word_tokens
non-contiguous_phrases
parsed
SVMs
strengths
lexical_unknown,
conventionally
syntactic_coverage
dynamic_programming
relations
parsing_strategies
[Zernik88],
TRDR_score
Arabic_word_segmentation_system
probabilistic_context-free_grammar_(PCFG)
statistical_method
augment
backwards_transliterations
complete
official_rankings
their
large
segmentation bakeoff
epistemological_level
clues
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
make
concepts
feature-based relation extraction
resulting
developed,
errors
enumeration
ARPA_large-vocabulary_CSR_corpora
essential
behavioral_patterns
Plume
Chat-80
parser_for_non-configurational_languages
post-processing
grammar_checker
treebank
out-of-domain_corpus
full_scale_two-level_morphological_description
packed
computer_text_generation_system
token-based_models
lexical_substitutions
existing
word_error_rate_(WER)
relative clauses
RINA,
achieve
expected_(grammatical)_sentences
generate)
procedural
easy-to-implement
concept
et
tool
describes
argument_structures
Source_and_Target_languages
translation_lexicons
entailment_acquisition
compactly
French
utilizing
part_of_speech_information
required
web
repository
corpus-based sample
input
incrementally
hoc
syntax-based_statistical_machine_translation_system
hierarchy
rule-based_systems
keep
Intel_i860_chip
adjacent
natural_language_processing,
Japanese_patent_claim_sentences
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
terminology_structuring
O(n6)_time
citations,
SL
word_graph
written_texts
knowledge-based_and_random_selection_procedures
drawn
Basque
CFG_parser
ATIS_(Air_Travel_Information_System)_domain
dialogue_translation_system
serves
linguistic_theory
children
significance
leading
demonstrative_forms_and_functions
textual_credibility_indicators
pieces
symbolic knowledge
segmentation_standards
formalisms
abduction
translation_quality
during
support
special
level
graph_transformations
depending
graph
instead
stored
contain
lexical_and_syntactical_variation
abductive_inference
manner
Words
in-domain_word_alignment
seed_sentences
hardness
reestimation_formulas
bag-of-words_methods
tractable
advances
parsing-based_NE_rules
BLEU
probabilistic_context-free_grammars
denotational_semantics
translation_data
seeds
types
solution
disambiguation_algorithms
79.1%
large-vocabulary_speech_recognition
Japanese_language_dictionary
training_and_testing_factors
attributes
source_and_target_language_sentences
confidence_measures
pronominal_anaphora_resolution_module
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
DRT
outperform
NP
semantic_domain_models
better
chunking_results
SCFs_distributions
configurable
CoNLL_2008_shared_task
guide
mixture
hierarchical_lexicon
there
programming_language
topic
aligned_bilingual_corpus
1983;
credibility_indicators
program
syntactic_descriptions
language_learning_model
phrase_chunking
specifications
parsing_method
naming_conventions
probability-based_scoring_function
assignments
operates
preceeding
derived_string
has
recordings
alphabets
word's
12.5%
Generalized_Alignment
MBR_decoders
French_tenses
semantic network
lexical_translations
macro-average_F1_performance
100,000
–
Machine_transliteration/back-transliteration
extensive
linguistic_structure
linguistic_processing
regular_expressions
expected
translation_lexicon
argument_frames
macro-average_F1
theory
unification-based_grammatical_frameworks
represented
summary
error_correction_mechanisms
ccg_parsing
Procedural_Systemic_Grammar
113K
translation_knowledge
grammatical_number
RAREAS
computational_model
achieving
syntax_proper
speaker_adaptation_(SA)
discourse_level
Term_similarities
original
newspaper texts
error-correction_rules
statistical_MT_performance
test
finite-state_methods
Prolog
automatic_evaluations
Path-based_inference
exploits
generate
word_clusters
statistical_profile
unigram
participated
databases
large_corpora
paraphrase
subpredicates
us
advantage
utterance
precision
s-VSM_model
state-of-the-art_performance
language_modeling
grammatical_formalisms
LMs
structural_and_lexical_dependencies
subset_of_logic
spoken_dialogue_system
temporal_anaphora_phenomena
equivalent
consisting
classification_method
ambiguity_resolution
attribute_sequences
IE_module
forward_pass,
word_order
influence
relationship
Japanese_unknown_words
particularly
zero pronouns
GPSG
starting
co-occurrence_distribution
any
semantics_directed_approach
polynomial_time_solution
part-of-speech_annotation
spelling-checkers
methods
77%
alignment_errors
regular_languages
computational_methods
of
Cooperative_Model
word_sense_disambiguation_(WSD)
Markov_model
derived_strings
binary_relational_calculus_notation
agglutinating_free_word_order_language
automatic_evaluation
projection_of_structures
hidden_variables
5%
text
1.6
derivations
cooccurrence_statistics
conceptually
2004)
increased
cognito-pragmatic
suitable
core
convolution_kernel
source of data
recognition_of_extra-grammatical_input
empirical
well-written_discourse
together
[ANA]
allowing
collocations
Prague_Dependency_Treebank
(German-English,
70%_precision
localized_phrase-based_prediction_model
given
probabilistic_Horn_clauses
deep_processing
word-aligned_corpora
never
equivalence
visualization_method,
error_correction
domain_specific_terms
semantic_analyzer
POS tags in English,
dialogue_system
neat_texts
search engine
lexical_and_syntactic_features
simple
cohesive text
rank
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
disambiguation_tool
answer_expressions
APT
research
compositionality
traditional_deterministic_parsers
statistical_machine_translation
system's_output
Natural_Language_Processing_(NLP)_applications
who
phrase-based_unigram_model
exponential
upon
compositional_syntax_rules
fine-grained_grammatical_categories
abstract_moves
through
traditional
probabilistic_synchronous_dependency_insertion_grammar
effectiveness
filter
WordNet
unification-based_parsing
alternative_markers
associative_similarity
order
while
grammars
task-specific_language_development
done
tree-bank
normal
unsegmented_corpus
several
containing
quality
vagueness
blog_posts
declarative_languages
clusters
published
user-directed_summaries
salience
trainable_sentence_planner
young
components
pronouns
tailoring
modular
unrestricted_texts
common
examples
approaches
EDOL
analysis_mechanism
lemma-based_approach
recent
translation_memory_system
syntactic_structure_information
expletive_occurrences
interconnected
allows
user_modeling
linear_logic
phrase
vast
coherence
rule-based_translation_systems
document-oriented_applications
sets
arbitrary
text_processors
efficient,
(for
respectively
Dutch
constructed
inflow
have
discriminative_training_criterion
kind
expectations
statistical_analysis
lexicon
problems
combine
completeness
semantically_unmarked_term
bilingual_parallel_corpus
skips
existing_grammar
implicitly
unadulterated
sounding
Xerox_PARC
Kong
speaker-independent_(SI)_training
thus
control_structure
speech_processing
word
statistical_information
SLS_systems
shift-reduce_dependency_parsers
severely
way
agreement
commonsense_reasoning
system
sentence_extraction
theoretical_linguistic_investigations
crossed_serial_dependencies
Japanese_character_strings
question-answer_pairs
parsing_technique
bit-vector_operations
members
text_browser
data_representations
large-scale
Boolean_conditions
legal_terminology
conjunction
Jiang
newspaper_corpus
related
word-senses
maximization
interactive_problem_solving
automatic_discovery_of_text
PoS-tag_feature_function
"black-box"_methodology
transcribing
higher
operational_semantics
task-oriented_dialogs
fewer
indexing
abstraction
lexical_hierarchy
mathematical_expressions
characters-based_Chinese_collocation_system
text_corpus
improve
clauses
ranking_algorithm
dependencies
best
verb_semantics
numbers
reference_sets
large-scale_knowledge_base
superordinate_substitution
Chinese_language,
syntactico-semantic_(tectogrammatical)_annotation
SVM_learning
determined
speech
adaptation
principle-based_theory
marked
subordinate_clause
lexical_items
general-purpose_NLP_components
gained
parallel_corpus
finding
new_sublanguage
widely
exploit
answer
directly
semantic_relations
generation_system
ambiguous_word
domain-independent
initially
experimental
in-domain_corpus
LEXSYS
rely
module
hardware_designs
utterance_classification
probabilistic_finite_automaton
use
parse_reduction
performing
intuitive
specialized_parsing_techniques
information
non-literal_aspects_of_communication
temporary_belief
experimental_evaluation
summing
projecting
test_corpora
collecting
annotate
focussed
probabilistic_model
relying
search
ill-formed_input
attractive
expectations,
excluded
part-of-speech_tagging,
lend
concept-distance_measures
grammatical_gender
pronominalization,
operational_foreign_language_tutoring
multiple
practically_unsupervised_learning_method
defined
optimum_iteration_number
event_terms
log-linear and linear interpolation,
Dutch_Senseval-2_test_data
extraction_system
pronoun
CCR_formalism
deduced
Proposition_Bank_data
local_structure
verb-noun_collocation_dictionary_for_Polish
inheritance
understanding
entirely
text collections
word_n-grams
question_phrases
scf types
mismatch_resolution_scheme
indicators
WWER
entity-based_representation
training_examples
roots_words
maximum_entropy_word_alignment_algorithm
constructs
parser
about
automatically,
information_extraction_system
<
out
antonymous_adjectives
(in
arbitrarily
deals
new
path_values
synthesizes
probabilistic_context-free_grammar
transliteration
development
SSTC
unless
terms
for
element
feature_structures
areas
unification-based_linguistic_descriptions
corpus_data
associated
segment_order-sensitive_methods
unseen_data
distributional_approximation
connectivity
multiple_parsing_strategies,
multiple_and_nested_interactions
consider
accuracies
ambiguity_packing_and_stochastic_disambiguation_techniques
WH-questions
Conceptual_Dependency_Theory
taxonomic_similarity
Spelling-checkers
character_and_word_error_rate
ways
character_bigrams
HDAG_Kernel
ranks
how
biomedical_and_linguistic_ontologies
hubs
temporal_connective
pronoun_resolution
select
definitions
computational_linguistics
available
tagging
(and
text_processing
processes
surface_representation
time_exponential_on_the_size_of_the_grammar
efficient
developed
derived_words
derivation
annotation
manual_feature_selection
it
biological_entities
marks
presented,
evaluation_metrics
utilizes
parse_record
source_interval_projections
along
HTML_documents
maximum_likelihood_method
probabilities
chunking_performance
effectively
heuristic_principles
al.
phrase translations
practical
requires
knowledge
cannot
choose
domain
structured
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
evaluation_measures
--
involve
discourse_processing
fake
weights
parsing
context-free_chart_parsing
English,
semantic_role_labeling
dialog_management_system
sense-tagged_training_data
linguistic_objects
extracted_field
memory-based_system
deviates
nouns
pronoun_"it"
topics
demonstrative_expressions
habituality
computed
satisfactorily
stages
processing
spoken_multiparty_dialogue
duration_model
very
lexical_weighting
takes
language processing pipeline
more
prosodic
definition_sentences
semantic_information
clustering_methods
(from
tagged
frequency_profiles
entropy
unsupervised learning
augmented
problematic
decision-tree_classifier
rankings
question/answer_pairs
user
gives
valid
precision_rate
whether
provided
task_representation
sentential_paraphrases
97%
handle
PER
determination
discourse_copying_algorithm
log-linear_block_bigram_model
communicative_signals
found
relation extraction
method
Arabic
pragmatics_processing,
English-French_document_pairs
constructions
aids
military_and_civilian_systems
intractability
dialogue_acquisition_and_tracking_algorithm
20k
RCL_parsers
prior_knowledge
structured_databases
natural_language_processing
inferential component
within
lower_bound_estimation
SUN4
126,610
tenses
descriptions
best-path,_bottom-up,_deterministic_parser
interpolation_methods,
effective
distributional_word_feature_vectors
recall,
translation_paths
defeat_rules
training_speakers
F-measure
medium-length
ideograms
generation
Praguian_dependency-based_approach
surface_realizations
words_with_multiple_meanings
gain
added
linguistically
personal_computers
Unification_Categorial_Grammar_(UCG)
recently
linguistic rules
summations
7.5%
evidence
state-of-the-art_coherence_model
accuracy_rate
Penn_discourse_annotation
compositional_approaches,
KL-ONE
LT_(LF)
sentence_co-occurrences
require
access
(Biber,1993;
competitive
trained
AI_text_generation
distribution
spelling_correction
vector_space_model
Horn_clauses
represent
paraphrase_examples
graphic_interpretation_system
logical_form_language
mainly
dialogue_systems
TV_shows
maintains
constraint_system
check
text-to-speech_form
chunks_of_words
top-down_derivation
email_communication
meet
distance values
declarative and imperative utterances,
series
distance
intelligent_mobile_agents
chunking
problem,
printed_text
MT_evaluation
input_word
applied
lemma-based_model
natural_language_generation
HPSG_natural_language_system
unsegmented_Arabic_corpus
formal_analysis
control
Topic_signatures
gaps
times
disjunctive_feature_structures
varied
referential_information
embodied
machine translation (MT) systems
generic
computational_lexicon
ambiguity_representations
context-free_parsing
up
IE-enhanced_text_browsers
Languages
to
lower
labeled_data
answering_agents
unsupervised_training
occur
Memo-functions
similarity
non-configurational_languages
PK-open,
direction-giving_task
agglutinative_language
basic
tracks
ungrammatical segmentations
Topic_Detection_and_Tracking_tasks
considered
created
structure_of_communicative_context
target_vocabulary
Discourse_Representation_Theory
Node-based_inference_rules
binary_relations
lexicalised
scoring
functional_structure
natural language interfaces
generative_model,
saturation
significantly
adding
faced
unknown_word
maximum-entropy_model
probabilistic_finite_automata
incremental_description_refinement
pronoun_il
domains
rule-based_heuristics
decoding_strategy
heuristic_rules
Lucy
relied
superior
topic_signature
DoPS_system
ungrammatical_input
top_human-ranked_sentence_plan
rhetorical_patterns
subcategorization_frames
Japanese_natural_language_processing_studies
educational_tool,
natural_language_understanding
these
version
system_performance
verb_forms
another
information_flow
represents
distinct
overt_case_markers
(konpyuutaa)
phone-string_classifier
blocks
formulas
reversible
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
trajectory
fits
context-free_phrase_structure_rules
certainty_conditions
abstract
text_understanding
generative_probabilistic_model
benchmark_system
spoken_language_understanding_system
comparison
adapted
our
closely
KDS
reference_model
interaction
temporal_logic_CTL
concept-concept_matrix
defeasible_reasoning
P-CFG
tests
sharing
parse-trees
transfer_phase
performance_improvement
QA_system
inescapable
predictive_questioning
verbs
treat
argued
designed
Tree_Adjoining_Grammars
natural_language_processing_systems
tune
enriching
target_corpus
CRF
IBM_models
begin
semantic_expressibility
needs
linguistic_parser/generator
retrieval_effectiveness
part
good
part_of_speech_(pos)_tagging
transliteration_process
involves
Augmented_Transition_Network
coherent_text
after
generalizable_semantic_principles
syntactic_priming
unannotated_text
statistics
fundamentally
Arabic_information_retrieval
NP-_and_non-NP-antecedents
named entities
departure
towards
fuzzy_quantifiers
sentiment_vector_space_model_(s-VSM)
co-occurrence_similarities
subcategorization_classes
spatial_attributes
unsupervised_methods
Combination_methods
cooperative
user_model
requiring
domain-independent_capabilities
polarization
hierarchical_relations
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
plays
house,
achieved
data_retrieval
domains:
natural_language_interface
compared
semantics
term_aggregation_system
sentence_plan
providing
approximation_error
then
statistical_parser
conceptual_level
unique
requirements
RCL_parser
threads
conceptual_system
contextual_similarity
MeSH
unsupervised_learning_approach
Task-based_evaluation
linguistic_structures
log-linear_(maximum-entropy)_models
wide
WSD_models
volume
latent_variable
Situation_Theory
observed
proof procedure
CFG_rules
greatly
hybrid_generator,
training_(reference)_speaker
final
tools
morphological_analysis
introduced
cooccurrence
direct_orthographical_mapping_(DOM)
transliteration/backtransliteration_experiments
DARPA_Spoken_Language_Systems_(SLS)_program
task-specific_domain_knowledge
parse
space
JINTACCS_messages
new_domain
coherent
introduce
digital_learning
incorporated
integration
cognitive_psychology
speech_processing,
fuzzy_syllogism
does
emoticons
large-vocabulary_CSR,
IE_paradigm
called
concrete_noun
German
learning_algorithm
run
substitutions
independently
evaluating
idiosyncracies
scripts
numerous
information_source
anaphora
general_and_domain_corpora
asymmetric,_or_directional,_relations
different-quality_references
compounds
CCLINC_Korean-to-English_translation_system
test_corpus
email-threads
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
hypothesize
improving
objects
discourse
preference
voice_interactive_system
proper
referential_properties_of_noun_phrases
high-accuracy_word-level_alignment_models
textual_domain,
statistical_model
Log-linear_models
segmentation
unified
move-tagged_abstracts
predicting_top-level_boundaries,
MT_systems
discourse_segmentation
discursive_usage
hand-crafted_template-based_or_rule-based_approaches
supervised_and_unsupervised_methods
shows
8000-word
flexible_parser
encyclopedia,
machine_translation_task
consists
ad
bilingual_dictionaries
minimizes
boosting_approach
160
automatic_extraction
revealed
answers
node-based_inference
superordinate -hyponym relation,
wildcards
feature_functions
grammatical_frameworks
in
155
permitted
every
decision_tree_architecture
unification-based_grammar_parsing
converge
identification_of_paraphrases
word_significance_(weights)
well_calibrated_probabilities,
kernel_functions
Temporal_Expression_Anchoror_(TEA),
adopts
Nagao,1993;
nominals
translation
fundamental
shallow_techniques
Conrath
than
comprising
hierarchies
candidate_parses
written
Turkish_dependency_treebank
paraphrase_classification_accuracy
cepstrum-based_features
viewed
apply
combining
resolve
phrase-based_models
candidate
Thai_key_prediction
attentional_focus
sentences,
Southern_Min_Chinese
discovering_parallel_sentences
Chinese_text_input
particular
resource
CFG_parsers
Korean-to-Japanese_dictionary
reduplication
ported
query_optimisation
genetic_search
itself
resource-frugal_approach
learners
Bikel's_parser
take
corpus_text
analyses
analyses_for_large_treebank_grammars
reliable
ellipsis
LFG_semantics
inflected_forms
intense
23,000
primitive_Optimality_Theory_(OTP),
distinguish
lexicologists
threading_algorithm
stochastic,_graph-based_method
via
multi-strategy_framework
phrase_structure_grammar
KL-Conc,
multimodal_parsing_and_understanding
comparable
algorithms
rule-based_learning_algorithm,
Generalized_Quantifier_approach
role
decision_tree_learning
between
obtain
preceding_words
unlexicalized_PCFG_parser
theories
purposes
recognizing
~0.25%
(using
dynamic_language_model_combination
handling
hidden Markov models (HMM),
small
would
predictably
human
polysemous_word
adaptive_learning_procedure
speech_synthesis_systems
making
usefully
graphics_displays
incorporating
domain-specific_translation_lexicons
log-linear_combination
linguistic_annotation
question-answering_NL_systems
training_data
Chinese_words
extended_domain_of_locality_(EDOL)
creation
28,449
traditional_knowledge-based_techniques
Japanese_Dictionary_Task_in_SENSEVAL2
decision_strategies
architectural_modules
restricted_subset
translation_framework
disjunctions
principled
grammar
vocabulary),
includes
theory_of_attention,_intention,_and_aggregation_of_utterances
Chinese_word_sense_disambiguation_model
conditional_log-linear_model,
dynamic_programming_(DP)
pattern
interlingual_approach
Construct_Algebra
shared_lexical_information
multilingual_TIPSTER_user_interfaces
distributions
combined
terms,
training_techniques
Path-based_inference_rules
discourse-level construct
TAP-XL_Automated_Analyst's_Assistant
(P05-1076.10
strong
formalization
replete
discourse_connectives
NP-complete
described,
estimations
lexicalized_grammar
German_pronouns
its
will
unpleasant
conditioning variables
n-gram_statistics
statistical_and_constraint-based_disambiguation
spatial_descriptions
speech_and_text_image_processing
LM
meaning-entailing_substitutability
MUC-6 and MUC-7 English NE tasks
used
selected
including
candidates
entities
context-free_phrase-structure_grammar
morphological_component
machine-readable_resources
structure
apartment
NL_evaluations
consequences
explanation_system
critical
Boolean_matrix_multiplication_(BMM)
machine
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
parsing_data
modification_probabilities
shared_derivation_forest
evaluated
automaton
MSR- closed
PCFG-LA
cue_phrases
unequal
parsing_algorithm
English/Chinese_and_English/Japanese_language_pairs
stereotyped_text_structure
embedded
trees
general_linguistic_knowledge
specified
Spoken_Language_Systems_(SLS)
automatic_segmentation
KL-ONE-like_knowledge_representation_systems
machine_translation_pipeline
unambiguous_structures
makes
significant
human_data
FDA
produces
discourse_relations
M
employing
forecasts
training_corpus
convey
automatic_alignments
benefit
English-Chinese_parallel_corpora
stack
worse
human_transcription
fourteen
presence
extracted_fields
names
measure
second_language_and_cognitive_skill_acquisition
same
assigning
database_query_application
GUIs
generative_model
depend
augmented_Friedman_-_Warren_algorithm
robustness
textual_corpus
essays
lexicalized_structures
identifying
treated
parsed_corpus
collection_of_relations_and_operations
baseline_system
entailment_relations
parse trees
answer_resolution_algorithm
Isomorphic Grammars
learned
case-based_MT_(CBMT)
multidimensional_chart_parser
HBG
EM_algorithm
only
OCR
speech_and_text-image_recognition
Graphical_User_Interface_(GUI)_functions
arbitrary,
syntactic_analysis_system
MWEs
MT-based_paraphrasing_technique
linguistic_concepts
share
generalized_translation_knowledge
Japanese_sentence_structure
author
specific_heuristics
weaknesses,
Presentor
linguistic_and_non-linguistic_knowledge
question-focused_sentence_retrieval
SRHs
linguistic_expressiveness
subtrees
Collins_(2000)_reranker
find
0(n)_time
language_model
NL
1983)
distributed_message-passing_infrastructure
Sentence_boundary_detection
variety
natural_language_applications
syntax
construct
syntactic_and_semantic_dependencies
useful_terms
evaluation_measure
range_concatenation_grammar_[RCG]_formalism
pooling
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
beam-search_decoder
Kullback-Leibler_distance,
intentions
semantic_criterion
CSG
Chine_language
text_model
language_tutoring_application
TL
Chinese_newspapers
Named_Entity_task
opposed
namely
transition_graphs
probabilistic_spectral_mapping
frequency_counts
human-machine_interactions
WordNet-based_measures,
SMT_research_community
entity-oriented_parser
formal_definition
focus
planning-based_architecture
syntactic_ambiguity_resolution
exhibit
where
labelled_bracket_F-score
a
instance,
genre-specific_regularities
positive_and_negative_definition_examples
n-gram_transliteration_model_(n-gram_TM),
HPSG
expectation-maximization_(EM)_based_word-clustering_algorithm,
difficult
possible
noun_phrase_chunks
automatic
speech_recognition_hypotheses_(SRH)
model_of_grammatical_processing
time_O(|G||w|3-e)
presumed
surface_English
addition
further
event_structure
natural_language_text
ASR
dictionaries_of_word_forms
CAS
systems
spoken_language_technology
string_similarity
interfaces
pivot
coordinate_phrases
reduced
revision_component
robust_generator
ranking_problems
embodied_conversational_agent
possible,
Wall_Street_Journal_treebank
unknown_words
speech_data
natural_language
multi-tagging_approach
linguistic_domain
own
words
morpheme_sequence
word_pairs
machine_learning_techniques
"glue_language"
process
stochastic_output_selection
pipelined_NLG_architecture,
dictionary_word_sense_definitions
addressee_identification
unsupervised_automatic_acquisition
edit_distance
translation_candidates
deadline
translation_accuracy
naturally
Japanese_sentence_analyses
build
remains
appears
identify
addressed
automatic_estimation_method
circuit_specifications
extract
Japanese_text
translation_relation,
need
construction-specific_approach
contributes
character_types
Information_extraction_techniques
novel
statistical_approaches,
under
strongly
dependency_tree
full_NPs
onto
affix_removal
small-scale
such
inherent
Turkish
test_set
NLP_system
capability
Polymorphemic_stems
management_of_uncertainty
unification-based_grammar
CriterionSM_Online_Essay_Evaluation_Service
common_text_processing_modules
readily
analogies
amounts
WSD_task
dialogue
model_parameters
virtual_reality_3D_scene_modeling_software
representation_tree
each
sequential_models
ccg_supertagging
explicit
one
category
alignment
machine_translation_(MT)_evaluation
incorporates
agglutinative_languages
ambiguous wordform,
conventional_statistical_methods
core_modules
supported
grammar_formalisms
intelligibility
dedicated
able
story
word-to-word_alignments
much
framework
electronic_discussions
systemic_grammar
interrogatives
dialog_model
dialog_motivators
may
2491
collection_of_dialog_motivators
can
connectionist_(neural)_network
abstractions
content_words
knowledge_sources
WSD_programs
tree-to-tree_translation
training_material
combines
dimensionalized_space
extended
structural_information
translation_images
LFG
interface
word-sense_ambiguity
identification_of_non-local_depenencies
methodology
at
vital
deductive_approach
units
-
different
phrase-based_statistical_machine_translation_method,
enhances
decision_tree
decision-tree_approach
viewpoint
Penn_Treebank_data
exploratory_corpus_analysis
conditional_loglinear_models
graphical_model
them
content-independent_formalism
word-lemma_model
Similarity-driven_Transfer_System_(SimTran),
following
PAKTUS
an
classifier_word
running
hidden-variable assignments:
polarity-tagged_corpus
natural_language_processing_(NLP)_systems
handles
existence
survey
language-independent_system
priors
crossing_liaisons
acquiring_adjectival_subcategorization_frames
MT_evaluation_techniques
Syllogistic_reasoning_with_dispositions
create
AS-closed,
text-plan_input
sentence_retrieval_problem,
Verbmobil_task
oriented
keywords
language_processing_systems
base_parser,
word_sense_disambiguation_(WSD)_systems
hierarchically-structured_terminology
Coedition
outputs
AI_problem_solving_techniques
English,_Arabic_and_Spanish_lexicons
decoding
term_extraction
technique
domain_knowledge
queries
syntactic_categories
feature_vectors
segment_boundaries
utterances
limited-domain_spoken-language_task
groupings
formulate
cross-entropy
representations
target
bare_slice_disambiguation
natural_languages
chart-based_phrase_structure_parsing
searched
sentence-level_and_text-level_anaphora
scientific
software
been
ICICLE_system
tree_adjoining_grammar
carried
discourse_constraint
software_library
usual
interpret
morphological_constructions
estimated
flexible,
whose
POS_learning
speaker
complex
discourse_task
ranking
parallel_data
electronic_newsgroup_discussions
human_plausible_reasoning
single
spoken_corpora
F-measures
formatted_weather_data
hypotheses_graph
IR
range_concatenation_languages_[RCL]
pairs
target_document
KPSG
did
additional
definite_clause_grammars
taggers
number
filled
discourses
domain_independent_features
either
description
display_of_graphical_information
knowledge-based_mechanisms
million
priming
syntactic_cues
VSM_model
scratch
feature-based_relation_extraction
that
substantial
paper
semantic_constraints
average
shallow_linguistic_features
Korean-English_translation
answer/question_terms
deal
differ
per
data_representation_choice
gold-standard_parse_trees
English_sentence_structure
domain-specific_word_alignment
word_vectors
query_terms
most
)
verbal_interactions
logical_well-formedness_conditions
linguistic_PoS_tagger_and_chunker
combination_methods
class-oriented_framework
80.5%
Mimo,
field_structured_text
domain_entities
natural_sublanguages
offer
culling
STRAND
weight
event_map
Comparator_software
relative
compete
abstracts
account
resemble
deterministic_parsers
explicitly
constituent_parts
levels
multilingual,_multimedia_data
algorithm
1
semantic_annotation
grammar_coverage_problems
semantically_annotated_corpus
Large-scale_natural_language_generation
Named_Entity_(NE)_tagging
likelihood
lattice-based_approach
integrating
gene_and_protein_interactions
averaging
traditional_distributional_word-distance_measures
coherence_assessment
transfer_approach
recognition_network
individual
syntax_directed_approach
anaphora_references
yield
moment
IR,
spoken_language_corpus
parallel_corpora
statistical_techniques
rating
word-dependent_substitution_costs
verb
describe
carry
user_interface_styles_or_conventions
ambiguity
MT
Arabic_word_segmenter
explanation_generation
constraint
richer
Expectation-Maximization_(EM)_algorithm
single-strategy_parsers
critical_discussion
all
semantic_distance
language_(L0)
overcome
40
CFG filter
elaborated
structured_data
text_generation
word_segmentation_problem
generates
introduction
highly_inflective_languages
spoken_language
powerful
inflection
smoothing
monolingual_parallel_corpora
robustness_problems
training_and_test_data
corpus-based_approach
feature_structure_unification
sense_resolution
attentional_state
block_selection_criteria
sentence-level_semantic_equivalence_classification
CF_grammars
syntactic_information
morphology
lack
Czech
rate
SI_corpus
model_design
associative_relationship
conversation_transcripts
spectral_clustering_based_approach
aid
function_words
model_checking
computational
corpus-based_method
word_sense_definitions
passives,
spoken_dialogue_systems
probabilistic context-free grammars
genres
implemented
devised
parts of speech
human language learners,
linear-chain_conditional_random_field_(CRF)
spoken_language_understanding
referring_expressions
predictions
incorporate
machine_translation_output
applying
information_extraction_tasks
segment
Japanese
generator
flexibilities
writing
SCFs
reasonably
around
character
whole
multilingual_speech_and_language_applications
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
pushdown_automaton
strictly_syntactic_cross-serial_agreement
flexible_parsing
linguistic information,
morphological_and_syntactic_information
work
LR-parser
edges
evaluate
CMU
unit
potential
Human-Machine_Communication
larger
WordNet,
tend
Translations
ensemble_learning_approach
synchronous dependency parser
nature
reduced_IL_formulae
language_functionalities
inevitable
linguistic_representation
single-snippet_answers
centering approach
Grosz-Sidner-style_focus_model
capture
dictionaries
MT_output
conceptual
classifier_assignment
goal
summarization
global_meaning
lexical_methods
multilingually_aligned_wordnets
EM-algorithm
shown
or
Penn_Treebank_Corpus
free-content
Longman_Dictionary_of_Contemporary_English
built
were
syntactically_motivated_relations
method_to_automatically_acquire_paraphrases
monolingual_and_bilingual_information
frequency_classes
Information_Bottleneck
natural_language_generation_community
computational_complexity
example
few
dependency_parsing
topical_blog_post_retrieval
non-English_(Arabic)_stemmer
full_parsing
provides
complicated
logical_formulas
InfoMagnets
Wall_Street_Journal_articles
formal_intersections_of_FSAs
laboratory_study
frames
two-phase_shift-reduce_dependency_parser
CTL
explore
statistical_parameters
relative_frequency_of_occurrence
MeSH_relations
feature_weighting_and_selection_function
constitute
formalism
Bayesian_semi-supervised_Chinese_word_segmentation_model
captured
address
classified
idiosyncrasies
Paramax_spoken_language_understanding_system
ungrammatical_structures,
modeling
entirely_data-driven_model_selection_procedure
root_word_lexicon
TIPSTER_applications
language
well_calibrated_probabilities
extracted
paraphrase_class
achieves
LSA-based_and_the_cooccurrence-based_word_vectors
previously
Dictionary_construction,
beyond
direct
vocabularies
prototype_system
phonetic_recognition
integrates
temporal_expressions
HBG_model
nominal_compounds
lexical_database
computationally
retrieval
high-quality_data
genre
labeled_directed_graph
PropBank
sentences
comparable,_non-parallel_corpora
distributional_hypothesis
phrasal_patterns
permit
size
implements
bilingual_corpora
Wizard_of_Oz_technique
dependency_relation_paths
expanded
paraphrasing_method
verb_form_meanings,
word-based_collocational_properties
word-trigram_recognition
information workers
computational_semantic_analyses
character-_and_word-segmented_data
training_method
extraction_tool
hypothesis
highly
needed
disambiguate
Czech-English_statistical_machine_translation_system
English text
JAVELIN
largely
decision_list
firmly
suggests
Lexical-Functional_Grammars_(LFG)
probability_estimation
machine_transliteration/backtransliteration
facilitate
magnitude
natural_language_interpretation
meaning
spoken_dialogue
Hong
word_clustering
dependency-based_grammar_model
tag
seem
derivational_history
mutual_information
35.0%
textual_representation
annotation_scheme
continuous_speech_recognition_(CSR)_techniques
answer_extraction
relevance
performance
thesaurus_construction
representation
predicate-argument_structures
though
HMM_training
produced
proportion_problem
relevant
Japanese_text_processing
topic_signatures
using
important
field_structured_extraction_tasks,
judicious
student
verbal_and_nonverbal_grounding_acts
anaphoric_component
Dialogue_strategies
stems
evaluation_of_Natural_Language_systems
semantic_composition
techniques
adopt
recognizer
stemming_model
logic
automatic_abstracting_systems,
ambiguities
automated_evaluation_techniques,
statistical_machine_translation_(MT)
rule-invocation_strategies
so
ambiguous
helpful
SMT
predicative_information
modular_architecture
memory-based_learning_chunker
labels
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
write
trend
building
outperforms
conversation_analysis
accurate
tagger
multisentential and multi-paragraph explanations
robust
types_of_knowledge
known
referential_elements
translation_hypotheses
categories
experiments:
data
English-Japanese,
IBM_translation_models
semantic_interpretation
classifiers
tree
evaluation_method
illustrated
supervised_learning
semantic
demonstrated
analyst
express
draws
textual_corpora
parse_tree
manually_segmented_Arabic_corpus
dictionary
reflect
not
allow
developing
loss_functions
cognitively_well-motivated_interfaces
joint_model
lexical,_syntactic,_semantic,_and_structural_information
kinds
word-sense_disambiguation_algorithm
formal_language
transformation_model
discourse_understanding_process
must
interpretation_and_generation_of_natural_language
bilingual_material
live_closed_captions
Intra-sentential_quality
Taiwan_Child_Language_Corpus
extracts
verb_final_language
MSR-open
hierarchical_(or_other_types_of)_relations
information_retrieval_techniques
and
uses
Semantic_theories
computational_problems
analyze
Hidden_Markov_Model
text_mining_method
human_cognition
aims
written_English
Korean-to-English_and_a_Japanese-to-English_dictionary
inference_types
machine_learning_approach
lexical_affinity
procedures
semantic_role_labeling,
amount
customized
real
word_sense_disambiguation
weighted_finite-state_device
permits
constructing
analysis
bit-vector-based_CKY-style_parser
Machine_Translation
correlate
recognition
subcategorization_cues
partial_theories
categorization_task,
classification-based_representation_techniques
distributional_concept-distance_measures
domain_independent_model
induced_model
statistical_machine_translation_(SMT)
extracting_subcategorization_frames
Mimo_formalism
audio_and_scanned_image_data
vocabulary
mapping_score
ECA
sides
attentional_structure_in_discourse
inference
argumentation_system
improvements
reference
some
layout
HMM_and_Max-ent_models
basis
discourse_context
expensive
against
free_word_order
straightforward
n-ary_relations
exact_match_accuracy
efficiently
documents_with_signal_content
Korean_and_English_language_pairs
analytical_inverses
unlexicalized_parser
rules
because
bearing
multi-component_architecture
new_event_detection
machine_translation_outputs
Name List,
robust_explanation_system
selecting
polysemy
like
Statistical_Machine_Translation_(SMT)
Systemic_grammar
dramatically
email_conversation
word_senses
body
nominal_constituents
formulated
unsupervised_learning_algorithm
implicit
synonymous expressions
phone_n-gram_model
enhance
bilingual_dependency_relations
rather
offers
portion
constituent_structure_trees
previous
graceful
exactly
underpinning,
independently trained models
meanings
useful
pos_tag_ambiguity
syntactic_analysis
English_Wikipedia,
transfer_component
word-lemma_based_feature_function_models
elementary_structures
reasoning_with_dispositions
predictive_performance
attain
obtained
this
missing_words
laws
over
(Bikel,
Graph_unification
task
dependency_structure
currently
finite-state_models
listener
Korean
dictionary-based_word_vectors
studied
coarse-level_clustering
two
comparative
translations
should
psycholinguistic_literature
program,
limited
set
word_significance
Turkish_word_structures
conjuncts
OT
world
similar
language_independent_modules
automatic_language_identification
four-participants_face-to-face_meetings
block_reordering
oral_communication
database
interactive_question-answering_(Q/A)_system
text_processing_software
yields
topical report,
approximation
domain-specific_semantic_information
estimate
discriminative_log-linear_models
Gaussian_mixture
made
evaluation
Noun Classifier Associations (NCA)
expression
prominence
Combinatory_Categorial_Grammar_(CCG)_lexicon
ellipsis_resolution
pair
recognition_technology
ILIMP
even
Arabic-English
modules
natural_language_environment
scope_ambiguity
temporal_adverbials
thesaurus
automatic_Q/A
event
'
place
Japanese-English_translation,
segmented_strings
phrase_translations
American Sign Language (ASL) animation
TAGs
MT,
learn
determiners
text-to-speech_conversion_system
consist
models
lexical category ambiguity
scenario_templates
Chinese_punctuation_marks,
training
modified
context_free_languages
tie
data_representation
supports
Information_Extraction
dependency_relations
-speaking
smaller
speed
test_language
parallel_concordances
comes
corpus
polynomial_time
bigram_back-off_language_models
intentional_structure
semantic_verb_classes
relational_database
HDAGs
metaphors
helping
Q/A
left_corner_parsing_algorithm
utilized
's
less
semantic_equivalence
corresponding
analysed
Chinese_text
train
type
acquisition_of_word-semantic_information
VME_bus
n-best_speech/language_integration_architecture
paraphrasing
resolving
statistical_learning_mechanisms
undisambiguated
consistency_problem
still
commonly
research_articles
overall
functions
lexically-induced_relations
translates
limitations
bibliographic
text,
language_pairs
dialogue_corpora
abstract_flat_syntactic_representations,_LFG_f-structures,
raw_text
input_dataset
LCS_representations
performs
much-studied
phonological_system
context
model_theoretic_interpretation
contexts
internal_and_contextual_information
focus_of_attention
NLP_tasks
word-based_system
as
feature_selection_methods
answer_candidates
correlation_measure
news_articles
cooccurrence_patterns
deterministic_grammar
hard_problems
variable
current
source_language_text
bootstrap
finite-state_approximation
machine_translation_system
SVM
compression_ratio
calculus
segment-based_approach
noun_WSD_problems
multiple_complementation_patterns
improves
Plume's_approach_to_parsing
semantically_related_words
domain_dependence
transcription_errors
success,
logic,
broad_coverage_lexicon
word_string
capitalization
correctness
latent_variable_model
result
both
proper_names
improvement
semantic_caseframe_instantiation
word_forms
detect
appear
bottom-up_pattern-matching_parser
conceptual_operations
become
segments
A_deterministic_parser
case-based_reasoning
performed
Comparator
SI recognition,
occurring
is
multi-pathway_MT_architecture_design
passed
human_judgment
extraction
advertisements
superset_of_L
source_dependency_parse
being
i/l:::'=--~--
syntactic_disambiguation
Node-based_inference
generative_history-based_latent_variable_model
among
many
suffix_analysis
German_corpus
linguistic_information
English-Chinese_bitexts
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
generalized_metaphor_mappings
trainable_components
pruning_criteria
track
reduplications
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
generated
(e.g.
the
presented
described
lexical_similarity
operate
method_of_analyzing_metaphors
equivalences,
TiMBL,
into
XTAG
(
resolution_component
SMT_models
user_knowledge_modeling_architecture
Machine_Translation_(MT)_systems
viz.
clustering_and_filtering_processes
sometimes
instance
regarded
PCFG-LA model
derived
irrelevant
runs
statistical_alignment_models
Japanese_parsers
word_examples
language_identification
system_response
Recognition_of_proper_nouns
induced
human_understanding_of_natural_language
error
relative_error_rate_reduction
sense
generalized_metaphor
exotic,
encodes
grammaticality
data_objects
Czech_WordNet
rank,
textual
reduce
exceeds
improved
interlingua
HMM_with_Gaussian_mixture_observation_densities
unsupervised_learning_method
semi-supervised_methods
2.284
semantic-oriented_NLP_applications
fragments
Natural_Language_Processing_(NLP)_system
synonym relation
referents
alignment_adaptation_approach
biomedical_text
training_resources
Japanese_script
two-step_clustering_process
application
documents
newspaper text,
showing
complex_sentences
ordinary
Nigam
automatic_evaluation_measures
protocol_analysis
similar_context_features
natural_language_interfaces
retrieval_approach
algorithm_for_translation_lexicon_acquisition_(SABLE),
supervised_training_data
resolves
text-level_anaphora
target speaker
translation_performance
strength_of_potential_antecedence
accuracy
problem
6
HK-open,
agree
formalising
what
SRI_toolkit
produce
knowledge_engineering
context-free_grammars
define
Chinese_word_segmenter
speeches
manually_sense-tagged_data
motivated
indices
source_language
dynamic_combiner
means
text_classification_problems
language_modeling_tasks
KL-ONE_style_representation
large_Czech_MWE_database
non-terminals
scruffy_texts
paraphrases
Korean_phonological_knowledge_base_system
speech_understanding
features
MT_system
interpretation
sentence_plans
provide
vectors
sublanguage,
cooperative_responses
results
Penn_WSJ
antecedence_recovery
newswire_texts
sense_priors
ability
tasks
patterns
CSR
PK-closed,
restricted_vocabulary
Minimum_Bayes-Risk_framework
substrings
Polish
feature-based_word_grammar
indirectly
declarative_formalism
phrases
dialog_systems
personal_names,
97.24%
suffix_array-based_data_structure
deaf
advantages
comma_checker
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
natural_language_system
directionality
manually_segmented_corpus
certain
various
texts
subcategorization_frame_(SCF)
best-reported
meta-inference_types
do
English-Japanese_machine_translation,
dialogue_interaction
coordinations
working
classifier
interactions
DARPA_Resource_Management_corpus
included
finite
limits
Japanese_verb_phrases
format
MORphological_PArser_MORPA
subset
present
easy
challenges
sparsity_of_the_feature_space
lexical_approaches
language_acquisition
ungrammatical input
linguistic_resources
references
weather
with
labeled
underspecified representations
LTAG
linguistic_introspection
grammar_sensu_stricto
inferred
human_transcriptions
"conventional"_context-free_morphological_grammar
retrieve
structured_natural_language_data
discovered
statistical_alignment_techniques
subcategorization_acquisition
parse_forest_representation
by
Bayesian_learning
biases
information_redundancy
word_error_rate
histogram
met
typicality
appropriate
editor
Message_Understanding_Conferences
text_applications
parallel_structures
describing
sentence
events
syntax-based_constraint
known_deterministic_parser
NLP
Web
presuppositional_nature
senses
phrase_boundary_heuristics
well
lexical_conceptual_structure_(LCS)_representations
metric
uniform_processing
put
but
agenda-based_scheduling_parser
TAG
tutorial_dialogue
predicate_calculus_notation
f-structures
tagging_strategies
contains
translation lexicons
unsupervised_learning
standard
languages
word-sense_disambiguation_systems,
context-sensitive,_phrase_structure_grammar
machine-readable_dictionaries_(MRD's)
(Karttunen,
generators
impacts
manual_transcription
quantified_sentences,
JAVELIN_system
marine
